/*
Navicat MySQL Data Transfer

Source Server         : tenxun
Source Server Version : 50552
Source Host           : www.303studio.cn:3306
Source Database       : teacher_class_system

Target Server Type    : MYSQL
Target Server Version : 50552
File Encoding         : 65001

Date: 2016-11-19 05:20:04
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for cb_tc_com_exc201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_com_exc201601`;
CREATE TABLE `cb_tc_com_exc201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_com_exc201601
-- ----------------------------
INSERT INTO `cb_tc_com_exc201601` VALUES ('1', '2016学年上学期计算机科学与技术（卓越班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_com_exc201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('4', '2013', '计算机科学与技术（卓越班）', '96', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', '企业开课，理论20学时，上机20学时 ');
INSERT INTO `cb_tc_com_exc201601` VALUES ('5', '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '；', '张浩；', '；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('6', '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '；', '赵彦敏；', '；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('7', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('8', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '；1-12；1--12；', '何振峰；刘秉瀚；陈晖；', '理论与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）刘秉瀚、陈晖合作上1个班，希望安排在下午的5，6节。；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('9', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('10', '2014', '计算机科学与技术（卓越班）', '125', ' 概率论与数理统计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('11', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9；；；', '王秀；白清源；陈欢；', '；；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('12', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('13', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '郑相涵；', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('14', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('15', '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在11～18周的下午；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('16', '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '；', '吴小竹；', '；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('17', '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '；', '於志勇；', '；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('18', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周；；；', '陈昭炯；林世平；', '不排在上午1-2节；；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('19', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('20', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('21', '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '1-16；', '丁善镜；', '第3，4节；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('22', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('23', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('24', '2014', '计算机科学与技术（卓越班）', '125', ' 网络和系统性能评估', '  学科专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('25', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周；第1周--8周；', '倪一涛；苏力；', '；周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('26', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周；第3-18周；', '倪一涛；苏力；', '请安排周末；1.请同学选课和理论课老师相同。2.尽量选实验，否则理论课学习会受影响；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('27', '2014', '计算机科学与技术（卓越班）', '125', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_exc201601` VALUES ('28', '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '；', '张浩；', '；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('29', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；', '陈勃；王一蕾；', '；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('30', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1-12；1~12周；', '胡颖；董晨；', '周一3、4节周三7、8节；如果可以，请排在周1的3、4节和周3的7，8节；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('31', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；第6周开始~期末；', '胡颖；董晨；', '周六1-8节；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('32', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '；1-14；', '王一蕾；余春艳；', '；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('33', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；1-16；；', '孙岚；王秀；林秋月；', '；；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('34', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10；3-10；；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；；');
INSERT INTO `cb_tc_com_exc201601` VALUES ('35', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；');

-- ----------------------------
-- Table structure for cb_tc_com_nor201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_com_nor201601`;
CREATE TABLE `cb_tc_com_nor201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_com_nor201601
-- ----------------------------
INSERT INTO `cb_tc_com_nor201601` VALUES ('1', '2016学年上学期计算机开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_com_nor201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('4', '2013', '计算机科学与技术', '62', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '张浩、蔣启强、何萧玲', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('5', '2013', '计算机科学与技术', '62', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('6', '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在2～9周的下午；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('7', '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16；', '丁善镜；', '第5，6节；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('8', '2013', '计算机科学与技术', '62', ' 分布式系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('9', '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('10', '2013', '计算机科学与技术', '62', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', '理论20学时，上机20学时');
INSERT INTO `cb_tc_com_nor201601` VALUES ('11', '2013', '计算机科学与技术', '62', ' 软件可靠性与可信软件', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('12', '2013', '计算机科学与技术', '62', ' 虚拟现实', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('13', '2013', '计算机科学与技术', '62', ' 云计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('14', '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '；', '赵彦敏；', '；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('15', '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '1-16；', '陈嘉；', '因课时较多，希望能一周少安排一些课，多安排几周；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('16', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('17', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1--12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('18', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('19', '2014', '计算机科学与技术', '15', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('20', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9；；；；', '王秀；陈欢；白清源；', '；；；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('21', '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('22', '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11；', '谢伙生；', '；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('23', '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '1-8；', '郑相涵；', '；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('24', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('25', '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在11～18周的下午；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('26', '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '；', '吴小竹；', '；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('27', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周；；；', '陈昭炯；林世平；', '不排在上午1-2节；；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('28', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('29', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('30', '2014', '计算机科学与技术', '15', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '丁善镜；', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('31', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('32', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('33', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周；第1-8周；', '倪一涛；苏力；', '；周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('34', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周；低3-18周；', '倪一涛；苏力；', '请安排周末；实验课和理论课选相同老师，实验课尽量要选，否则可能影响理论课的学习和考试；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('35', '2014', '计算机科学与技术', '15', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_nor201601` VALUES ('36', '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '；', '张浩；', '01-06周 星期4:9-10节 理论课 01-07周 星期4:7-8节 实验课；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('37', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；1-18；', '陈勃；王一蕾；孙岚；', '；；请尽量不要排1、2节课；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('38', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1~12；', '胡颖；董晨；', '周一3、4节周三7、8节；如果可以，请安排在周1的3、4节和周3的7、8节；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('39', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；6~期末；', '胡颖；董晨；', '周六1-8；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('40', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '；1-13；1-14；', '傅仰耿；余春艳；', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('41', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；1-16；；', '孙岚；王秀；林秋月；', '；；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('42', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10；3-10；；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；；');
INSERT INTO `cb_tc_com_nor201601` VALUES ('43', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；');

-- ----------------------------
-- Table structure for cb_tc_com_ope201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_com_ope201601`;
CREATE TABLE `cb_tc_com_ope201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_com_ope201601
-- ----------------------------
INSERT INTO `cb_tc_com_ope201601` VALUES ('1', '2016学年上学期计算机科学与技术（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_com_ope201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('4', '2013', '计算机科学与技术（实验班）', '60', ' GPU高性能计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('5', '2013', '计算机科学与技术（实验班）', '60', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', ' 张浩; 蔣启强;何萧玲', '合班上');
INSERT INTO `cb_tc_com_ope201601` VALUES ('6', '2013', '计算机科学与技术（实验班）', '60', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('7', '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在2～9周的下午；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('8', '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16；', '丁善镜；', '第5，6节；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('9', '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('10', '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '；', '林秋月；', '企业开课；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('11', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('12', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画课程设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('13', '2013', '计算机科学与技术（实验班）', '60', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('14', '2013', '计算机科学与技术（实验班）', '60', ' 计算机辅助设计', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('15', '2013', '计算机科学与技术（实验班）', '60', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('16', '2013', '计算机科学与技术（实验班）', '60', ' 近世代数', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('17', '2013', '计算机科学与技术（实验班）', '60', ' 软件可靠性', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('18', '2013', '计算机科学与技术（实验班）', '60', ' 数学物理方程', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('19', '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '1-8；', '傅仰耿；', '不安排周一和周五；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('20', '2013', '计算机科学与技术（实验班）', '60', ' 移动编程实践', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('21', '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '；', '林秋月；', '；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('22', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('23', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1-12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('24', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('25', '2014', '计算机科学与技术（实验班）', '73', ' 复变函数', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('26', '2014', '计算机科学与技术（实验班）', '73', ' 概率论与数理统计', '  公共必修', '4', '64', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('27', '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '第3-8周；', '苏力；', '周2，周4。麻烦和普通班班的《现代计算机接口技术》连排，最好3，4节连排5,6节，实验课连排4节；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('28', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '；；', '白清源；', '；；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('29', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('30', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11；', '谢伙生；', '；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('31', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('32', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第1周；；', '叶东毅；', '请尽量安排在上午3-4节；单独开班');
INSERT INTO `cb_tc_com_ope201601` VALUES ('33', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('34', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('35', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('36', '2014', '计算机科学与技术（实验班）', '73', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('37', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('38', '2014', '计算机科学与技术（实验班）', '73', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_com_ope201601` VALUES ('39', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '第一周；', '张浩；', '01-06周 星期4:9-10节 理论课 |||   01-07周 星期4:7-8节 实验课');
INSERT INTO `cb_tc_com_ope201601` VALUES ('40', '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '；', '陈欢；', '单独开班');
INSERT INTO `cb_tc_com_ope201601` VALUES ('41', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1-12；1~12周；', '胡颖；郭龙坤；董晨；', '周一3、4节周三7、8节；时间为周一与周三，与董辰合上，时间须错开。；由于龙坤在国外，前几周董晨上，后几周郭龙坤上。请尽量安排在董晨普通班同一个时间段，如：同一个上午或下午，或3、4节和5、6节。非常感谢；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('42', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-17；6-18；', '胡颖；郭龙坤；', '周六1-8；；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('43', '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-15；', '吴英杰；', '独立开班，因有多个周末需带学生外出比赛，烦请尽量排在周二至周四，谢谢！；');
INSERT INTO `cb_tc_com_ope201601` VALUES ('44', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；；；', '刘文犀；', '单独开班');
INSERT INTO `cb_tc_com_ope201601` VALUES ('45', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '；；', '林世平；', '单独开班');
INSERT INTO `cb_tc_com_ope201601` VALUES ('46', '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '；', '林世平；', '单独开班');
INSERT INTO `cb_tc_com_ope201601` VALUES ('47', '2016', '计算机科学与技术(实验班)', '70', '学术英语表达', '选修', '2', '32', '', '', '第7星期开始', '', '');

-- ----------------------------
-- Table structure for cb_tc_inf_sec201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_inf_sec201601`;
CREATE TABLE `cb_tc_inf_sec201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_inf_sec201601
-- ----------------------------
INSERT INTO `cb_tc_inf_sec201601` VALUES ('1', '2016学年上学期信息安全专业开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('4', '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '(何萧玲、张浩合上)；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('5', '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '；', '孙及园；', '；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('6', '2013', '信息安全', '37', ' 安全协议导论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('7', '2013', '信息安全', '37', ' 电子商务信息安全技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('8', '2013', '信息安全', '37', ' 可信系统与可信计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('9', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '第九周；；', '张浩；倪一涛；', '每次四节课，张浩、李应、倪一涛、邹剑、何萧玲共同承担；；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('10', '2014', '信息安全', '39', ' Java语言程序设计', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('11', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('12', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1-12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('13', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('14', '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '刘延华；', '请不要安排在1-2节和7-8节，谢谢！；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('15', '2014', '信息安全', '39', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('16', '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '1至8周；', '倪一涛；', '请安排在院实验室上课；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('17', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '第一周；；', '陈昭炯；林世平；', '不排在上午1-2节；；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('18', '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '；', '白清源；', '；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('19', '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '1-16周；', '陈开志；', '安排下午上课，5-8节之间都可以；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('20', '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '第一周；', '张浩；', '和去年一样星期2,5:3-4节; 尽量安排在上午3、4节课；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('21', '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '第四周；', '张浩；', '和去年一样星期2：5-8节；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('22', '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '15-19周；', '何萧玲；', '请安排每周一次，每次8学时，请安排在周六，谢谢；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('23', '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '12-19周；', '何萧玲；', '请12-17周每周2次课，每次3学时（可否安排在晚上？不行请安排下午，谢谢），第18周，每周两次，每次2学时，19周上机，每周两次，每次4学时。（钟尚平老师合班上课）；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('24', '2014', '信息安全', '39', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('25', '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '；', '孙及园；', '请安排在1～18周的下午，每周2节课；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('26', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；', '陈勃；王一蕾；', '；请尽量将我的课排在上午；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('27', '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '1-16；', '杨旸；', '请排3-4节课，谢谢！；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('28', '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '5-16；', '杨旸；', '4节连上！请排一个上午或一个下午；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('29', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1~12；', '胡颖；董晨；', '周一3、4节，周三7、8节；如果可以，请安排在周1的3、4节和周3的7、8节；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('30', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；6~期末；', '胡颖；董晨；', '周六1-8节；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('31', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14；1-13；', '余春艳；傅仰耿；', '；（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('32', '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；', '林秋月；', '；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('33', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10；3-10；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('34', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；');
INSERT INTO `cb_tc_inf_sec201601` VALUES ('35', '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '陈明志；', '；');

-- ----------------------------
-- Table structure for cb_tc_infcom_ope201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_infcom_ope201601`;
CREATE TABLE `cb_tc_infcom_ope201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_infcom_ope201601
-- ----------------------------
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('1', '2016学年上学期数学类（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('4', '2013', '数学与应用数学（实验班）', '23', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '按时打算', '黄建军', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('5', '2013', '数学与应用数学（实验班）', '23', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '蒋秀凤', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('6', '2013', '数学与应用数学（实验班）', '23', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '叶丛峰', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('7', '2013', '数学与应用数学（实验班）', '23', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '林华', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('8', '2013', '数学与应用数学（实验班）', '23', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('9', '2013', '数学与应用数学（实验班）', '23', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '张华娣', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('10', '2013', '数学与应用数学（实验班）', '23', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '曾有栋', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('11', '2013', '数学与应用数学（实验班）', '23', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('12', '2013', '数学与应用数学（实验班）', '23', ' 随机分析', '  专业选修', '3', '48', '', '', '', '张文钊', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('13', '2013', '数学与应用数学（实验班）', '23', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('14', '2013', '数学与应用数学（实验班）', '23', ' 专业实习', '  实践环节', '3', '', '', '', '', '林华', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('15', '2013', '数学与应用数学（实验班）', '23', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '侯建锋', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('16', '2013', '信息与计算科学（实验班）', '9', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '黄建军', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('17', '2013', '信息与计算科学（实验班）', '9', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '蒋秀凤', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('18', '2013', '信息与计算科学（实验班）', '9', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '叶丛峰', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('19', '2013', '信息与计算科学（实验班）', '9', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '林华', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('20', '2013', '信息与计算科学（实验班）', '9', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('21', '2013', '信息与计算科学（实验班）', '9', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '张华娣', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('22', '2013', '信息与计算科学（实验班）', '9', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '曾有栋', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('23', '2013', '信息与计算科学（实验班）', '9', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('24', '2013', '信息与计算科学（实验班）', '9', ' 随机分析', '  专业选修', '3', '48', '', '', '', '张文钊', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('25', '2013', '信息与计算科学（实验班）', '9', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('26', '2013', '信息与计算科学（实验班）', '9', ' 专业实习', '  实践环节', '3', '', '', '', '', '林华', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('27', '2013', '信息与计算科学（实验班）', '9', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '侯建锋', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('28', '2014', '数学与应用数学（实验班）', '21', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '何建农', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('29', '2014', '数学与应用数学（实验班）', '21', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '林丽琼', '独立开班');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('30', '2014', '数学与应用数学（实验班）', '21', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '蒋秀凤', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('31', '2014', '数学与应用数学（实验班）', '21', ' 复变函数', '  学科必修', '3', '48', '', '', '', '舒志彪', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('32', '2014', '数学与应用数学（实验班）', '21', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '单红', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('33', '2014', '数学与应用数学（实验班）', '21', ' 金融分析', '  专业选修', '3', '48', '', '', '', '王晶海', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('34', '2014', '数学与应用数学（实验班）', '21', ' 近世代数', '  学科必修', '3', '48', '', '', '', '刘月', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('35', '2014', '数学与应用数学（实验班）', '21', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '黄建军', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('36', '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '；', '林锦', '；');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('37', '2014', '数学与应用数学（实验班）', '21', ' 数理统计', '  学科必修', '3', '48', '', '', '', '梁飞豹', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('38', '2014', '数学与应用数学（实验班）', '21', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '江飞', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('39', '2014', '数学与应用数学（实验班）', '21', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('40', '2014', '数学与应用数学（实验班）', '21', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '江辉有', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('41', '2014', '数学与应用数学（实验班）', '21', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('42', '2014', '信息与计算科学（实验班）', '9', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '何建农', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('43', '2014', '信息与计算科学（实验班）', '9', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '林丽琼', '独立开班');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('44', '2014', '信息与计算科学（实验班）', '9', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '蒋秀凤', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('45', '2014', '信息与计算科学（实验班）', '9', ' 复变函数', '  学科必修', '3', '48', '', '', '', '舒志彪', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('46', '2014', '信息与计算科学（实验班）', '9', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '单红', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('47', '2014', '信息与计算科学（实验班）', '9', ' 金融分析', '  专业选修', '3', '48', '', '', '', '王晶海', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('48', '2014', '信息与计算科学（实验班）', '9', ' 近世代数', '  学科必修', '3', '48', '', '', '', '刘月', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('49', '2014', '信息与计算科学（实验班）', '9', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '黄建军', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('50', '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '；', '林锦', '；');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('51', '2014', '信息与计算科学（实验班）', '9', ' 数理统计', '  学科必修', '3', '48', '', '', '', '梁飞豹', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('52', '2014', '信息与计算科学（实验班）', '9', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '江飞', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('53', '2014', '信息与计算科学（实验班）', '9', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('54', '2014', '信息与计算科学（实验班）', '9', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '江辉有', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('55', '2014', '信息与计算科学（实验班）', '9', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('56', '2015', '数学类（实验班）', '29', ' Web设计软件应用实训', '  实践环节', '2', '48', '', '', '', '李剑敏', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('57', '2015', '数学类（实验班）', '29', ' 常微分方程', '  学科必修', '3', '48', '', '', '', '张惠英', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('58', '2015', '数学类（实验班）', '29', ' 数据结构', '  学科必修', '3.5', '56', '', '16', '', '陈晓云', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('59', '2015', '数学类（实验班）', '29', ' 数据库原理及应用', '  专业选修', '3', '48', '', '16', '', '史正平', '理论与上机都排在周一');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('60', '2015', '数学类（实验班）', '29', ' 数理逻辑', '  学科必修', '2', '32', '', '', '', '赖降周', '10月份开始上课');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('61', '2015', '数学类（实验班）', '29', ' 数学分析（下）', '  学科必修', '6', '96', '', '', '', '陈晓星', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('62', '2016', '数学类（实验班）', '1', ' 高等代数（上）', '  学科必修', '3.5', '56', '', '', '', '常安', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('63', '2016', '数学类（实验班）', '1', ' 解析几何', '  学科必修', '2.5', '40', '', '', '', '谭宜家', '普通班、实验班合上');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('64', '2016', '数学类（实验班）', '1', ' 数学分析（上）', '  学科必修', '5', '80', '', '', '', '沈明', '');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('65', '2016', '数学类（实验班）', '1', ' 数学学科导论（数学史）', '  学科必修', '1', '16', '', '', '', '谭宜家', '每周2节');
INSERT INTO `cb_tc_infcom_ope201601` VALUES ('66', '2016', '数学类(实验班)', '29', '学术英语表达', '选修', '2', '32', '', '', '第7星期开始', '', '');

-- ----------------------------
-- Table structure for cb_tc_math_nor201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_math_nor201601`;
CREATE TABLE `cb_tc_math_nor201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of cb_tc_math_nor201601
-- ----------------------------
INSERT INTO `cb_tc_math_nor201601` VALUES ('1', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_math_nor201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('4', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '；1-3周', '；林锦', '；不要晚上派克');
INSERT INTO `cb_tc_math_nor201601` VALUES ('5', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '；', '；林锦', '；');
INSERT INTO `cb_tc_math_nor201601` VALUES ('6', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('7', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('8', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('9', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('10', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('11', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('12', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('13', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('14', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('15', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('16', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('17', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('18', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('19', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('20', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('21', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('22', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('23', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('24', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('25', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('26', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('27', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('28', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('29', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('30', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('31', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('32', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('33', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('34', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('35', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('36', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('37', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('38', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('39', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('40', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('41', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('42', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('43', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('44', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('45', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('46', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('47', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('48', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201601` VALUES ('49', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- ----------------------------
-- Table structure for cb_tc_math_nor201602
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_math_nor201602`;
CREATE TABLE `cb_tc_math_nor201602` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of cb_tc_math_nor201602
-- ----------------------------
INSERT INTO `cb_tc_math_nor201602` VALUES ('1', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_math_nor201602` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('4', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('5', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('6', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('7', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('8', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('9', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('10', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('11', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('12', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('13', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('14', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('15', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('16', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('17', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('18', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('19', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('20', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('21', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('22', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('23', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('24', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('25', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('26', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('27', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('28', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('29', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('30', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('31', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('32', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('33', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('34', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('35', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('36', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('37', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('38', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('39', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('40', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('41', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('42', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('43', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('44', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('45', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('46', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('47', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', '');
INSERT INTO `cb_tc_math_nor201602` VALUES ('48', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '；232323；问问', '；林锦；蒋秀凤', '；123123123；为');
INSERT INTO `cb_tc_math_nor201602` VALUES ('49', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '；123123123', '；林锦', '；3443534534534');

-- ----------------------------
-- Table structure for cb_tc_net_pro201602
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_net_pro201602`;
CREATE TABLE `cb_tc_net_pro201602` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of cb_tc_net_pro201602
-- ----------------------------
INSERT INTO `cb_tc_net_pro201602` VALUES ('1', '2016学年下学期网络工程专业 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_net_pro201602` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('4', '2012', '网络工程', '32', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '1；', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('5', '2012', '网络工程', '32', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('6', '2013', '网络工程', '28', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('7', '2013', '网络工程', '28', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('8', '2013', '网络工程', '28', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('9', '2013', '网络工程', '28', ' Web程序设计', '  专业必修（限选）', '2', '32', '', '8', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('10', '2013', '网络工程', '28', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('11', '2013', '网络工程', '28', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('12', '2013', '网络工程', '28', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('13', '2013', '网络工程', '28', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('14', '2013', '网络工程', '28', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('15', '2013', '网络工程', '28', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('16', '2013', '网络工程', '28', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('17', '2013', '网络工程', '28', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('18', '2013', '网络工程', '28', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('19', '2013', '网络工程', '28', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('20', '2013', '网络工程', '28', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('21', '2013', '网络工程', '28', ' 计算机网络管理', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('22', '2013', '网络工程', '28', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('23', '2013', '网络工程', '28', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('24', '2013', '网络工程', '28', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('25', '2013', '网络工程', '28', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('26', '2013', '网络工程', '28', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('27', '2013', '网络工程', '28', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('28', '2013', '网络工程', '28', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('29', '2013', '网络工程', '28', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('30', '2013', '网络工程', '28', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('31', '2013', '网络工程', '28', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('32', '2013', '网络工程', '28', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('33', '2013', '网络工程', '28', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('34', '2013', '网络工程', '28', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('35', '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '；1-6周；2-9周', '；林锦；张小东', '；不要晚上；不要白天');
INSERT INTO `cb_tc_net_pro201602` VALUES ('36', '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '；2-8周', '；林锦', '；不要白天');
INSERT INTO `cb_tc_net_pro201602` VALUES ('37', '2013', '网络工程', '28', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('38', '2013', '网络工程', '28', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('39', '2013', '网络工程', '28', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('40', '2013', '网络工程', '28', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('41', '2013', '网络工程', '28', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `cb_tc_net_pro201602` VALUES ('42', '2013', '网络工程', '28', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', '');

-- ----------------------------
-- Table structure for cb_tc_soft_pro201601
-- ----------------------------
DROP TABLE IF EXISTS `cb_tc_soft_pro201601`;
CREATE TABLE `cb_tc_soft_pro201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of cb_tc_soft_pro201601
-- ----------------------------
INSERT INTO `cb_tc_soft_pro201601` VALUES ('1', '2016学年上学期软件学院开课通知书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('2', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('3', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('4', '2013', '软件工程', '147', ' .NET Framework应用开发', '  专业选修', '2', '32', '', '8', '', '不开课', '');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('5', '2013', '软件工程', '147', ' Web应用软件工程', '  专业选修', '2', '32', '', '', '', '不开课', '');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('6', '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '；', '陈星；', '已上过两学期；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('7', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课；；', '邓新国；', '早晚送、接小孩，请不排12、78节；；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('8', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '；；；；', '统一安排(王灿辉)', '《8人，11月份出国访问，是否可以带由系里决定；8个学生；；；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('9', '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '正常安排；', '陈嘉；', '上机课安排在理论课后，希望上机课4节连排；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('10', '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '；', '陈家瑞；', '因接小孩，希望理论课不要排在78节；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('11', '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '正常安排；', '陈昱；', '请尽量不安排上午12节；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('12', '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '；', '吴小竹；', '；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('13', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '正常安排；', '刘延华；江兰帆；', '请不要安排在1-2节和7-8节，谢谢！；一周4节，请不安排12节；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('14', '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '1-8；', '陈建华；', '；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('15', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '2-12；；', '程红举；游天童；', '分成两个班，和游天童老师合上，每周一个下午4节课；分两班，每班一上午或一下午；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('16', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '；；', '於志勇；游天童；', '(游天童，於志勇)；分两班，安排在同一上午或下午，不同时段。；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('17', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '；；', '陈星；张舒；', '已上过两学期；实验课安排在课程最后，周五不排课；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('18', '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课；', '邓新国；', '早晚送、接小孩，请不排12、78节；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('19', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '从第10周开始；；；', '夏又生；陈飞；', '每周2次（每次2节）或每周1次（每次3节）；上课时间与夏又生老师一致；；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('20', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '；；', '詹青青；姚仰光；', '；接送小孩不安排1，2节；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('21', '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '1-16；', '陈建利；', '大班上课不分班，课程陈建利与朱文兴合上；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('22', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '；；；；', '统一安排(王灿辉)', '11月份出国访问，是否可以带由系里决定；8个学生；；；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('23', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '；1-16；', '王一蕾；傅仰耿；', '请尽量将我的课排在上午；不排周一上下午及周五下午；');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('24', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '；；2342423', '王灿辉；陈飞；；林锦', '分2个班，上课时间与王灿辉老师一致；；234234234');
INSERT INTO `cb_tc_soft_pro201601` VALUES ('25', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '2-12；正常安排；；234234234', '程红举；陈昱；；林锦', '和陈昱分成两个班，每周3节；请尽量不安排上午12节；；2342354646545645');

-- ----------------------------
-- Table structure for department_head_majors
-- ----------------------------
DROP TABLE IF EXISTS `department_head_majors`;
CREATE TABLE `department_head_majors` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `major` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `privilege` int(1) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of department_head_majors
-- ----------------------------
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_com_exc', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_com_nor', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_com_ope', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_infcom_ope', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_math_nor', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_math_ope', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_mathsub_ope', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('06033', 'tc_soft_pro', '0');
INSERT INTO `department_head_majors` VALUES ('06099', 'tc_infcom_ope', '1');
INSERT INTO `department_head_majors` VALUES ('06099', 'tc_math_nor', '1');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_com_exc', '0');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_com_nor', '0');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_com_ope', '0');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('07106', 'tc_soft_pro', '1');
INSERT INTO `department_head_majors` VALUES ('09070', 'tc_infcom_ope', '1');
INSERT INTO `department_head_majors` VALUES ('09070', 'tc_math_nor', '0');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_com_exc', '1');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_com_nor', '1');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_com_ope', '1');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('10044', 'tc_soft_pro', '0');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_com_exc', '1');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_com_nor', '1');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_com_ope', '1');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('11061', 'tc_soft_pro', '0');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_com_exc', '0');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_com_nor', '0');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_com_ope', '0');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_inf_sec', '1');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_net_pro', '1');
INSERT INTO `department_head_majors` VALUES ('11065', 'tc_soft_pro', '0');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_com_exc', '1');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_com_nor', '1');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_com_ope', '1');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('12095', 'tc_soft_pro', '0');
INSERT INTO `department_head_majors` VALUES ('83040', 'tc_infcom_ope', '0');
INSERT INTO `department_head_majors` VALUES ('83040', 'tc_math_nor', '1');
INSERT INTO `department_head_majors` VALUES ('89036', 'tc_infcom_ope', '1');
INSERT INTO `department_head_majors` VALUES ('89036', 'tc_math_nor', '1');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_com_exc', '0');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_com_nor', '0');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_com_ope', '0');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_inf_sec', '0');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_net_pro', '0');
INSERT INTO `department_head_majors` VALUES ('90010', 'tc_soft_pro', '1');
INSERT INTO `department_head_majors` VALUES ('92034', 'tc_infcom_ope', '1');
INSERT INTO `department_head_majors` VALUES ('92034', 'tc_math_nor', '1');

-- ----------------------------
-- Table structure for task_info
-- ----------------------------
DROP TABLE IF EXISTS `task_info`;
CREATE TABLE `task_info` (
  `relativeTable` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `year` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `semester` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `departmentDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `teacherDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `taskState` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of task_info
-- ----------------------------
INSERT INTO `task_info` VALUES ('tc_com_exc201601', '2016', '01', '20160420', '20160418', '2');
INSERT INTO `task_info` VALUES ('tc_com_nor201601', '2016', '01', '20160420', '20160418', '2');
INSERT INTO `task_info` VALUES ('tc_com_ope201601', '2016', '01', '20160420', '20160418', '2');
INSERT INTO `task_info` VALUES ('tc_inf_sec201601', '2016', '01', '20160420', '20160418', '2');
INSERT INTO `task_info` VALUES ('tc_infcom_ope201601', '2016', '01', '20160420', '20160418', '2');
INSERT INTO `task_info` VALUES ('tc_math_nor201601', '2016', '01', '20161027', '20161014', '2');
INSERT INTO `task_info` VALUES ('tc_math_nor201602', '2016', '02', '20161126', '20161111', '1');
INSERT INTO `task_info` VALUES ('tc_net_pro201602', '2016', '02', '2016/10/27', '2016/10/20', '2');
INSERT INTO `task_info` VALUES ('tc_soft_pro201601', '2016', '01', '20160910', '20161010', '2');

-- ----------------------------
-- Table structure for tc_com_exc201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_com_exc201601`;
CREATE TABLE `tc_com_exc201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_com_exc201601
-- ----------------------------
INSERT INTO `tc_com_exc201601` VALUES ('1', '', '2016学年上学期计算机科学与技术（卓越班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_com_exc201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('4', '', '2013', '计算机科学与技术（卓越班）', '96', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('5', '', '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('5', '06033', '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '', '张浩', '');
INSERT INTO `tc_com_exc201601` VALUES ('6', '', '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('6', '03112', '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '赵彦敏', '');
INSERT INTO `tc_com_exc201601` VALUES ('7', '', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('7', '03003', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_exc201601` VALUES ('7', '89085', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_exc201601` VALUES ('8', '', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('8', '03154', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '1--12', '陈晖', '（刘秉瀚、陈晖）刘秉瀚、陈晖合作上1个班，希望安排在下午的5，6节。');
INSERT INTO `tc_com_exc201601` VALUES ('8', '04166', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '', '何振峰', '理论与实践课选同一老师');
INSERT INTO `tc_com_exc201601` VALUES ('8', '83046', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。');
INSERT INTO `tc_com_exc201601` VALUES ('9', '', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('9', '03154', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_exc201601` VALUES ('9', '04166', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '何振峰', '理论与实践课选同一老师');
INSERT INTO `tc_com_exc201601` VALUES ('9', '83046', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_exc201601` VALUES ('10', '', '2014', '计算机科学与技术（卓越班）', '125', ' 概率论与数理统计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('11', '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('11', '02124', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9', '王秀', '');
INSERT INTO `tc_com_exc201601` VALUES ('11', '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_exc201601` VALUES ('11', '88005', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_exc201601` VALUES ('12', '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('12', '85118', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。');
INSERT INTO `tc_com_exc201601` VALUES ('13', '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('14', '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('14', '03058', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节');
INSERT INTO `tc_com_exc201601` VALUES ('14', '10011', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节');
INSERT INTO `tc_com_exc201601` VALUES ('15', '', '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('15', '02005', '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '', '孙及园', '请安排在11～18周的下午');
INSERT INTO `tc_com_exc201601` VALUES ('16', '', '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('16', '02125', '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '吴小竹', '');
INSERT INTO `tc_com_exc201601` VALUES ('17', '', '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('17', '11013', '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '', '於志勇', '');
INSERT INTO `tc_com_exc201601` VALUES ('18', '', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('18', '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_exc201601` VALUES ('18', '85073', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '林世平', '');
INSERT INTO `tc_com_exc201601` VALUES ('18', '87007', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节');
INSERT INTO `tc_com_exc201601` VALUES ('19', '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('19', '10044', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_exc201601` VALUES ('19', '11048', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_exc201601` VALUES ('19', '94176', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节');
INSERT INTO `tc_com_exc201601` VALUES ('20', '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('20', '10044', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_exc201601` VALUES ('20', '11048', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_exc201601` VALUES ('20', '94176', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '3-18', '汪璟玢', '4节连上');
INSERT INTO `tc_com_exc201601` VALUES ('21', '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('21', '95057', '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '1-16', '丁善镜', '第3，4节');
INSERT INTO `tc_com_exc201601` VALUES ('22', '', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('22', '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_exc201601` VALUES ('22', '88005', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_exc201601` VALUES ('23', '', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('23', '82058', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401');
INSERT INTO `tc_com_exc201601` VALUES ('23', '96031', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404');
INSERT INTO `tc_com_exc201601` VALUES ('24', '', '2014', '计算机科学与技术（卓越班）', '125', ' 网络和系统性能评估', '  学科专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('25', '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('25', '95015', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '第1周--8周', '苏力', '周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节');
INSERT INTO `tc_com_exc201601` VALUES ('25', '98004', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', '');
INSERT INTO `tc_com_exc201601` VALUES ('26', '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('26', '95015', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '第3-18周', '苏力', '1.请同学选课和理论课老师相同。2.尽量选实验，否则理论课学习会受影响');
INSERT INTO `tc_com_exc201601` VALUES ('26', '98004', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周', '倪一涛', '请安排周末');
INSERT INTO `tc_com_exc201601` VALUES ('27', '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('28', '', '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('28', '06033', '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '张浩', '');
INSERT INTO `tc_com_exc201601` VALUES ('29', '', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('29', '03171', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', '');
INSERT INTO `tc_com_exc201601` VALUES ('29', '08076', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', '');
INSERT INTO `tc_com_exc201601` VALUES ('30', '', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('30', '03009', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1~12周', '董晨', '如果可以，请排在周1的3、4节和周3的7，8节');
INSERT INTO `tc_com_exc201601` VALUES ('30', '88064', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节');
INSERT INTO `tc_com_exc201601` VALUES ('31', '', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('31', '03009', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '第6周开始~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室');
INSERT INTO `tc_com_exc201601` VALUES ('31', '88064', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8节');
INSERT INTO `tc_com_exc201601` VALUES ('32', '', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('32', '03171', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '', '王一蕾', '');
INSERT INTO `tc_com_exc201601` VALUES ('32', '04059', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '1-14', '余春艳', '');
INSERT INTO `tc_com_exc201601` VALUES ('33', '', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('33', '02124', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '1-16', '王秀', '');
INSERT INTO `tc_com_exc201601` VALUES ('33', '03161', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', '');
INSERT INTO `tc_com_exc201601` VALUES ('33', '15028', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', '');
INSERT INTO `tc_com_exc201601` VALUES ('34', '', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('34', '08076', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10', '陈勃', '');
INSERT INTO `tc_com_exc201601` VALUES ('34', '15041', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_exc201601` VALUES ('34', '85118', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。');
INSERT INTO `tc_com_exc201601` VALUES ('35', '', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_exc201601` VALUES ('35', '08076', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', '');
INSERT INTO `tc_com_exc201601` VALUES ('35', '85118', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', '');

-- ----------------------------
-- Table structure for tc_com_nor201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_com_nor201601`;
CREATE TABLE `tc_com_nor201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_com_nor201601
-- ----------------------------
INSERT INTO `tc_com_nor201601` VALUES ('1', '', '2016学年上学期计算机开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_com_nor201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('4', '', '2013', '计算机科学与技术', '62', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('5', '', '2013', '计算机科学与技术', '62', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('6', '', '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('6', '02005', '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在2～9周的下午');
INSERT INTO `tc_com_nor201601` VALUES ('7', '', '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('7', '95057', '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16', '丁善镜', '第5，6节');
INSERT INTO `tc_com_nor201601` VALUES ('8', '', '2013', '计算机科学与技术', '62', ' 分布式系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('9', '', '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('9', '03030', '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '蒋启强', '');
INSERT INTO `tc_com_nor201601` VALUES ('10', '', '2013', '计算机科学与技术', '62', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('11', '', '2013', '计算机科学与技术', '62', ' 软件可靠性与可信软件', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('12', '', '2013', '计算机科学与技术', '62', ' 虚拟现实', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('13', '', '2013', '计算机科学与技术', '62', ' 云计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('14', '', '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('14', '03112', '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '赵彦敏', '');
INSERT INTO `tc_com_nor201601` VALUES ('15', '', '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('15', '06420', '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '1-16', '陈嘉', '因课时较多，希望能一周少安排一些课，多安排几周');
INSERT INTO `tc_com_nor201601` VALUES ('16', '', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('16', '03003', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_nor201601` VALUES ('16', '89085', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_nor201601` VALUES ('17', '', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('17', '03154', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '1--12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。');
INSERT INTO `tc_com_nor201601` VALUES ('17', '04166', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_com_nor201601` VALUES ('17', '83046', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。');
INSERT INTO `tc_com_nor201601` VALUES ('18', '', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('18', '03154', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_nor201601` VALUES ('18', '04166', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_com_nor201601` VALUES ('18', '83046', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_nor201601` VALUES ('19', '', '2014', '计算机科学与技术', '15', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('20', '', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('20', '02124', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9', '王秀', '');
INSERT INTO `tc_com_nor201601` VALUES ('20', '04021', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '陈欢', '');
INSERT INTO `tc_com_nor201601` VALUES ('20', '15041', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_nor201601` VALUES ('20', '88005', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_nor201601` VALUES ('21', '', '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('21', '85118', '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。');
INSERT INTO `tc_com_nor201601` VALUES ('22', '', '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('22', '85118', '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11', '谢伙生', '');
INSERT INTO `tc_com_nor201601` VALUES ('23', '', '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('23', '11065', '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '1-8', '郑相涵', '');
INSERT INTO `tc_com_nor201601` VALUES ('24', '', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('24', '03058', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节');
INSERT INTO `tc_com_nor201601` VALUES ('24', '10011', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节');
INSERT INTO `tc_com_nor201601` VALUES ('25', '', '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('25', '02005', '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在11～18周的下午');
INSERT INTO `tc_com_nor201601` VALUES ('26', '', '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('26', '02125', '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '吴小竹', '');
INSERT INTO `tc_com_nor201601` VALUES ('27', '', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('27', '15041', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_nor201601` VALUES ('27', '85073', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '林世平', '');
INSERT INTO `tc_com_nor201601` VALUES ('27', '87007', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节');
INSERT INTO `tc_com_nor201601` VALUES ('28', '', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('28', '10044', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_nor201601` VALUES ('28', '11048', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_nor201601` VALUES ('28', '94176', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节');
INSERT INTO `tc_com_nor201601` VALUES ('29', '', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('29', '10044', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_nor201601` VALUES ('29', '11048', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_nor201601` VALUES ('29', '94176', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '3-18', '汪璟玢', '4节连上');
INSERT INTO `tc_com_nor201601` VALUES ('30', '', '2014', '计算机科学与技术', '15', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('31', '', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('31', '15041', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_nor201601` VALUES ('31', '88005', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_nor201601` VALUES ('32', '', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('32', '82058', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401');
INSERT INTO `tc_com_nor201601` VALUES ('32', '96031', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404');
INSERT INTO `tc_com_nor201601` VALUES ('33', '', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('33', '95015', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '第1-8周', '苏力', '周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节');
INSERT INTO `tc_com_nor201601` VALUES ('33', '98004', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', '');
INSERT INTO `tc_com_nor201601` VALUES ('34', '', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('34', '95015', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '低3-18周', '苏力', '实验课和理论课选相同老师，实验课尽量要选，否则可能影响理论课的学习和考试');
INSERT INTO `tc_com_nor201601` VALUES ('34', '98004', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周', '倪一涛', '请安排周末');
INSERT INTO `tc_com_nor201601` VALUES ('35', '', '2014', '计算机科学与技术', '15', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('36', '', '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('36', '06033', '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '张浩', '');
INSERT INTO `tc_com_nor201601` VALUES ('37', '', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('37', '03032', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-18', '孙岚', '请尽量不要排1、2节课');
INSERT INTO `tc_com_nor201601` VALUES ('37', '03171', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', '');
INSERT INTO `tc_com_nor201601` VALUES ('37', '08076', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', '');
INSERT INTO `tc_com_nor201601` VALUES ('38', '', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('38', '03009', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12', '董晨', '如果可以，请安排在周1的3、4节和周3的7、8节');
INSERT INTO `tc_com_nor201601` VALUES ('38', '88064', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节');
INSERT INTO `tc_com_nor201601` VALUES ('39', '', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('39', '03009', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室');
INSERT INTO `tc_com_nor201601` VALUES ('39', '88064', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8');
INSERT INTO `tc_com_nor201601` VALUES ('40', '', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('40', '03171', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '王一蕾', '');
INSERT INTO `tc_com_nor201601` VALUES ('40', '04059', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14', '余春艳', '');
INSERT INTO `tc_com_nor201601` VALUES ('40', '06018', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-13', '傅仰耿', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后');
INSERT INTO `tc_com_nor201601` VALUES ('41', '', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('41', '02124', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '1-16', '王秀', '');
INSERT INTO `tc_com_nor201601` VALUES ('41', '03161', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', '');
INSERT INTO `tc_com_nor201601` VALUES ('41', '15028', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', '');
INSERT INTO `tc_com_nor201601` VALUES ('42', '', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('42', '08076', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '陈勃', '');
INSERT INTO `tc_com_nor201601` VALUES ('42', '15041', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_nor201601` VALUES ('42', '85118', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。');
INSERT INTO `tc_com_nor201601` VALUES ('43', '', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_nor201601` VALUES ('43', '08076', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', '');
INSERT INTO `tc_com_nor201601` VALUES ('43', '85118', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', '');

-- ----------------------------
-- Table structure for tc_com_ope201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_com_ope201601`;
CREATE TABLE `tc_com_ope201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_com_ope201601
-- ----------------------------
INSERT INTO `tc_com_ope201601` VALUES ('1', '', '2016学年上学期计算机科学与技术（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_com_ope201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('4', '', '2013', '计算机科学与技术（实验班）', '60', ' GPU高性能计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('5', '', '2013', '计算机科学与技术（实验班）', '60', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('6', '', '2013', '计算机科学与技术（实验班）', '60', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('7', '', '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('7', '02005', '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在2～9周的下午');
INSERT INTO `tc_com_ope201601` VALUES ('8', '', '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('8', '95057', '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16', '丁善镜', '第5，6节');
INSERT INTO `tc_com_ope201601` VALUES ('9', '', '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('9', '03030', '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '蒋启强', '');
INSERT INTO `tc_com_ope201601` VALUES ('10', '', '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('10', '03161', '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', '');
INSERT INTO `tc_com_ope201601` VALUES ('11', '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('12', '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画课程设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('13', '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('14', '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机辅助设计', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('15', '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('16', '', '2013', '计算机科学与技术（实验班）', '60', ' 近世代数', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('17', '', '2013', '计算机科学与技术（实验班）', '60', ' 软件可靠性', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('18', '', '2013', '计算机科学与技术（实验班）', '60', ' 数学物理方程', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('19', '', '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('19', '06018', '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '1-8', '傅仰耿', '不安排周一和周五');
INSERT INTO `tc_com_ope201601` VALUES ('20', '', '2013', '计算机科学与技术（实验班）', '60', ' 移动编程实践', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('21', '', '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('21', '03161', '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '', '林秋月', '');
INSERT INTO `tc_com_ope201601` VALUES ('22', '', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('22', '03003', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_ope201601` VALUES ('22', '89085', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_com_ope201601` VALUES ('23', '', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('23', '03154', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。');
INSERT INTO `tc_com_ope201601` VALUES ('23', '04166', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_com_ope201601` VALUES ('23', '83046', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。');
INSERT INTO `tc_com_ope201601` VALUES ('24', '', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('24', '03154', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_ope201601` VALUES ('24', '04166', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_com_ope201601` VALUES ('24', '83046', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_com_ope201601` VALUES ('25', '', '2014', '计算机科学与技术（实验班）', '73', ' 复变函数', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('26', '', '2014', '计算机科学与技术（实验班）', '73', ' 概率论与数理统计', '  公共必修', '4', '64', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('27', '', '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('27', '95015', '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '第3-8周', '苏力', '周2，周4。麻烦和普通班班的《现代计算机接口技术》连排，最好3，4节连排5,6节，实验课连排4节');
INSERT INTO `tc_com_ope201601` VALUES ('28', '', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('28', '15041', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_ope201601` VALUES ('28', '88005', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_ope201601` VALUES ('29', '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('29', '85118', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。');
INSERT INTO `tc_com_ope201601` VALUES ('30', '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('30', '85118', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11', '谢伙生', '');
INSERT INTO `tc_com_ope201601` VALUES ('31', '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('31', '03058', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节');
INSERT INTO `tc_com_ope201601` VALUES ('31', '10011', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节');
INSERT INTO `tc_com_ope201601` VALUES ('32', '', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('32', '15041', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_ope201601` VALUES ('32', '85034', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第1周', '叶东毅', '请尽量安排在上午3-4节');
INSERT INTO `tc_com_ope201601` VALUES ('33', '', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('33', '10044', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_ope201601` VALUES ('33', '11048', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_ope201601` VALUES ('33', '94176', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节');
INSERT INTO `tc_com_ope201601` VALUES ('34', '', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('34', '10044', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '张栋', '');
INSERT INTO `tc_com_ope201601` VALUES ('34', '11048', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '柯逍', '');
INSERT INTO `tc_com_ope201601` VALUES ('34', '94176', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '3-18', '汪璟玢', '4节连上');
INSERT INTO `tc_com_ope201601` VALUES ('35', '', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('35', '15041', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_ope201601` VALUES ('35', '88005', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_com_ope201601` VALUES ('36', '', '2014', '计算机科学与技术（实验班）', '73', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('37', '', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('37', '82058', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401');
INSERT INTO `tc_com_ope201601` VALUES ('37', '96031', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404');
INSERT INTO `tc_com_ope201601` VALUES ('38', '', '2014', '计算机科学与技术（实验班）', '73', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('39', '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('39', '06033', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '第一周', '张浩', '1~6周，周四7~8节实验');
INSERT INTO `tc_com_ope201601` VALUES ('40', '', '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('40', '04021', '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '陈欢', '');
INSERT INTO `tc_com_ope201601` VALUES ('41', '', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('41', '03009', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12周', '董晨', '由于龙坤在国外，前几周董晨上，后几周郭龙坤上。请尽量安排在董晨普通班同一个时间段，如：同一个上午或下午，或3、4节和5、6节。非常感谢');
INSERT INTO `tc_com_ope201601` VALUES ('41', '11061', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '郭龙坤', '时间为周一与周三，与董辰合上，时间须错开。');
INSERT INTO `tc_com_ope201601` VALUES ('41', '88064', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节');
INSERT INTO `tc_com_ope201601` VALUES ('42', '', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('42', '11061', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-18', '郭龙坤', '');
INSERT INTO `tc_com_ope201601` VALUES ('42', '88064', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-17', '胡颖', '周六1-8');
INSERT INTO `tc_com_ope201601` VALUES ('43', '', '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('43', '04019', '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-15', '吴英杰', '独立开班，因有多个周末需带学生外出比赛，烦请尽量排在周二至周四，谢谢！');
INSERT INTO `tc_com_ope201601` VALUES ('44', '', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('44', '03032', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '孙岚', '');
INSERT INTO `tc_com_ope201601` VALUES ('44', '03161', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', '');
INSERT INTO `tc_com_ope201601` VALUES ('44', '15028', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', '');
INSERT INTO `tc_com_ope201601` VALUES ('45', '', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('45', '15041', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '苏雅茹', '');
INSERT INTO `tc_com_ope201601` VALUES ('45', '85073', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '林世平', '');
INSERT INTO `tc_com_ope201601` VALUES ('46', '', '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_com_ope201601` VALUES ('46', '85073', '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '林世平', '');

-- ----------------------------
-- Table structure for tc_inf_sec201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_inf_sec201601`;
CREATE TABLE `tc_inf_sec201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_inf_sec201601
-- ----------------------------
INSERT INTO `tc_inf_sec201601` VALUES ('1', '', '2016学年上学期信息安全专业开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_inf_sec201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('4', '', '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('4', '03030', '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '蒋启强', '(何萧玲、张浩合上)');
INSERT INTO `tc_inf_sec201601` VALUES ('5', '', '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('5', '02005', '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '孙及园', '');
INSERT INTO `tc_inf_sec201601` VALUES ('6', '', '2013', '信息安全', '37', ' 安全协议导论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('7', '', '2013', '信息安全', '37', ' 电子商务信息安全技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('8', '', '2013', '信息安全', '37', ' 可信系统与可信计算', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('9', '', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('9', '06033', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '第九周', '张浩', '每次四节课，张浩、李应、倪一涛、邹剑、何萧玲共同承担');
INSERT INTO `tc_inf_sec201601` VALUES ('9', '98004', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '', '倪一涛', '');
INSERT INTO `tc_inf_sec201601` VALUES ('10', '', '2014', '信息安全', '39', ' Java语言程序设计', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('11', '', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('11', '03003', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_inf_sec201601` VALUES ('11', '89085', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。');
INSERT INTO `tc_inf_sec201601` VALUES ('12', '', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('12', '03154', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。');
INSERT INTO `tc_inf_sec201601` VALUES ('12', '04166', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_inf_sec201601` VALUES ('12', '83046', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。');
INSERT INTO `tc_inf_sec201601` VALUES ('13', '', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('13', '03154', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_inf_sec201601` VALUES ('13', '04166', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '', '何振峰', '理论课与实践课选同一老师');
INSERT INTO `tc_inf_sec201601` VALUES ('13', '83046', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致');
INSERT INTO `tc_inf_sec201601` VALUES ('14', '', '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('14', '96070', '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '刘延华', '请不要安排在1-2节和7-8节，谢谢！');
INSERT INTO `tc_inf_sec201601` VALUES ('15', '', '2014', '信息安全', '39', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('16', '', '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('16', '98004', '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', '请安排在院实验室上课');
INSERT INTO `tc_inf_sec201601` VALUES ('17', '', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('17', '85073', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '', '林世平', '');
INSERT INTO `tc_inf_sec201601` VALUES ('17', '87007', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节');
INSERT INTO `tc_inf_sec201601` VALUES ('18', '', '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('18', '88005', '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_inf_sec201601` VALUES ('19', '', '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('19', '11037', '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '1-16周', '陈开志', '安排下午上课，5-8节之间都可以');
INSERT INTO `tc_inf_sec201601` VALUES ('20', '', '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('20', '06033', '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '第一周', '张浩', '和去年一样星期2,5:3-4节; 尽量安排在上午3、4节课');
INSERT INTO `tc_inf_sec201601` VALUES ('21', '', '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('21', '06033', '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '第四周', '张浩', '和去年一样星期2：5-8节');
INSERT INTO `tc_inf_sec201601` VALUES ('22', '', '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('22', '95098', '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '15-19周', '何萧玲', '请安排每周一次，每次8学时，请安排在周六，谢谢');
INSERT INTO `tc_inf_sec201601` VALUES ('23', '', '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('23', '95098', '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '12-19周', '何萧玲', '请12-17周每周2次课，每次3学时（可否安排在晚上？不行请安排下午，谢谢），第18周，每周两次，每次2学时，19周上机，每周两次，每次4学时。（钟尚平老师合班上课）');
INSERT INTO `tc_inf_sec201601` VALUES ('24', '', '2014', '信息安全', '39', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('25', '', '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('25', '02005', '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '', '孙及园', '请安排在1～18周的下午，每周2节课');
INSERT INTO `tc_inf_sec201601` VALUES ('26', '', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('26', '03171', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', '请尽量将我的课排在上午');
INSERT INTO `tc_inf_sec201601` VALUES ('26', '08076', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', '');
INSERT INTO `tc_inf_sec201601` VALUES ('27', '', '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('27', '12005', '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '1-16', '杨旸', '请排3-4节课，谢谢！');
INSERT INTO `tc_inf_sec201601` VALUES ('28', '', '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('28', '12005', '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '5-16', '杨旸', '4节连上！请排一个上午或一个下午');
INSERT INTO `tc_inf_sec201601` VALUES ('29', '', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('29', '03009', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12', '董晨', '如果可以，请安排在周1的3、4节和周3的7、8节');
INSERT INTO `tc_inf_sec201601` VALUES ('29', '88064', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节，周三7、8节');
INSERT INTO `tc_inf_sec201601` VALUES ('30', '', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('30', '03009', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室');
INSERT INTO `tc_inf_sec201601` VALUES ('30', '88064', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8节');
INSERT INTO `tc_inf_sec201601` VALUES ('31', '', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('31', '04059', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14', '余春艳', '');
INSERT INTO `tc_inf_sec201601` VALUES ('31', '06018', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-13', '傅仰耿', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后');
INSERT INTO `tc_inf_sec201601` VALUES ('32', '', '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('32', '03161', '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', '');
INSERT INTO `tc_inf_sec201601` VALUES ('33', '', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('33', '08076', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '陈勃', '');
INSERT INTO `tc_inf_sec201601` VALUES ('33', '85118', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。');
INSERT INTO `tc_inf_sec201601` VALUES ('34', '', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('34', '08076', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', '');
INSERT INTO `tc_inf_sec201601` VALUES ('34', '85118', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', '');
INSERT INTO `tc_inf_sec201601` VALUES ('35', '', '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '', '');
INSERT INTO `tc_inf_sec201601` VALUES ('35', '02112', '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '陈明志', '');

-- ----------------------------
-- Table structure for tc_infcom_ope201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_infcom_ope201601`;
CREATE TABLE `tc_infcom_ope201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_infcom_ope201601
-- ----------------------------
INSERT INTO `tc_infcom_ope201601` VALUES ('1', '', '2016学年上学期数学类（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_infcom_ope201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('4', '', '2013', '数学与应用数学（实验班）', '23', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('5', '', '2013', '数学与应用数学（实验班）', '23', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('6', '', '2013', '数学与应用数学（实验班）', '23', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('7', '', '2013', '数学与应用数学（实验班）', '23', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('8', '', '2013', '数学与应用数学（实验班）', '23', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('9', '', '2013', '数学与应用数学（实验班）', '23', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('10', '', '2013', '数学与应用数学（实验班）', '23', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('11', '', '2013', '数学与应用数学（实验班）', '23', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('12', '', '2013', '数学与应用数学（实验班）', '23', ' 随机分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('13', '', '2013', '数学与应用数学（实验班）', '23', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('14', '', '2013', '数学与应用数学（实验班）', '23', ' 专业实习', '  实践环节', '3', '', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('15', '', '2013', '数学与应用数学（实验班）', '23', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('16', '', '2013', '信息与计算科学（实验班）', '9', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('17', '', '2013', '信息与计算科学（实验班）', '9', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('18', '', '2013', '信息与计算科学（实验班）', '9', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('19', '', '2013', '信息与计算科学（实验班）', '9', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('20', '', '2013', '信息与计算科学（实验班）', '9', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('21', '', '2013', '信息与计算科学（实验班）', '9', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('22', '', '2013', '信息与计算科学（实验班）', '9', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('23', '', '2013', '信息与计算科学（实验班）', '9', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('24', '', '2013', '信息与计算科学（实验班）', '9', ' 随机分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('25', '', '2013', '信息与计算科学（实验班）', '9', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('26', '', '2013', '信息与计算科学（实验班）', '9', ' 专业实习', '  实践环节', '3', '', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('27', '', '2013', '信息与计算科学（实验班）', '9', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('28', '', '2014', '数学与应用数学（实验班）', '21', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('29', '', '2014', '数学与应用数学（实验班）', '21', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('30', '', '2014', '数学与应用数学（实验班）', '21', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('31', '', '2014', '数学与应用数学（实验班）', '21', ' 复变函数', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('32', '', '2014', '数学与应用数学（实验班）', '21', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('33', '', '2014', '数学与应用数学（实验班）', '21', ' 金融分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('34', '', '2014', '数学与应用数学（实验班）', '21', ' 近世代数', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('35', '', '2014', '数学与应用数学（实验班）', '21', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('36', '', '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('36', '88005', '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '白清源', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('37', '', '2014', '数学与应用数学（实验班）', '21', ' 数理统计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('38', '', '2014', '数学与应用数学（实验班）', '21', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('39', '', '2014', '数学与应用数学（实验班）', '21', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('40', '', '2014', '数学与应用数学（实验班）', '21', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('41', '', '2014', '数学与应用数学（实验班）', '21', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('42', '', '2014', '信息与计算科学（实验班）', '9', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('43', '', '2014', '信息与计算科学（实验班）', '9', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('44', '', '2014', '信息与计算科学（实验班）', '9', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('45', '', '2014', '信息与计算科学（实验班）', '9', ' 复变函数', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('46', '', '2014', '信息与计算科学（实验班）', '9', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('47', '', '2014', '信息与计算科学（实验班）', '9', ' 金融分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('48', '', '2014', '信息与计算科学（实验班）', '9', ' 近世代数', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('49', '', '2014', '信息与计算科学（实验班）', '9', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('50', '', '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('50', '88005', '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '白清源', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('51', '', '2014', '信息与计算科学（实验班）', '9', ' 数理统计', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('52', '', '2014', '信息与计算科学（实验班）', '9', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('53', '', '2014', '信息与计算科学（实验班）', '9', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('54', '', '2014', '信息与计算科学（实验班）', '9', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('55', '', '2014', '信息与计算科学（实验班）', '9', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('56', '', '2015', '数学类（实验班）', '29', ' Web设计软件应用实训', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('57', '', '2015', '数学类（实验班）', '29', ' 常微分方程', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('58', '', '2015', '数学类（实验班）', '29', ' 数据结构', '  学科必修', '3.5', '56', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('59', '', '2015', '数学类（实验班）', '29', ' 数据库原理及应用', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('60', '', '2015', '数学类（实验班）', '29', ' 数理逻辑', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('61', '', '2015', '数学类（实验班）', '29', ' 数学分析（下）', '  学科必修', '6', '96', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('62', '', '2016', '数学类（实验班）', '1', ' 高等代数（上）', '  学科必修', '3.5', '56', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('63', '', '2016', '数学类（实验班）', '1', ' 解析几何', '  学科必修', '2.5', '40', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('64', '', '2016', '数学类（实验班）', '1', ' 数学分析（上）', '  学科必修', '5', '80', '', '', '', '', '');
INSERT INTO `tc_infcom_ope201601` VALUES ('65', '', '2016', '数学类（实验班）', '1', ' 数学学科导论（数学史）', '  学科必修', '1', '16', '', '', '', '', '');

-- ----------------------------
-- Table structure for tc_issue
-- ----------------------------
DROP TABLE IF EXISTS `tc_issue`;
CREATE TABLE `tc_issue` (
  `pid` mediumint(8) NOT NULL AUTO_INCREMENT,
  `workNumber` varchar(10) NOT NULL COMMENT '导师工号',
  `title` varchar(30) NOT NULL COMMENT '课题标题',
  `content` mediumtext COMMENT '课题内容',
  `time` int(11) NOT NULL COMMENT '课题时间（时间戳）',
  `totalExper` int(11) NOT NULL COMMENT '导师所带实验班人数',
  `totalNatur` int(11) NOT NULL COMMENT '导师所带自然班人数',
  `nowExper` int(11) NOT NULL COMMENT '导师当前所带实验班人数',
  `nowNatur` int(11) NOT NULL COMMENT '导师当前所带自然班人数',
  `totalNow` int(11) NOT NULL DEFAULT '0' COMMENT '导师当前学生数',
  PRIMARY KEY (`pid`)
) ENGINE=MyISAM AUTO_INCREMENT=56 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tc_issue
-- ----------------------------

-- ----------------------------
-- Table structure for tc_math_nor201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_math_nor201601`;
CREATE TABLE `tc_math_nor201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of tc_math_nor201601
-- ----------------------------
INSERT INTO `tc_math_nor201601` VALUES ('1', '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_math_nor201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('4', '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('5', '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('6', '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('7', '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('8', '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('9', '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('10', '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('11', '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('12', '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('13', '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('14', '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('15', '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('16', '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('17', '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('18', '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('19', '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('20', '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('21', '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('22', '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('23', '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('24', '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('25', '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('26', '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('27', '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('28', '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('29', '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('30', '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('31', '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('32', '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('33', '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('34', '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('35', '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('36', '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('37', '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('38', '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('39', '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('40', '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('41', '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('42', '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('43', '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('44', '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('45', '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('46', '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('47', '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('48', '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('49', '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');
INSERT INTO `tc_math_nor201601` VALUES ('4', '00022', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '1-3周', '林锦', '不要晚上派克');
INSERT INTO `tc_math_nor201601` VALUES ('5', '00022', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '林锦', '');

-- ----------------------------
-- Table structure for tc_math_nor201602
-- ----------------------------
DROP TABLE IF EXISTS `tc_math_nor201602`;
CREATE TABLE `tc_math_nor201602` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of tc_math_nor201602
-- ----------------------------
INSERT INTO `tc_math_nor201602` VALUES ('1', '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_math_nor201602` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('4', '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('5', '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('6', '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('7', '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('8', '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('9', '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('10', '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('11', '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('12', '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('13', '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('14', '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('15', '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('16', '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('17', '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('18', '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('19', '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('20', '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('21', '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('22', '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('23', '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('24', '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('25', '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('26', '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('27', '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('28', '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('29', '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('30', '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('31', '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('32', '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('33', '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('34', '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('35', '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('36', '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('37', '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('38', '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('39', '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('40', '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('41', '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('42', '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('43', '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('44', '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('45', '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('46', '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('47', '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('48', '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('49', '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');
INSERT INTO `tc_math_nor201602` VALUES ('48', '00022', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '232323', '林锦', '123123123');
INSERT INTO `tc_math_nor201602` VALUES ('49', '00022', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '123123123', '林锦', '3443534534534');
INSERT INTO `tc_math_nor201602` VALUES ('48', '01004', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '问问', '蒋秀凤', '为');

-- ----------------------------
-- Table structure for tc_net_pro201602
-- ----------------------------
DROP TABLE IF EXISTS `tc_net_pro201602`;
CREATE TABLE `tc_net_pro201602` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of tc_net_pro201602
-- ----------------------------
INSERT INTO `tc_net_pro201602` VALUES ('1', '', '2016学年下学期网络工程专业 开课计划书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_net_pro201602` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('4', '', '2012', '网络工程', '32', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('5', '', '2012', '网络工程', '32', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('6', '', '2013', '网络工程', '28', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('7', '', '2013', '网络工程', '28', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('8', '', '2013', '网络工程', '28', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('9', '', '2013', '网络工程', '28', ' Web程序设计', '  专业必修（限选）', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('10', '', '2013', '网络工程', '28', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('11', '', '2013', '网络工程', '28', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('12', '', '2013', '网络工程', '28', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('13', '', '2013', '网络工程', '28', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('14', '', '2013', '网络工程', '28', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('15', '', '2013', '网络工程', '28', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('16', '', '2013', '网络工程', '28', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('17', '', '2013', '网络工程', '28', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('18', '', '2013', '网络工程', '28', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('19', '', '2013', '网络工程', '28', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('20', '', '2013', '网络工程', '28', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('21', '', '2013', '网络工程', '28', ' 计算机网络管理', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('22', '', '2013', '网络工程', '28', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('23', '', '2013', '网络工程', '28', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('24', '', '2013', '网络工程', '28', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('25', '', '2013', '网络工程', '28', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('26', '', '2013', '网络工程', '28', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('27', '', '2013', '网络工程', '28', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('28', '', '2013', '网络工程', '28', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('29', '', '2013', '网络工程', '28', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('30', '', '2013', '网络工程', '28', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('31', '', '2013', '网络工程', '28', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('32', '', '2013', '网络工程', '28', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('33', '', '2013', '网络工程', '28', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('34', '', '2013', '网络工程', '28', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('35', '', '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('36', '', '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('37', '', '2013', '网络工程', '28', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('38', '', '2013', '网络工程', '28', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('39', '', '2013', '网络工程', '28', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('40', '', '2013', '网络工程', '28', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('41', '', '2013', '网络工程', '28', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('42', '', '2013', '网络工程', '28', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', '');
INSERT INTO `tc_net_pro201602` VALUES ('35', '00022', '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '1-6周', '林锦', '不要晚上');
INSERT INTO `tc_net_pro201602` VALUES ('36', '00022', '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '2-8周', '林锦', '不要白天');

-- ----------------------------
-- Table structure for tc_net_pro201603
-- ----------------------------
DROP TABLE IF EXISTS `tc_net_pro201603`;
CREATE TABLE `tc_net_pro201603` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of tc_net_pro201603
-- ----------------------------

-- ----------------------------
-- Table structure for tc_result
-- ----------------------------
DROP TABLE IF EXISTS `tc_result`;
CREATE TABLE `tc_result` (
  `rid` mediumint(8) NOT NULL AUTO_INCREMENT,
  `sid` mediumint(8) NOT NULL COMMENT '学生编号',
  `workNumber` varchar(10) NOT NULL COMMENT '导师工号',
  PRIMARY KEY (`rid`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tc_result
-- ----------------------------

-- ----------------------------
-- Table structure for tc_soft_pro201601
-- ----------------------------
DROP TABLE IF EXISTS `tc_soft_pro201601`;
CREATE TABLE `tc_soft_pro201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of tc_soft_pro201601
-- ----------------------------
INSERT INTO `tc_soft_pro201601` VALUES ('1', '', '2016学年上学期软件学院开课通知书', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('2', '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注');
INSERT INTO `tc_soft_pro201601` VALUES ('3', '', '', '', '', '', '', '', '', '学时', '学时', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('4', '', '2013', '软件工程', '147', ' .NET Framework应用开发', '  专业选修', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('5', '', '2013', '软件工程', '147', ' Web应用软件工程', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('6', '', '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('6', '13046', '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '', '陈星', '已上过两学期');
INSERT INTO `tc_soft_pro201601` VALUES ('7', '', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('7', '08074', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课', '邓新国', '早晚送、接小孩，请不排12、78节');
INSERT INTO `tc_soft_pro201601` VALUES ('7', '88005', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '', '白清源', '');
INSERT INTO `tc_soft_pro201601` VALUES ('8', '', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('8', '06424', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '游天童', '8个学生');
INSERT INTO `tc_soft_pro201601` VALUES ('8', '08025', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '詹青青', '');
INSERT INTO `tc_soft_pro201601` VALUES ('8', '08074', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '邓新国', '《8人，11月份出国访问，是否可以带由系里决定');
INSERT INTO `tc_soft_pro201601` VALUES ('8', '08102', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '姚仰光', '');
INSERT INTO `tc_soft_pro201601` VALUES ('9', '', '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('9', '06420', '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '正常安排', '陈嘉', '上机课安排在理论课后，希望上机课4节连排');
INSERT INTO `tc_soft_pro201601` VALUES ('10', '', '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('10', '06404', '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '', '陈家瑞', '因接小孩，希望理论课不要排在78节');
INSERT INTO `tc_soft_pro201601` VALUES ('11', '', '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('11', '06421', '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '正常安排', '陈昱', '请尽量不安排上午12节');
INSERT INTO `tc_soft_pro201601` VALUES ('12', '', '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('12', '02125', '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '', '吴小竹', '');
INSERT INTO `tc_soft_pro201601` VALUES ('13', '', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('13', '06418', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '正常安排', '江兰帆', '一周4节，请不安排12节');
INSERT INTO `tc_soft_pro201601` VALUES ('13', '96070', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '', '刘延华', '请不要安排在1-2节和7-8节，谢谢！');
INSERT INTO `tc_soft_pro201601` VALUES ('14', '', '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('14', '82056', '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '1-8', '陈建华', '');
INSERT INTO `tc_soft_pro201601` VALUES ('15', '', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('15', '001333', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '2-12', '程红举', '分成两个班，和游天童老师合上，每周一个下午4节课');
INSERT INTO `tc_soft_pro201601` VALUES ('15', '06424', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '', '游天童', '分两班，每班一上午或一下午');
INSERT INTO `tc_soft_pro201601` VALUES ('16', '', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('16', '06424', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '游天童', '分两班，安排在同一上午或下午，不同时段。');
INSERT INTO `tc_soft_pro201601` VALUES ('16', '11013', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '於志勇', '(游天童，於志勇)');
INSERT INTO `tc_soft_pro201601` VALUES ('17', '', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('17', '06419', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '张舒', '实验课安排在课程最后，周五不排课');
INSERT INTO `tc_soft_pro201601` VALUES ('17', '13046', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '陈星', '已上过两学期');
INSERT INTO `tc_soft_pro201601` VALUES ('18', '', '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('18', '08074', '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课', '邓新国', '早晚送、接小孩，请不排12、78节');
INSERT INTO `tc_soft_pro201601` VALUES ('19', '', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('19', '07106', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '从第10周开始', '夏又生', '每周2次（每次2节）或每周1次（每次3节）');
INSERT INTO `tc_soft_pro201601` VALUES ('19', '13066', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '陈飞', '上课时间与夏又生老师一致');
INSERT INTO `tc_soft_pro201601` VALUES ('19', '88005', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '白清源', '');
INSERT INTO `tc_soft_pro201601` VALUES ('20', '', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('20', '08025', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '詹青青', '');
INSERT INTO `tc_soft_pro201601` VALUES ('20', '08102', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '姚仰光', '接送小孩不安排1，2节');
INSERT INTO `tc_soft_pro201601` VALUES ('21', '', '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('21', '12034', '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '1-16', '陈建利', '大班上课不分班，课程陈建利与朱文兴合上');
INSERT INTO `tc_soft_pro201601` VALUES ('22', '', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('22', '06424', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '游天童', '8个学生');
INSERT INTO `tc_soft_pro201601` VALUES ('22', '08025', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '詹青青', '');
INSERT INTO `tc_soft_pro201601` VALUES ('22', '08074', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '邓新国', '11月份出国访问，是否可以带由系里决定');
INSERT INTO `tc_soft_pro201601` VALUES ('22', '08102', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '姚仰光', '');
INSERT INTO `tc_soft_pro201601` VALUES ('23', '', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('23', '03171', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '', '王一蕾', '请尽量将我的课排在上午');
INSERT INTO `tc_soft_pro201601` VALUES ('23', '06018', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '1-16', '傅仰耿', '不排周一上下午及周五下午');
INSERT INTO `tc_soft_pro201601` VALUES ('24', '', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('24', '00022', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '2342423', '林锦', '234234234');
INSERT INTO `tc_soft_pro201601` VALUES ('24', '13066', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '', '陈飞', '上课时间与王灿辉老师一致');
INSERT INTO `tc_soft_pro201601` VALUES ('25', '', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '', '', '');
INSERT INTO `tc_soft_pro201601` VALUES ('25', '00022', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '234234234', '林锦', '2342354646545645');
INSERT INTO `tc_soft_pro201601` VALUES ('25', '001333', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '2-12', '程红举', '和陈昱分成两个班，每周3节');
INSERT INTO `tc_soft_pro201601` VALUES ('25', '06421', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '正常安排', '陈昱', '请尽量不安排上午12节');

-- ----------------------------
-- Table structure for tc_voluntary
-- ----------------------------
DROP TABLE IF EXISTS `tc_voluntary`;
CREATE TABLE `tc_voluntary` (
  `vid` mediumint(8) NOT NULL AUTO_INCREMENT,
  `sid` mediumint(8) NOT NULL COMMENT '学生编号',
  `wishFirst` varchar(10) DEFAULT NULL COMMENT '第一志愿',
  `wishSecond` varchar(10) DEFAULT NULL COMMENT '第二志愿',
  `wishThird` varchar(10) DEFAULT NULL COMMENT '第三志愿',
  `wishForth` varchar(10) DEFAULT NULL COMMENT '第四志愿',
  `wishFifth` varchar(10) DEFAULT NULL COMMENT '第五志愿',
  PRIMARY KEY (`vid`)
) ENGINE=MyISAM AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tc_voluntary
-- ----------------------------

-- ----------------------------
-- Table structure for tc_voluntaryinfosetting
-- ----------------------------
DROP TABLE IF EXISTS `tc_voluntaryinfosetting`;
CREATE TABLE `tc_voluntaryinfosetting` (
  `vsid` mediumint(8) NOT NULL AUTO_INCREMENT,
  `workNumber` varchar(10) NOT NULL COMMENT '系负责人工号',
  `voluntaryNum` int(11) NOT NULL COMMENT '志愿数',
  `issueStart` int(11) NOT NULL COMMENT '导师报选题起始时间（时间戳）',
  `issueEnd` int(11) NOT NULL COMMENT '导师报选题截止时间（时间戳）',
  `firstStart` int(11) NOT NULL COMMENT '学生第一轮填志愿起始时间（时间戳）',
  `firstEnd` int(11) NOT NULL COMMENT '学生第一轮填志愿截止时间（时间戳）',
  `secondStart` int(11) NOT NULL COMMENT '学生第二轮填志愿起始时间（时间戳）',
  `secondEnd` int(11) NOT NULL COMMENT '学生第二轮填志愿截止时间（时间戳）',
  `confirmFirstStart` int(11) NOT NULL COMMENT '第一轮导师选择起始时间（时间戳）',
  `confirmFirstEnd` int(11) NOT NULL COMMENT '第一轮导师选择截止时间（时间戳）',
  `confirmSecondStart` int(11) NOT NULL COMMENT '第二轮导师选择起始时间（时间戳）',
  `confirmSecondEnd` int(11) NOT NULL COMMENT '第二轮导师选择截止时间（时间戳）',
  `totalMax` int(11) NOT NULL DEFAULT '8' COMMENT '导师学生数总上限',
  `totalMin` int(11) NOT NULL DEFAULT '0' COMMENT '导师学生数总下限',
  `defaultNum` int(11) NOT NULL DEFAULT '8' COMMENT '导师默认所带学生数',
  `experialMax` int(11) NOT NULL DEFAULT '5' COMMENT '导师实验班学生数总上限',
  PRIMARY KEY (`vsid`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tc_voluntaryinfosetting
-- ----------------------------
INSERT INTO `tc_voluntaryinfosetting` VALUES ('4', '031402209', '5', '1479499260', '1479571200', '1479499500', '1479657600', '1480003200', '1480089600', '1479830400', '1479916800', '1480176000', '1480262400', '8', '0', '8', '5');

-- ----------------------------
-- Table structure for user_department_head
-- ----------------------------
DROP TABLE IF EXISTS `user_department_head`;
CREATE TABLE `user_department_head` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of user_department_head
-- ----------------------------
INSERT INTO `user_department_head` VALUES ('00001', '00001', '陈齐民', '男', '1996.01.10', '信息安全与网络工程系', '15659754690', '282129796@qq.com');
INSERT INTO `user_department_head` VALUES ('031402209', '031402209', '黄伟炜', '', '', '计算机系', '13905050606', '');
INSERT INTO `user_department_head` VALUES ('06099', '06099', '魏凤英', '', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('07106', '07106', '夏又生', '男', '195702', '', '', '');
INSERT INTO `user_department_head` VALUES ('09070', '09070', '侯建峰', '男', '19810110', '', '', '');
INSERT INTO `user_department_head` VALUES ('10044', '135093', '张栋', '男', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('11061', '11061', '郭龙坤', '', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('11065', '11065', '郑相涵', '', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('12095', '12095', '于元隆', '男', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('83040', '83040', '陈晓星', '女', '196312', '', '', '');
INSERT INTO `user_department_head` VALUES ('89036', '87840441', '朱玉灿', '男', '196304', '数学系', '13950490098', 'zhuyucan@fzu.edu.cn');
INSERT INTO `user_department_head` VALUES ('90010', '90010', ' 王灿辉', '', '', '', '', '');
INSERT INTO `user_department_head` VALUES ('92034', '92034', '陈晓云', '女', '197002', '信息与计算科学系', '', '');

-- ----------------------------
-- Table structure for user_student
-- ----------------------------
DROP TABLE IF EXISTS `user_student`;
CREATE TABLE `user_student` (
  `sid` mediumint(8) NOT NULL AUTO_INCREMENT,
  `serialNum` varchar(9) NOT NULL COMMENT '学号',
  `password` char(20) NOT NULL COMMENT '密码',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `gender` char(1) NOT NULL COMMENT '性别（女、男）',
  `gpa` double NOT NULL COMMENT '绩点',
  `college` varchar(30) NOT NULL DEFAULT '0' COMMENT '学院',
  `department` varchar(30) NOT NULL DEFAULT '0' COMMENT '系别',
  `field` varchar(30) NOT NULL DEFAULT '0' COMMENT '方向',
  `skill` mediumtext COMMENT '技能及经历',
  `avator` varchar(50) DEFAULT NULL COMMENT '头像url',
  `telephone` char(11) DEFAULT NULL COMMENT '电话',
  `email` varchar(30) DEFAULT NULL COMMENT '邮箱',
  `rank` varchar(10) NOT NULL COMMENT '排名',
  `chosen` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否中选（0、为中选 1、中选）',
  PRIMARY KEY (`sid`)
) ENGINE=MyISAM AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user_student
-- ----------------------------
INSERT INTO `user_student` VALUES ('1', '031402203', '031402203', '陈齐民', '男', '3.26', '数学与计算机科学学院', '计算机系', '系统结构', '熟悉PHP开发，喜欢大数据挖掘方面的研究，热爱体育运动', null, '15659754690', '282129796@qq.com', '8/32', '0');
INSERT INTO `user_student` VALUES ('2', '031402304', '031402304', '陈燊', '男', '3.47', '数学与计算机科学学院', '计算机系', '计算机科学与技术', null, null, null, null, '1/72', '0');
INSERT INTO `user_student` VALUES ('3', '031402209', '031402209', '黄伟炜', '男', '4.5', '数学与计算机科学学院', '计算机系', '计算机应用', null, null, null, null, '1/186', '0');
INSERT INTO `user_student` VALUES ('5', '031402201', '031402201', '李旭升', '男', '3.56', '数学与计算机科学学院', '计算机系', '计算机实验班', null, null, null, null, '2/72', '0');
INSERT INTO `user_student` VALUES ('7', '031402337', '031402337', '胡心颖', '女', '3.88', '数学与计算机科学学院', '计算机系', '0', null, null, null, null, '3/75', '0');
INSERT INTO `user_student` VALUES ('9', '031402233', '031402233', '郑扬涛', '男', '5', '数学与计算机科学学院', '计算机系', '0', null, null, null, null, '1/22', '0');
INSERT INTO `user_student` VALUES ('10', '031402341', '031402341', '王婷婷', '女', '2.22', '数学与计算机科学学院', '计算机系', '0', null, null, null, null, '4/55', '0');
INSERT INTO `user_student` VALUES ('11', '031402301', '031402301', '曾志通', '男', '4', '数学与计算机科学学院', '计算机系', '0', null, null, null, null, '2/74', '0');
INSERT INTO `user_student` VALUES ('17', '031402342', '031402342', '许玲玲', '女', '4.17', '数学与计算机科学学院', '计算机系', '0', null, null, null, null, '29/77', '0');

-- ----------------------------
-- Table structure for user_teacher
-- ----------------------------
DROP TABLE IF EXISTS `user_teacher`;
CREATE TABLE `user_teacher` (
  `workNumber` varchar(10) NOT NULL,
  `password` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `sex` varchar(5) NOT NULL,
  `birthday` varchar(10) NOT NULL,
  `department` varchar(20) NOT NULL,
  `telephone` varchar(11) NOT NULL,
  `email` varchar(30) NOT NULL,
  `isExperial` tinyint(1) NOT NULL DEFAULT '0' COMMENT '导师是否实验班导师（0、不是 1、是）',
  `description` mediumtext COMMENT '个人简介',
  `avator` varchar(50) DEFAULT NULL COMMENT '头像url',
  `title` varchar(20) DEFAULT NULL COMMENT '职称',
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user_teacher
-- ----------------------------
INSERT INTO `user_teacher` VALUES ('031402304', '031402304', '陈燊老师', '男', '1996.01.18', '计算机系', '15606911909', '6751216632@qq.com', '0', '我是个老师！', null, '讲师');
INSERT INTO `user_teacher` VALUES ('031402341', '031402341', '王老师', '女', '1996.01.10', '计算机系', '15659754690', '282129796@qq.com', '0', '我是个老师！', null, '博士');
INSERT INTO `user_teacher` VALUES ('031402342', '031402342', '许老师', '女', '1996.01.18', '计算机系', '15606911909', '553133880@qq.com', '1', '我是个老师！', null, '教授');

-- ----------------------------
-- Table structure for user_teaching_office
-- ----------------------------
DROP TABLE IF EXISTS `user_teaching_office`;
CREATE TABLE `user_teaching_office` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of user_teaching_office
-- ----------------------------
INSERT INTO `user_teaching_office` VALUES ('90002', '90002', '王美清', '', '');
INSERT INTO `user_teaching_office` VALUES ('sj073', 'sj073', '张晴', '', '');
INSERT INTO `user_teaching_office` VALUES ('031402337', '031402337', '胡老师', '15659754690', '282129796@qq.com');
INSERT INTO `user_teaching_office` VALUES ('031402304', '031402304', '陈负责', '15659754690', '282129796@qq.com');
SET FOREIGN_KEY_CHECKS=1;
