-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2016-12-09 05:51:12
-- 服务器版本： 5.7.14
-- PHP Version: 5.6.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `teacher_class_system`
--

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_exc201601`
--

CREATE TABLE `cb_tc_com_exc201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_exc201601`
--

INSERT INTO `cb_tc_com_exc201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期计算机科学与技术（卓越班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '计算机科学与技术（卓越班）', '96', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', '企业开课，理论20学时，上机20学时 '),
(5, '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '；', '张浩；', '；'),
(6, '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '；', '赵彦敏；', '；'),
(7, '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；'),
(8, '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '；1-12；1--12；', '何振峰；刘秉瀚；陈晖；', '理论与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）刘秉瀚、陈晖合作上1个班，希望安排在下午的5，6节。；'),
(9, '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；'),
(10, '2014', '计算机科学与技术（卓越班）', '125', ' 概率论与数理统计', '  学科必修', '3', '48', '', '', '', '', ''),
(11, '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9；；；', '王秀；白清源；陈欢；', '；；；'),
(12, '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；'),
(13, '2014', '计算机科学与技术（卓越班）', '125', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '郑相涵；', ''),
(14, '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；'),
(15, '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在11～18周的下午；'),
(16, '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '；', '吴小竹；', '；'),
(17, '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '；', '於志勇；', '；'),
(18, '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周；；；', '陈昭炯；林世平；', '不排在上午1-2节；；；'),
(19, '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；'),
(20, '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；'),
(21, '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '1-16；', '丁善镜；', '第3，4节；'),
(22, '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；'),
(23, '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；'),
(24, '2014', '计算机科学与技术（卓越班）', '125', ' 网络和系统性能评估', '  学科专业选修', '2', '32', '', '', '', '', ''),
(25, '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周；第1周--8周；', '倪一涛；苏力；', '；周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节；'),
(26, '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周；第3-18周；', '倪一涛；苏力；', '请安排周末；1.请同学选课和理论课老师相同。2.尽量选实验，否则理论课学习会受影响；'),
(27, '2014', '计算机科学与技术（卓越班）', '125', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '；', '张浩；', '；'),
(29, '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；', '陈勃；王一蕾；', '；；'),
(30, '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1-12；1~12周；', '胡颖；董晨；', '周一3、4节周三7、8节；如果可以，请排在周1的3、4节和周3的7，8节；'),
(31, '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；第6周开始~期末；', '胡颖；董晨；', '周六1-8节；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；'),
(32, '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '；1-14；', '王一蕾；余春艳；', '；；'),
(33, '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；1-16；；', '孙岚；王秀；林秋月；', '；；；'),
(34, '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10；3-10；；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；；'),
(35, '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_nor201601`
--

CREATE TABLE `cb_tc_com_nor201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_nor201601`
--

INSERT INTO `cb_tc_com_nor201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期计算机开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '计算机科学与技术', '62', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '张浩、蔣启强、何萧玲', ''),
(5, '2013', '计算机科学与技术', '62', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', ''),
(6, '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在2～9周的下午；'),
(7, '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16；', '丁善镜；', '第5，6节；'),
(8, '2013', '计算机科学与技术', '62', ' 分布式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '；'),
(10, '2013', '计算机科学与技术', '62', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', '理论20学时，上机20学时'),
(11, '2013', '计算机科学与技术', '62', ' 软件可靠性与可信软件', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术', '62', ' 虚拟现实', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术', '62', ' 云计算', '  专业选修', '2', '32', '', '', '', '', ''),
(14, '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '；', '赵彦敏；', '；'),
(15, '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '1-16；', '陈嘉；', '因课时较多，希望能一周少安排一些课，多安排几周；'),
(16, '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；'),
(17, '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1--12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；'),
(18, '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；'),
(19, '2014', '计算机科学与技术', '15', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', ''),
(20, '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9；；；；', '王秀；陈欢；白清源；', '；；；；'),
(21, '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；'),
(22, '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11；', '谢伙生；', '；'),
(23, '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '1-8；', '郑相涵；', '；'),
(24, '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；'),
(25, '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在11～18周的下午；'),
(26, '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '；', '吴小竹；', '；'),
(27, '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周；；；', '陈昭炯；林世平；', '不排在上午1-2节；；；'),
(28, '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；'),
(29, '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；'),
(30, '2014', '计算机科学与技术', '15', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '丁善镜；', ''),
(31, '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；'),
(32, '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；'),
(33, '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周；第1-8周；', '倪一涛；苏力；', '；周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节；'),
(34, '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周；低3-18周；', '倪一涛；苏力；', '请安排周末；实验课和理论课选相同老师，实验课尽量要选，否则可能影响理论课的学习和考试；'),
(35, '2014', '计算机科学与技术', '15', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '；', '张浩；', '01-06周 星期4:9-10节 理论课 01-07周 星期4:7-8节 实验课；'),
(37, '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；1-18；', '陈勃；王一蕾；孙岚；', '；；请尽量不要排1、2节课；'),
(38, '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1~12；', '胡颖；董晨；', '周一3、4节周三7、8节；如果可以，请安排在周1的3、4节和周3的7、8节；'),
(39, '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；6~期末；', '胡颖；董晨；', '周六1-8；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；'),
(40, '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '；1-13；1-14；', '傅仰耿；余春艳；', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后；；'),
(41, '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；1-16；；', '孙岚；王秀；林秋月；', '；；；'),
(42, '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10；3-10；；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；；'),
(43, '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_ope201601`
--

CREATE TABLE `cb_tc_com_ope201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_ope201601`
--

INSERT INTO `cb_tc_com_ope201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期计算机科学与技术（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '计算机科学与技术（实验班）', '60', ' GPU高性能计算', '  专业选修', '2', '32', '', '', '', '', ''),
(5, '2013', '计算机科学与技术（实验班）', '60', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', ' 张浩; 蔣启强;何萧玲', '合班上'),
(6, '2013', '计算机科学与技术（实验班）', '60', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', ''),
(7, '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '；', '孙及园；', '请安排在2～9周的下午；'),
(8, '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16；', '丁善镜；', '第5，6节；'),
(9, '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '；'),
(10, '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '；', '林秋月；', '企业开课；'),
(11, '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '60', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '60', ' 计算机辅助设计', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '60', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '60', ' 近世代数', '  专业选修', '3', '48', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '60', ' 软件可靠性', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '60', ' 数学物理方程', '  专业选修', '3', '48', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '1-8；', '傅仰耿；', '不安排周一和周五；'),
(20, '2013', '计算机科学与技术（实验班）', '60', ' 移动编程实践', '  实践选修', '1', '24', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '；', '林秋月；', '；'),
(22, '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；'),
(23, '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1-12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；'),
(24, '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；'),
(25, '2014', '计算机科学与技术（实验班）', '73', ' 复变函数', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2014', '计算机科学与技术（实验班）', '73', ' 概率论与数理统计', '  公共必修', '4', '64', '', '', '', '', ''),
(27, '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '第3-8周；', '苏力；', '周2，周4。麻烦和普通班班的《现代计算机接口技术》连排，最好3，4节连排5,6节，实验课连排4节；'),
(28, '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '；；', '白清源；', '；；'),
(29, '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '1-8；', '谢伙生；', '与计算机导论课排在同一个上午，教室同一间。；'),
(30, '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11；', '谢伙生；', '；'),
(31, '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18；', '林嘉雯；尚艳艳；', '尽可能安排在上午3、4节或者下午1、2节；课程不安排在12节；'),
(32, '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第1周；；', '叶东毅；', '请尽量安排在上午3-4节；单独开班'),
(33, '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '；1-18；；', '张栋；汪璟玢；柯逍；', '；不要安排7,8节；；'),
(34, '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '；3-18；；', '张栋；汪璟玢；柯逍；', '；4节连上；；'),
(35, '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '；；', '白清源；苏雅茹；', '；；'),
(36, '2014', '计算机科学与技术（实验班）', '73', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节；5-7周星期日1-8节；', '郭洪；林常俊；', '网络实验室401；网络实验室404；'),
(38, '2014', '计算机科学与技术（实验班）', '73', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(39, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '第一周；', '张浩；', '01-06周 星期4:9-10节 理论课 |||   01-07周 星期4:7-8节 实验课'),
(40, '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '；', '陈欢；', '单独开班'),
(41, '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1-12；1~12周；', '胡颖；郭龙坤；董晨；', '周一3、4节周三7、8节；时间为周一与周三，与董辰合上，时间须错开。；由于龙坤在国外，前几周董晨上，后几周郭龙坤上。请尽量安排在董晨普通班同一个时间段，如：同一个上午或下午，或3、4节和5、6节。非常感谢；'),
(42, '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-17；6-18；', '胡颖；郭龙坤；', '周六1-8；；'),
(43, '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-15；', '吴英杰；', '独立开班，因有多个周末需带学生外出比赛，烦请尽量排在周二至周四，谢谢！；'),
(44, '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；；；', '刘文犀；', '单独开班'),
(45, '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '；；', '林世平；', '单独开班'),
(46, '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '；', '林世平；', '单独开班'),
(47, '2016', '计算机科学与技术(实验班)', '70', '学术英语表达', '选修', '2', '32', '', '', '第7星期开始', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_infcom_ope201601`
--

CREATE TABLE `cb_tc_infcom_ope201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_infcom_ope201601`
--

INSERT INTO `cb_tc_infcom_ope201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期数学类（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '数学与应用数学（实验班）', '23', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '按时打算', '黄建军', ''),
(5, '2013', '数学与应用数学（实验班）', '23', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '蒋秀凤', ''),
(6, '2013', '数学与应用数学（实验班）', '23', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '叶丛峰', ''),
(7, '2013', '数学与应用数学（实验班）', '23', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '林华', ''),
(8, '2013', '数学与应用数学（实验班）', '23', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学（实验班）', '23', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '张华娣', ''),
(10, '2013', '数学与应用数学（实验班）', '23', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '曾有栋', ''),
(11, '2013', '数学与应用数学（实验班）', '23', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学（实验班）', '23', ' 随机分析', '  专业选修', '3', '48', '', '', '', '张文钊', '普通班、实验班合上'),
(13, '2013', '数学与应用数学（实验班）', '23', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学（实验班）', '23', ' 专业实习', '  实践环节', '3', '', '', '', '', '林华', ''),
(15, '2013', '数学与应用数学（实验班）', '23', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '侯建锋', ''),
(16, '2013', '信息与计算科学（实验班）', '9', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '黄建军', ''),
(17, '2013', '信息与计算科学（实验班）', '9', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '蒋秀凤', ''),
(18, '2013', '信息与计算科学（实验班）', '9', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '叶丛峰', ''),
(19, '2013', '信息与计算科学（实验班）', '9', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '林华', ''),
(20, '2013', '信息与计算科学（实验班）', '9', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', ''),
(21, '2013', '信息与计算科学（实验班）', '9', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '张华娣', ''),
(22, '2013', '信息与计算科学（实验班）', '9', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '曾有栋', ''),
(23, '2013', '信息与计算科学（实验班）', '9', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(24, '2013', '信息与计算科学（实验班）', '9', ' 随机分析', '  专业选修', '3', '48', '', '', '', '张文钊', '普通班、实验班合上'),
(25, '2013', '信息与计算科学（实验班）', '9', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学（实验班）', '9', ' 专业实习', '  实践环节', '3', '', '', '', '', '林华', ''),
(27, '2013', '信息与计算科学（实验班）', '9', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '侯建锋', ''),
(28, '2014', '数学与应用数学（实验班）', '21', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '何建农', ''),
(29, '2014', '数学与应用数学（实验班）', '21', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '林丽琼', '独立开班'),
(30, '2014', '数学与应用数学（实验班）', '21', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '蒋秀凤', ''),
(31, '2014', '数学与应用数学（实验班）', '21', ' 复变函数', '  学科必修', '3', '48', '', '', '', '舒志彪', ''),
(32, '2014', '数学与应用数学（实验班）', '21', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '单红', ''),
(33, '2014', '数学与应用数学（实验班）', '21', ' 金融分析', '  专业选修', '3', '48', '', '', '', '王晶海', '普通班、实验班合上'),
(34, '2014', '数学与应用数学（实验班）', '21', ' 近世代数', '  学科必修', '3', '48', '', '', '', '刘月', '普通班、实验班合上'),
(35, '2014', '数学与应用数学（实验班）', '21', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '黄建军', ''),
(36, '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '；', '林锦', '；'),
(37, '2014', '数学与应用数学（实验班）', '21', ' 数理统计', '  学科必修', '3', '48', '', '', '', '梁飞豹', ''),
(38, '2014', '数学与应用数学（实验班）', '21', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '江飞', ''),
(39, '2014', '数学与应用数学（实验班）', '21', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2014', '数学与应用数学（实验班）', '21', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '江辉有', ''),
(41, '2014', '数学与应用数学（实验班）', '21', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(42, '2014', '信息与计算科学（实验班）', '9', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '何建农', ''),
(43, '2014', '信息与计算科学（实验班）', '9', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '林丽琼', '独立开班'),
(44, '2014', '信息与计算科学（实验班）', '9', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '蒋秀凤', ''),
(45, '2014', '信息与计算科学（实验班）', '9', ' 复变函数', '  学科必修', '3', '48', '', '', '', '舒志彪', ''),
(46, '2014', '信息与计算科学（实验班）', '9', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '单红', ''),
(47, '2014', '信息与计算科学（实验班）', '9', ' 金融分析', '  专业选修', '3', '48', '', '', '', '王晶海', '普通班、实验班合上'),
(48, '2014', '信息与计算科学（实验班）', '9', ' 近世代数', '  学科必修', '3', '48', '', '', '', '刘月', '普通班、实验班合上'),
(49, '2014', '信息与计算科学（实验班）', '9', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '黄建军', ''),
(50, '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '；', '林锦', '；'),
(51, '2014', '信息与计算科学（实验班）', '9', ' 数理统计', '  学科必修', '3', '48', '', '', '', '梁飞豹', ''),
(52, '2014', '信息与计算科学（实验班）', '9', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '江飞', ''),
(53, '2014', '信息与计算科学（实验班）', '9', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(54, '2014', '信息与计算科学（实验班）', '9', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '江辉有', ''),
(55, '2014', '信息与计算科学（实验班）', '9', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(56, '2015', '数学类（实验班）', '29', ' Web设计软件应用实训', '  实践环节', '2', '48', '', '', '', '李剑敏', ''),
(57, '2015', '数学类（实验班）', '29', ' 常微分方程', '  学科必修', '3', '48', '', '', '', '张惠英', ''),
(58, '2015', '数学类（实验班）', '29', ' 数据结构', '  学科必修', '3.5', '56', '', '16', '', '陈晓云', ''),
(59, '2015', '数学类（实验班）', '29', ' 数据库原理及应用', '  专业选修', '3', '48', '', '16', '', '史正平', '理论与上机都排在周一'),
(60, '2015', '数学类（实验班）', '29', ' 数理逻辑', '  学科必修', '2', '32', '', '', '', '赖降周', '10月份开始上课'),
(61, '2015', '数学类（实验班）', '29', ' 数学分析（下）', '  学科必修', '6', '96', '', '', '', '陈晓星', ''),
(62, '2016', '数学类（实验班）', '1', ' 高等代数（上）', '  学科必修', '3.5', '56', '', '', '', '常安', ''),
(63, '2016', '数学类（实验班）', '1', ' 解析几何', '  学科必修', '2.5', '40', '', '', '', '谭宜家', '普通班、实验班合上'),
(64, '2016', '数学类（实验班）', '1', ' 数学分析（上）', '  学科必修', '5', '80', '', '', '', '沈明', ''),
(65, '2016', '数学类（实验班）', '1', ' 数学学科导论（数学史）', '  学科必修', '1', '16', '', '', '', '谭宜家', '每周2节'),
(66, '2016', '数学类(实验班)', '29', '学术英语表达', '选修', '2', '32', '', '', '第7星期开始', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_inf_sec201601`
--

CREATE TABLE `cb_tc_inf_sec201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_inf_sec201601`
--

INSERT INTO `cb_tc_inf_sec201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期信息安全专业开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '；', '蒋启强；', '(何萧玲、张浩合上)；'),
(5, '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '；', '孙及园；', '；'),
(6, '2013', '信息安全', '37', ' 安全协议导论', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '2013', '信息安全', '37', ' 电子商务信息安全技术', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '2013', '信息安全', '37', ' 可信系统与可信计算', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '第九周；；', '张浩；倪一涛；', '每次四节课，张浩、李应、倪一涛、邹剑、何萧玲共同承担；；'),
(10, '2014', '信息安全', '39', ' Java语言程序设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '；；', '程烨；郭红；', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。；'),
(12, '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '；1-12；1-12；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。；（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。；'),
(13, '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '；4-12；第4周开始；', '何振峰；刘秉瀚；陈晖；', '理论课与实践课选同一老师；分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致；'),
(14, '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '刘延华；', '请不要安排在1-2节和7-8节，谢谢！；'),
(15, '2014', '信息安全', '39', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', ''),
(16, '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '1至8周；', '倪一涛；', '请安排在院实验室上课；'),
(17, '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '第一周；；', '陈昭炯；林世平；', '不排在上午1-2节；；'),
(18, '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '；', '白清源；', '；'),
(19, '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '1-16周；', '陈开志；', '安排下午上课，5-8节之间都可以；'),
(20, '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '第一周；', '张浩；', '和去年一样星期2,5:3-4节; 尽量安排在上午3、4节课；'),
(21, '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '第四周；', '张浩；', '和去年一样星期2：5-8节；'),
(22, '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '15-19周；', '何萧玲；', '请安排每周一次，每次8学时，请安排在周六，谢谢；'),
(23, '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '12-19周；', '何萧玲；', '请12-17周每周2次课，每次3学时（可否安排在晚上？不行请安排下午，谢谢），第18周，每周两次，每次2学时，19周上机，每周两次，每次4学时。（钟尚平老师合班上课）；'),
(24, '2014', '信息安全', '39', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '；', '孙及园；', '请安排在1～18周的下午，每周2节课；'),
(26, '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16；；', '陈勃；王一蕾；', '；请尽量将我的课排在上午；'),
(27, '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '1-16；', '杨旸；', '请排3-4节课，谢谢！；'),
(28, '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '5-16；', '杨旸；', '4节连上！请排一个上午或一个下午；'),
(29, '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12；1~12；', '胡颖；董晨；', '周一3、4节，周三7、8节；如果可以，请安排在周1的3、4节和周3的7、8节；'),
(30, '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17；6~期末；', '胡颖；董晨；', '周六1-8节；董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室；'),
(31, '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14；1-13；', '余春艳；傅仰耿；', '；（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后；'),
(32, '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '；', '林秋月；', '；'),
(33, '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10；3-10；', '陈勃；谢伙生；', '；与计算机图形学课排在同一个上午，教室同一间。；'),
(34, '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15；11-16；', '陈勃；谢伙生；', '；；'),
(35, '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '陈明志；', '；');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201601`
--

CREATE TABLE `cb_tc_math_nor201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201601`
--

INSERT INTO `cb_tc_math_nor201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '；1-3周', '；林锦', '；不要晚上派克'),
(5, '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '；', '；林锦', '；'),
(6, '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201602`
--

CREATE TABLE `cb_tc_math_nor201602` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201602`
--

INSERT INTO `cb_tc_math_nor201602` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '；232323；问问', '；林锦；蒋秀凤', '；123123123；为'),
(49, '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '；123123123', '；林锦', '；3443534534534');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_net_pro201602`
--

CREATE TABLE `cb_tc_net_pro201602` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `cb_tc_net_pro201602`
--

INSERT INTO `cb_tc_net_pro201602` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年下学期网络工程专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '网络工程', '32', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '1；', '', ''),
(5, '2012', '网络工程', '32', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '网络工程', '28', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '2013', '网络工程', '28', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(8, '2013', '网络工程', '28', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '2013', '网络工程', '28', ' Web程序设计', '  专业必修（限选）', '2', '32', '', '8', '', '', ''),
(10, '2013', '网络工程', '28', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '网络工程', '28', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '网络工程', '28', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '网络工程', '28', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '2013', '网络工程', '28', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '网络工程', '28', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '网络工程', '28', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(17, '2013', '网络工程', '28', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '网络工程', '28', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(19, '2013', '网络工程', '28', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '网络工程', '28', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '网络工程', '28', ' 计算机网络管理', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(22, '2013', '网络工程', '28', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '网络工程', '28', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(24, '2013', '网络工程', '28', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '网络工程', '28', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '网络工程', '28', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '网络工程', '28', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '网络工程', '28', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '网络工程', '28', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '网络工程', '28', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '网络工程', '28', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '2013', '网络工程', '28', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '网络工程', '28', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2013', '网络工程', '28', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '；1-6周；2-9周', '；林锦；张小东', '；不要晚上；不要白天'),
(36, '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '；2-8周', '；林锦', '；不要白天'),
(37, '2013', '网络工程', '28', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '网络工程', '28', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(39, '2013', '网络工程', '28', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2013', '网络工程', '28', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(41, '2013', '网络工程', '28', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '2013', '网络工程', '28', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_soft_pro201601`
--

CREATE TABLE `cb_tc_soft_pro201601` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_soft_pro201601`
--

INSERT INTO `cb_tc_soft_pro201601` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2016学年上学期软件学院开课通知书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2013', '软件工程', '147', ' .NET Framework应用开发', '  专业选修', '2', '32', '', '8', '', '不开课', ''),
(5, '2013', '软件工程', '147', ' Web应用软件工程', '  专业选修', '2', '32', '', '', '', '不开课', ''),
(6, '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '；', '陈星；', '已上过两学期；'),
(7, '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课；；', '邓新国；', '早晚送、接小孩，请不排12、78节；；'),
(8, '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '；；；；', '统一安排(王灿辉)', '《8人，11月份出国访问，是否可以带由系里决定；8个学生；；；'),
(9, '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '正常安排；', '陈嘉；', '上机课安排在理论课后，希望上机课4节连排；'),
(10, '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '；', '陈家瑞；', '因接小孩，希望理论课不要排在78节；'),
(11, '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '正常安排；', '陈昱；', '请尽量不安排上午12节；'),
(12, '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '；', '吴小竹；', '；'),
(13, '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '正常安排；', '刘延华；江兰帆；', '请不要安排在1-2节和7-8节，谢谢！；一周4节，请不安排12节；'),
(14, '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '1-8；', '陈建华；', '；'),
(15, '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '2-12；；', '程红举；游天童；', '分成两个班，和游天童老师合上，每周一个下午4节课；分两班，每班一上午或一下午；'),
(16, '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '；；', '於志勇；游天童；', '(游天童，於志勇)；分两班，安排在同一上午或下午，不同时段。；'),
(17, '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '；；', '陈星；张舒；', '已上过两学期；实验课安排在课程最后，周五不排课；'),
(18, '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课；', '邓新国；', '早晚送、接小孩，请不排12、78节；'),
(19, '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '从第10周开始；；；', '夏又生；陈飞；', '每周2次（每次2节）或每周1次（每次3节）；上课时间与夏又生老师一致；；'),
(20, '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '；；', '詹青青；姚仰光；', '；接送小孩不安排1，2节；'),
(21, '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '1-16；', '陈建利；', '大班上课不分班，课程陈建利与朱文兴合上；'),
(22, '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '；；；；', '统一安排(王灿辉)', '11月份出国访问，是否可以带由系里决定；8个学生；；；'),
(23, '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '；1-16；', '王一蕾；傅仰耿；', '请尽量将我的课排在上午；不排周一上下午及周五下午；'),
(24, '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '；；2342423', '王灿辉；陈飞；；林锦', '分2个班，上课时间与王灿辉老师一致；；234234234'),
(25, '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '2-12；正常安排；；234234234', '程红举；陈昱；；林锦', '和陈昱分成两个班，每周3节；请尽量不安排上午12节；；2342354646545645');

-- --------------------------------------------------------

--
-- 表的结构 `department_head_majors`
--

CREATE TABLE `department_head_majors` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `major` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `privilege` int(1) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `department_head_majors`
--

INSERT INTO `department_head_majors` (`workNumber`, `major`, `privilege`) VALUES
('06033', 'tc_com_exc', 0),
('06033', 'tc_com_nor', 0),
('06033', 'tc_com_ope', 0),
('06033', 'tc_inf_sec', 0),
('06033', 'tc_infcom_ope', 0),
('06033', 'tc_math_nor', 0),
('06033', 'tc_math_ope', 0),
('06033', 'tc_mathsub_ope', 0),
('06033', 'tc_net_pro', 0),
('06033', 'tc_soft_pro', 0),
('06099', 'tc_infcom_ope', 1),
('06099', 'tc_math_nor', 1),
('07106', 'tc_com_exc', 0),
('07106', 'tc_com_nor', 0),
('07106', 'tc_com_ope', 0),
('07106', 'tc_inf_sec', 0),
('07106', 'tc_net_pro', 0),
('07106', 'tc_soft_pro', 1),
('09070', 'tc_infcom_ope', 1),
('09070', 'tc_math_nor', 0),
('10044', 'tc_com_exc', 1),
('10044', 'tc_com_nor', 1),
('10044', 'tc_com_ope', 1),
('10044', 'tc_inf_sec', 0),
('10044', 'tc_net_pro', 0),
('10044', 'tc_soft_pro', 0),
('11061', 'tc_com_exc', 1),
('11061', 'tc_com_nor', 1),
('11061', 'tc_com_ope', 1),
('11061', 'tc_inf_sec', 0),
('11061', 'tc_net_pro', 0),
('11061', 'tc_soft_pro', 0),
('11065', 'tc_com_exc', 0),
('11065', 'tc_com_nor', 0),
('11065', 'tc_com_ope', 0),
('11065', 'tc_inf_sec', 1),
('11065', 'tc_net_pro', 1),
('11065', 'tc_soft_pro', 0),
('12095', 'tc_com_exc', 1),
('12095', 'tc_com_nor', 1),
('12095', 'tc_com_ope', 1),
('12095', 'tc_inf_sec', 0),
('12095', 'tc_net_pro', 0),
('12095', 'tc_soft_pro', 0),
('83040', 'tc_infcom_ope', 0),
('83040', 'tc_math_nor', 1),
('89036', 'tc_infcom_ope', 1),
('89036', 'tc_math_nor', 1),
('90010', 'tc_com_exc', 0),
('90010', 'tc_com_nor', 0),
('90010', 'tc_com_ope', 0),
('90010', 'tc_inf_sec', 0),
('90010', 'tc_net_pro', 0),
('90010', 'tc_soft_pro', 1),
('92034', 'tc_infcom_ope', 1),
('92034', 'tc_math_nor', 1);

-- --------------------------------------------------------

--
-- 表的结构 `task_info`
--

CREATE TABLE `task_info` (
  `relativeTable` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `year` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `semester` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `departmentDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `teacherDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `taskState` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `task_info`
--

INSERT INTO `task_info` (`relativeTable`, `year`, `semester`, `departmentDeadline`, `teacherDeadline`, `taskState`) VALUES
('tc_com_exc201601', '2016', '01', '20160420', '20160418', 2),
('tc_com_nor201601', '2016', '01', '20160420', '20160418', 2),
('tc_com_ope201601', '2016', '01', '20160420', '20160418', 2),
('tc_inf_sec201601', '2016', '01', '20160420', '20160418', 2),
('tc_infcom_ope201601', '2016', '01', '20160420', '20160418', 2),
('tc_math_nor201601', '2016', '01', '20161027', '20161014', 2),
('tc_math_nor201602', '2016', '02', '20161126', '20161111', 2),
('tc_net_pro201602', '2016', '02', '2016/10/27', '2016/10/20', 2),
('tc_soft_pro201601', '2016', '01', '20160910', '20161010', 2);

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_exc201601`
--

CREATE TABLE `tc_com_exc201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_exc201601`
--

INSERT INTO `tc_com_exc201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期计算机科学与技术（卓越班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '计算机科学与技术（卓越班）', '96', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', ''),
(5, '', '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '', '', ''),
(5, '06033', '2013', '计算机科学与技术（卓越班）', '96', ' 企业实践', '  毕业实习', '15', '', '', '', '', '张浩', ''),
(6, '', '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '', ''),
(6, '03112', '2014', '计算机科学与技术（卓越班）', '125', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '赵彦敏', ''),
(7, '', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(7, '03003', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(7, '89085', '2014', '计算机科学与技术（卓越班）', '125', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(8, '', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(8, '03154', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '1--12', '陈晖', '（刘秉瀚、陈晖）刘秉瀚、陈晖合作上1个班，希望安排在下午的5，6节。'),
(8, '04166', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '', '何振峰', '理论与实践课选同一老师'),
(8, '83046', '2014', '计算机科学与技术（卓越班）', '125', ' 编译方法', '  专业必修（限选）', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。'),
(9, '', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(9, '03154', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(9, '04166', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '何振峰', '理论与实践课选同一老师'),
(9, '83046', '2014', '计算机科学与技术（卓越班）', '125', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(10, '', '2014', '计算机科学与技术（卓越班）', '125', ' 概率论与数理统计', '  学科必修', '3', '48', '', '', '', '', ''),
(11, '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', ''),
(11, '02124', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9', '王秀', ''),
(11, '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', ''),
(11, '88005', '2014', '计算机科学与技术（卓越班）', '125', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', ''),
(12, '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(12, '85118', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。'),
(13, '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(14, '', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(14, '03058', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节'),
(14, '10011', '2014', '计算机科学与技术（卓越班）', '125', ' 计算机系统结构', '  专业必修（限选）', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节'),
(15, '', '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '02005', '2014', '计算机科学与技术（卓越班）', '125', ' 宽带网及宽带接入技术', '  学科专业选修', '2', '32', '', '', '', '孙及园', '请安排在11～18周的下午'),
(16, '', '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(16, '02125', '2014', '计算机科学与技术（卓越班）', '125', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '吴小竹', ''),
(17, '', '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '', '', ''),
(17, '11013', '2014', '计算机科学与技术（卓越班）', '125', ' 嵌入式人机交互技术与GUI程序设计', '  学科专业选修', '2', '32', '', '', '', '於志勇', ''),
(18, '', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(18, '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', ''),
(18, '85073', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '林世平', ''),
(18, '87007', '2014', '计算机科学与技术（卓越班）', '125', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节'),
(19, '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '10044', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '张栋', ''),
(19, '11048', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '柯逍', ''),
(19, '94176', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节'),
(20, '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '10044', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '张栋', ''),
(20, '11048', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '柯逍', ''),
(20, '94176', '2014', '计算机科学与技术（卓越班）', '125', ' 软件工程实践', '  实践选修', '2', '48', '', '', '3-18', '汪璟玢', '4节连上'),
(21, '', '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(21, '95057', '2014', '计算机科学与技术（卓越班）', '125', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '1-16', '丁善镜', '第3，4节'),
(22, '', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(22, '15041', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '苏雅茹', ''),
(22, '88005', '2014', '计算机科学与技术（卓越班）', '125', ' 数据挖掘技术', '  学科专业选修', '2', '32', '', '', '', '白清源', ''),
(23, '', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(23, '82058', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401'),
(23, '96031', '2014', '计算机科学与技术（卓越班）', '125', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404'),
(24, '', '2014', '计算机科学与技术（卓越班）', '125', ' 网络和系统性能评估', '  学科专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(25, '95015', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '第1周--8周', '苏力', '周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节'),
(25, '98004', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', ''),
(26, '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(26, '95015', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '第3-18周', '苏力', '1.请同学选课和理论课老师相同。2.尽量选实验，否则理论课学习会受影响'),
(26, '98004', '2014', '计算机科学与技术（卓越班）', '125', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周', '倪一涛', '请安排周末'),
(27, '', '2014', '计算机科学与技术（卓越班）', '125', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(28, '06033', '2015', '计算机科学与技术（卓越班）', '1', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '张浩', ''),
(29, '', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', ''),
(29, '03171', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', ''),
(29, '08076', '2015', '计算机科学与技术（卓越班）', '1', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', ''),
(30, '', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(30, '03009', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1~12周', '董晨', '如果可以，请排在周1的3、4节和周3的7，8节'),
(30, '88064', '2015', '计算机科学与技术（卓越班）', '1', ' 数字电路与逻辑设计', '  专业必修（限选）', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节'),
(31, '', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', ''),
(31, '03009', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '第6周开始~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室'),
(31, '88064', '2015', '计算机科学与技术（卓越班）', '1', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8节'),
(32, '', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '', '', ''),
(32, '03171', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '', '王一蕾', ''),
(32, '04059', '2015', '计算机科学与技术（卓越班）', '1', ' 算法与数据结构', '  专业必修（限选）', '5', '80', '', '28', '1-14', '余春艳', ''),
(33, '', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', ''),
(33, '02124', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '1-16', '王秀', ''),
(33, '03161', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', ''),
(33, '15028', '2016', '计算机科学与技术（卓越班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', ''),
(34, '', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '', '', ''),
(34, '08076', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10', '陈勃', ''),
(34, '15041', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '', '苏雅茹', ''),
(34, '85118', '2016', '计算机科学与技术（卓越班）', '1', ' 计算机导论', '  公共必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。'),
(35, '', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', ''),
(35, '08076', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', ''),
(35, '85118', '2016', '计算机科学与技术（卓越班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_nor201601`
--

CREATE TABLE `tc_com_nor201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_nor201601`
--

INSERT INTO `tc_com_nor201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期计算机开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '计算机科学与技术', '62', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(5, '', '2013', '计算机科学与技术', '62', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '', ''),
(6, '02005', '2013', '计算机科学与技术', '62', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在2～9周的下午'),
(7, '', '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '95057', '2013', '计算机科学与技术', '62', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16', '丁善镜', '第5，6节'),
(8, '', '2013', '计算机科学与技术', '62', ' 分布式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '03030', '2013', '计算机科学与技术', '62', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '蒋启强', ''),
(10, '', '2013', '计算机科学与技术', '62', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术', '62', ' 软件可靠性与可信软件', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术', '62', ' 虚拟现实', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术', '62', ' 云计算', '  专业选修', '2', '32', '', '', '', '', ''),
(14, '', '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '', ''),
(14, '03112', '2014', '计算机科学与技术', '15', ' EDA技术', '  专业方向（限选）1', '2', '32', '', '16', '', '赵彦敏', ''),
(15, '', '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(15, '06420', '2014', '计算机科学与技术', '15', ' Java语言程序设计', '  实践选修', '2', '48', '', '', '1-16', '陈嘉', '因课时较多，希望能一周少安排一些课，多安排几周'),
(16, '', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '03003', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(16, '89085', '2014', '计算机科学与技术', '15', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(17, '', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', ''),
(17, '03154', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '1--12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。'),
(17, '04166', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(17, '83046', '2014', '计算机科学与技术', '15', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。'),
(18, '', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(18, '03154', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(18, '04166', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(18, '83046', '2014', '计算机科学与技术', '15', ' 编译系统设计实践', '  实践选修', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(19, '', '2014', '计算机科学与技术', '15', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', ''),
(20, '', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', ''),
(20, '02124', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '1-9', '王秀', ''),
(20, '04021', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '陈欢', ''),
(20, '15041', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', ''),
(20, '88005', '2014', '计算机科学与技术', '15', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', ''),
(21, '', '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(21, '85118', '2014', '计算机科学与技术', '15', ' 计算机图形学', '  专业方向（限选）3', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。'),
(22, '', '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(22, '85118', '2014', '计算机科学与技术', '15', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11', '谢伙生', ''),
(23, '', '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(23, '11065', '2014', '计算机科学与技术', '15', ' 计算机网络体系结构', '  专业方向（限选）1', '2', '32', '', '', '1-8', '郑相涵', ''),
(24, '', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '', ''),
(24, '03058', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节'),
(24, '10011', '2014', '计算机科学与技术', '15', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节'),
(25, '', '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '02005', '2014', '计算机科学与技术', '15', ' 宽带网及宽带接入技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在11～18周的下午'),
(26, '', '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(26, '02125', '2014', '计算机科学与技术', '15', ' 面向对象设计方法(UML)', '  专业方向（限选）2', '2', '32', '', '', '', '吴小竹', ''),
(27, '', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(27, '15041', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', ''),
(27, '85073', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '林世平', ''),
(27, '87007', '2014', '计算机科学与技术', '15', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节'),
(28, '', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(28, '10044', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '张栋', ''),
(28, '11048', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '', '柯逍', ''),
(28, '94176', '2014', '计算机科学与技术', '15', ' 软件工程A', '  专业必修（限选）', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节'),
(29, '', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '', ''),
(29, '10044', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '张栋', ''),
(29, '11048', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '', '柯逍', ''),
(29, '94176', '2014', '计算机科学与技术', '15', ' 软件工程实践', '  实践选修', '2', '48', '', '', '3-18', '汪璟玢', '4节连上'),
(30, '', '2014', '计算机科学与技术', '15', ' 软件体系结构', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(31, '', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(31, '15041', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '苏雅茹', ''),
(31, '88005', '2014', '计算机科学与技术', '15', ' 数据挖掘技术', '  专业方向（限选）3', '2', '32', '', '', '', '白清源', ''),
(32, '', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(32, '82058', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401'),
(32, '96031', '2014', '计算机科学与技术', '15', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404'),
(33, '', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(33, '95015', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '第1-8周', '苏力', '周2，周4。麻烦和实验班的《汇编与接口技术》连排，最好3，4节连排5,6节'),
(33, '98004', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', ''),
(34, '', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '95015', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '低3-18周', '苏力', '实验课和理论课选相同老师，实验课尽量要选，否则可能影响理论课的学习和考试'),
(34, '98004', '2014', '计算机科学与技术', '15', ' 现代计算机接口技术实践', '  实践选修', '1.5', '36', '', '', '4至12周', '倪一涛', '请安排周末'),
(35, '', '2014', '计算机科学与技术', '15', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(36, '06033', '2015', '计算机类', '216', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '张浩', ''),
(37, '', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', ''),
(37, '03032', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-18', '孙岚', '请尽量不要排1、2节课'),
(37, '03171', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', ''),
(37, '08076', '2015', '计算机类', '216', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', ''),
(38, '', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', ''),
(38, '03009', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12', '董晨', '如果可以，请安排在周1的3、4节和周3的7、8节'),
(38, '88064', '2015', '计算机类', '216', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节'),
(39, '', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', ''),
(39, '03009', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室'),
(39, '88064', '2015', '计算机类', '216', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8'),
(40, '', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', ''),
(40, '03171', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '王一蕾', ''),
(40, '04059', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14', '余春艳', ''),
(40, '06018', '2015', '计算机类', '216', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-13', '傅仰耿', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后'),
(41, '', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', ''),
(41, '02124', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '1-16', '王秀', ''),
(41, '03161', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', ''),
(41, '15028', '2016', '计算机类', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', ''),
(42, '', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', ''),
(42, '08076', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '陈勃', ''),
(42, '15041', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '苏雅茹', ''),
(42, '85118', '2016', '计算机类', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。'),
(43, '', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', ''),
(43, '08076', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', ''),
(43, '85118', '2016', '计算机类', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_ope201601`
--

CREATE TABLE `tc_com_ope201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_ope201601`
--

INSERT INTO `tc_com_ope201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期计算机科学与技术（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '计算机科学与技术（实验班）', '60', ' GPU高性能计算', '  专业选修', '2', '32', '', '', '', '', ''),
(5, '', '2013', '计算机科学与技术（实验班）', '60', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '60', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '02005', '2013', '计算机科学与技术（实验班）', '60', ' 多媒体通信技术', '  专业选修', '2', '32', '', '', '', '孙及园', '请安排在2～9周的下午'),
(8, '', '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '95057', '2013', '计算机科学与技术（实验班）', '60', ' 分布式操作系统', '  专业选修', '2', '32', '', '', '1-16', '丁善镜', '第5，6节'),
(9, '', '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '03030', '2013', '计算机科学与技术（实验班）', '60', ' 广域网技术实验', '  实践选修', '1', '24', '', '', '', '蒋启强', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '', ''),
(10, '03161', '2013', '计算机科学与技术（实验班）', '60', ' 互联网产品设计', '  专业选修', '2.5', '40', '', '', '', '林秋月', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机动画课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机辅助设计', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '60', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '60', ' 近世代数', '  专业选修', '3', '48', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '60', ' 软件可靠性', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '60', ' 数学物理方程', '  专业选修', '3', '48', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(19, '06018', '2013', '计算机科学与技术（实验班）', '60', ' 算法设计', '  专业必修（限选）', '2', '32', '', '', '1-8', '傅仰耿', '不安排周一和周五'),
(20, '', '2013', '计算机科学与技术（实验班）', '60', ' 移动编程实践', '  实践选修', '1', '24', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '03161', '2013', '计算机科学与技术（实验班）', '60', ' 运筹学', '  专业选修', '2', '32', '', '', '', '林秋月', ''),
(22, '', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '', ''),
(22, '03003', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(22, '89085', '2014', '计算机科学与技术（实验班）', '73', ' Linux操作系统设计实践', '  实践环节', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(23, '', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', ''),
(23, '03154', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。'),
(23, '04166', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(23, '83046', '2014', '计算机科学与技术（实验班）', '73', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。'),
(24, '', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '', '', ''),
(24, '03154', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(24, '04166', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(24, '83046', '2014', '计算机科学与技术（实验班）', '73', ' 编译系统设计实践', '  实践环节', '1.5', '36', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(25, '', '2014', '计算机科学与技术（实验班）', '73', ' 复变函数', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2014', '计算机科学与技术（实验班）', '73', ' 概率论与数理统计', '  公共必修', '4', '64', '', '', '', '', ''),
(27, '', '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '', '', ''),
(27, '95015', '2014', '计算机科学与技术（实验班）', '73', ' 汇编与接口技术', '  学科必修', '3', '48', '', '24', '第3-8周', '苏力', '周2，周4。麻烦和普通班班的《现代计算机接口技术》连排，最好3，4节连排5,6节，实验课连排4节'),
(28, '', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '', ''),
(28, '15041', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '苏雅茹', ''),
(28, '88005', '2014', '计算机科学与技术（实验班）', '73', ' 计算方法', '  学科必修', '2', '32', '', '', '', '白清源', ''),
(29, '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '85118', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学', '  专业选修', '2', '32', '', '', '1-8', '谢伙生', '与计算机导论课排在同一个上午，教室同一间。'),
(30, '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(30, '85118', '2014', '计算机科学与技术（实验班）', '73', ' 计算机图形学综合实验', '  实践选修', '1.5', '36', '', '', '3-11', '谢伙生', ''),
(31, '', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '', ''),
(31, '03058', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '1-18', '尚艳艳', '课程不安排在12节'),
(31, '10011', '2014', '计算机科学与技术（实验班）', '73', ' 计算机系统结构', '  学科必修', '3', '48', '', '', '', '林嘉雯', '尽可能安排在上午3、4节或者下午1、2节'),
(32, '', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(32, '15041', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '', '苏雅茹', ''),
(32, '85034', '2014', '计算机科学与技术（实验班）', '73', ' 人工智能', '  专业必修（限选）', '2', '32', '', '', '第1周', '叶东毅', '请尽量安排在上午3-4节'),
(33, '', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '', ''),
(33, '10044', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '张栋', ''),
(33, '11048', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '', '柯逍', ''),
(33, '94176', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程A', '  学科必修', '3', '48', '', '', '1-18', '汪璟玢', '不要安排7,8节'),
(34, '', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '', ''),
(34, '10044', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '张栋', ''),
(34, '11048', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '', '柯逍', ''),
(34, '94176', '2014', '计算机科学与技术（实验班）', '73', ' 软件工程实践', '  实践环节', '2', '48', '', '', '3-18', '汪璟玢', '4节连上'),
(35, '', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '15041', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '苏雅茹', ''),
(35, '88005', '2014', '计算机科学与技术（实验班）', '73', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '白清源', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '73', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(37, '82058', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '郭洪', '网络实验室401'),
(37, '96031', '2014', '计算机科学与技术（实验班）', '73', ' 网络管理实验', '  实践选修', '1', '24', '', '', '5-7周星期日1-8节', '林常俊', '网络实验室404'),
(38, '', '2014', '计算机科学与技术（实验班）', '73', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(39, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(39, '06033', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '第一周', '张浩', '1~6周，周四7~8节实验'),
(40, '', '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', ''),
(40, '04021', '2015', '计算机科学与技术（实验班）', '70', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '陈欢', ''),
(41, '', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', ''),
(41, '03009', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12周', '董晨', '由于龙坤在国外，前几周董晨上，后几周郭龙坤上。请尽量安排在董晨普通班同一个时间段，如：同一个上午或下午，或3、4节和5、6节。非常感谢'),
(41, '11061', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '郭龙坤', '时间为周一与周三，与董辰合上，时间须错开。'),
(41, '88064', '2015', '计算机科学与技术（实验班）', '70', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节周三7、8节'),
(42, '', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '', '', ''),
(42, '11061', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-18', '郭龙坤', ''),
(42, '88064', '2015', '计算机科学与技术（实验班）', '70', ' 数字逻辑电路设计', '  实践环节', '2', '48', '', '', '6-17', '胡颖', '周六1-8'),
(43, '', '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', ''),
(43, '04019', '2015', '计算机科学与技术（实验班）', '70', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-15', '吴英杰', '独立开班，因有多个周末需带学生外出比赛，烦请尽量排在周二至周四，谢谢！'),
(44, '', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', ''),
(44, '03032', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '孙岚', ''),
(44, '03161', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', ''),
(44, '15028', '2016', '计算机科学与技术（实验班）', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '刘文犀', ''),
(45, '', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', ''),
(45, '15041', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '苏雅茹', ''),
(45, '85073', '2016', '计算机科学与技术（实验班）', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '林世平', ''),
(46, '', '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', ''),
(46, '85073', '2016', '计算机科学与技术（实验班）', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '林世平', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_departheadright`
--

CREATE TABLE `tc_departheadright` (
  `drid` mediumint(8) NOT NULL COMMENT '权限编号',
  `workNumber` varchar(10) NOT NULL COMMENT '导师工号',
  `department` varchar(30) NOT NULL COMMENT '系别'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `tc_grade`
--

CREATE TABLE `tc_grade` (
  `gid` mediumint(8) UNSIGNED NOT NULL COMMENT '年级记录编号',
  `grade` char(4) NOT NULL COMMENT '年级'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tc_grade`
--

INSERT INTO `tc_grade` (`gid`, `grade`) VALUES
(1, '2014');

-- --------------------------------------------------------

--
-- 表的结构 `tc_infcom_ope201601`
--

CREATE TABLE `tc_infcom_ope201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_infcom_ope201601`
--

INSERT INTO `tc_infcom_ope201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期数学类（实验班）开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '数学与应用数学（实验班）', '23', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(5, '', '2013', '数学与应用数学（实验班）', '23', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '', ''),
(6, '', '2013', '数学与应用数学（实验班）', '23', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(7, '', '2013', '数学与应用数学（实验班）', '23', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '', ''),
(8, '', '2013', '数学与应用数学（实验班）', '23', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学（实验班）', '23', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '', ''),
(10, '', '2013', '数学与应用数学（实验班）', '23', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学（实验班）', '23', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学（实验班）', '23', ' 随机分析', '  专业选修', '3', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学（实验班）', '23', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学（实验班）', '23', ' 专业实习', '  实践环节', '3', '', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学（实验班）', '23', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(16, '', '2013', '信息与计算科学（实验班）', '9', ' C++程序设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(17, '', '2013', '信息与计算科学（实验班）', '9', ' Java程序设计', '  实践选修', '1', '24', '', '', '', '', ''),
(18, '', '2013', '信息与计算科学（实验班）', '9', ' 高等代数选讲', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '信息与计算科学（实验班）', '9', ' 计算机密码学', '  专业选修', '3', '48', '', '16', '', '', ''),
(20, '', '2013', '信息与计算科学（实验班）', '9', ' 计算机图形学', '  专业选修', '3', '48', '', '', '', '', ''),
(21, '', '2013', '信息与计算科学（实验班）', '9', ' 数据库应用实训', '  实践选修', '2', '48', '', '', '', '', ''),
(22, '', '2013', '信息与计算科学（实验班）', '9', ' 数学分析选讲', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(23, '', '2013', '信息与计算科学（实验班）', '9', ' 算法设计实训', '  实践选修', '2', '48', '', '', '', '', ''),
(24, '', '2013', '信息与计算科学（实验班）', '9', ' 随机分析', '  专业选修', '3', '48', '', '', '', '', ''),
(25, '', '2013', '信息与计算科学（实验班）', '9', ' 信息系统实训', '  实践选修', '2', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学（实验班）', '9', ' 专业实习', '  实践环节', '3', '', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学（实验班）', '9', ' 组合图论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(28, '', '2014', '数学与应用数学（实验班）', '21', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '', ''),
(29, '', '2014', '数学与应用数学（实验班）', '21', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(30, '', '2014', '数学与应用数学（实验班）', '21', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '', ''),
(31, '', '2014', '数学与应用数学（实验班）', '21', ' 复变函数', '  学科必修', '3', '48', '', '', '', '', ''),
(32, '', '2014', '数学与应用数学（实验班）', '21', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '', ''),
(33, '', '2014', '数学与应用数学（实验班）', '21', ' 金融分析', '  专业选修', '3', '48', '', '', '', '', ''),
(34, '', '2014', '数学与应用数学（实验班）', '21', ' 近世代数', '  学科必修', '3', '48', '', '', '', '', ''),
(35, '', '2014', '数学与应用数学（实验班）', '21', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '', ''),
(36, '88005', '2014', '数学与应用数学（实验班）', '21', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '白清源', ''),
(37, '', '2014', '数学与应用数学（实验班）', '21', ' 数理统计', '  学科必修', '3', '48', '', '', '', '', ''),
(38, '', '2014', '数学与应用数学（实验班）', '21', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(39, '', '2014', '数学与应用数学（实验班）', '21', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '', '2014', '数学与应用数学（实验班）', '21', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '', ''),
(41, '', '2014', '数学与应用数学（实验班）', '21', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(42, '', '2014', '信息与计算科学（实验班）', '9', ' 创新设计或课程设计', '  实践选修', '3', '72', '', '', '', '', ''),
(43, '', '2014', '信息与计算科学（实验班）', '9', ' 泛函分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(44, '', '2014', '信息与计算科学（实验班）', '9', ' 分布计算', '  专业选修', '3', '48', '', '8', '', '', ''),
(45, '', '2014', '信息与计算科学（实验班）', '9', ' 复变函数', '  学科必修', '3', '48', '', '', '', '', ''),
(46, '', '2014', '信息与计算科学（实验班）', '9', ' 计算机网络', '  专业选修', '3', '48', '', '16', '', '', ''),
(47, '', '2014', '信息与计算科学（实验班）', '9', ' 金融分析', '  专业选修', '3', '48', '', '', '', '', ''),
(48, '', '2014', '信息与计算科学（实验班）', '9', ' 近世代数', '  学科必修', '3', '48', '', '', '', '', ''),
(49, '', '2014', '信息与计算科学（实验班）', '9', ' 面向对象程序设计B', '  专业选修', '3', '48', '', '16', '', '', ''),
(50, '', '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '', ''),
(50, '88005', '2014', '信息与计算科学（实验班）', '9', ' 数据挖掘', '  专业选修', '3', '48', '', '8', '', '白清源', ''),
(51, '', '2014', '信息与计算科学（实验班）', '9', ' 数理统计', '  学科必修', '3', '48', '', '', '', '', ''),
(52, '', '2014', '信息与计算科学（实验班）', '9', ' 数学物理方程', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(53, '', '2014', '信息与计算科学（实验班）', '9', ' 数字信号处理', '  专业选修', '2', '32', '', '', '', '', ''),
(54, '', '2014', '信息与计算科学（实验班）', '9', ' 拓扑学基础', '  学科必修', '3', '48', '', '', '', '', ''),
(55, '', '2014', '信息与计算科学（实验班）', '9', ' 专家系列讲座', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(56, '', '2015', '数学类（实验班）', '29', ' Web设计软件应用实训', '  实践环节', '2', '48', '', '', '', '', ''),
(57, '', '2015', '数学类（实验班）', '29', ' 常微分方程', '  学科必修', '3', '48', '', '', '', '', ''),
(58, '', '2015', '数学类（实验班）', '29', ' 数据结构', '  学科必修', '3.5', '56', '', '16', '', '', ''),
(59, '', '2015', '数学类（实验班）', '29', ' 数据库原理及应用', '  专业选修', '3', '48', '', '16', '', '', ''),
(60, '', '2015', '数学类（实验班）', '29', ' 数理逻辑', '  学科必修', '2', '32', '', '', '', '', ''),
(61, '', '2015', '数学类（实验班）', '29', ' 数学分析（下）', '  学科必修', '6', '96', '', '', '', '', ''),
(62, '', '2016', '数学类（实验班）', '1', ' 高等代数（上）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(63, '', '2016', '数学类（实验班）', '1', ' 解析几何', '  学科必修', '2.5', '40', '', '', '', '', ''),
(64, '', '2016', '数学类（实验班）', '1', ' 数学分析（上）', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '', '2016', '数学类（实验班）', '1', ' 数学学科导论（数学史）', '  学科必修', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_inf_sec201601`
--

CREATE TABLE `tc_inf_sec201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_inf_sec201601`
--

INSERT INTO `tc_inf_sec201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期信息安全专业开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(4, '03030', '2013', '信息安全', '37', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '蒋启强', '(何萧玲、张浩合上)'),
(5, '', '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '', ''),
(5, '02005', '2013', '信息安全', '37', ' IT企业项目实训', '  实践选修', '2', '48', '', '', '', '孙及园', ''),
(6, '', '2013', '信息安全', '37', ' 安全协议导论', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '', '2013', '信息安全', '37', ' 电子商务信息安全技术', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '信息安全', '37', ' 可信系统与可信计算', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '', '', ''),
(9, '06033', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '第九周', '张浩', '每次四节课，张浩、李应、倪一涛、邹剑、何萧玲共同承担'),
(9, '98004', '2013', '信息安全', '37', ' 信息安全科技实训 2', '  实践环节', '1', '24', '', '', '', '倪一涛', ''),
(10, '', '2014', '信息安全', '39', ' Java语言程序设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '03003', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '程烨', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(11, '89085', '2014', '信息安全', '39', ' Linux操作系统设计实践', '  实践选修', '1.5', '36', '', '', '', '郭红', '周4学时连上,机房上课。程烨一个班，郭红一个班，两个班安排同一时间段上课，每班限选人数60人。'),
(12, '', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '', '', ''),
(12, '03154', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '陈晖', '（刘秉瀚、陈晖）合作上1个班，希望安排在上午3，4节或下午的5，6节。'),
(12, '04166', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(12, '83046', '2014', '信息安全', '39', ' 编译方法', '  学科必修', '3', '48', '', '', '1-12', '刘秉瀚', '（刘秉瀚、陈晖）合作上1个班，希望安排在下午的5，6节。'),
(13, '', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '', '', ''),
(13, '03154', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '第4周开始', '陈晖', '刘秉瀚、陈晖，分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(13, '04166', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '', '何振峰', '理论课与实践课选同一老师'),
(13, '83046', '2014', '信息安全', '39', ' 编译系统设计实践', '  实践选修', '1.5', '', '', '', '4-12', '刘秉瀚', '分成2个班，要求与《编译方法》同一学期上，滞后3周，每周4节，安排周六。选修《编译系统设计实践》和理论课《编译方法》的老师要一致'),
(14, '', '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '', ''),
(14, '96070', '2014', '信息安全', '39', ' 操作系统与数据库安全', '  专业选修', '2', '32', '', '', '', '刘延华', '请不要安排在1-2节和7-8节，谢谢！'),
(15, '', '2014', '信息安全', '39', ' 概率论与数理统计', '  公共必修', '3', '48', '', '', '', '', ''),
(16, '', '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(16, '98004', '2014', '信息安全', '39', ' 计算机病毒概论', '  专业必修（限选）', '2', '32', '', '', '1至8周', '倪一涛', '请安排在院实验室上课'),
(17, '', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '85073', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '', '林世平', ''),
(17, '87007', '2014', '信息安全', '39', ' 人工智能', '  专业选修', '2', '32', '', '', '第一周', '陈昭炯', '不排在上午1-2节'),
(18, '', '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '88005', '2014', '信息安全', '39', ' 数据挖掘技术', '  专业选修', '2', '32', '', '', '', '白清源', ''),
(19, '', '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '11037', '2014', '信息安全', '39', ' 通信原理', '  专业必修（限选）', '3', '48', '', '', '1-16周', '陈开志', '安排下午上课，5-8节之间都可以'),
(20, '', '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(20, '06033', '2014', '信息安全', '39', ' 网络程序设计', '  专业必修（限选）', '2.5', '40', '', '', '第一周', '张浩', '和去年一样星期2,5:3-4节; 尽量安排在上午3、4节课'),
(21, '', '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '', '', ''),
(21, '06033', '2014', '信息安全', '39', ' 网络程序设计实践', '  实践环节', '1', '24', '', '', '第四周', '张浩', '和去年一样星期2：5-8节'),
(22, '', '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(22, '95098', '2014', '信息安全', '39', ' 网络攻防实验', '  实践环节', '1.5', '36', '', '', '15-19周', '何萧玲', '请安排每周一次，每次8学时，请安排在周六，谢谢'),
(23, '', '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '', '', ''),
(23, '95098', '2014', '信息安全', '39', ' 网络信息对抗与安全', '  专业必修（限选）', '3', '48', '8', '', '12-19周', '何萧玲', '请12-17周每周2次课，每次3学时（可否安排在晚上？不行请安排下午，谢谢），第18周，每周两次，每次2学时，19周上机，每周两次，每次4学时。（钟尚平老师合班上课）'),
(24, '', '2014', '信息安全', '39', ' 现代搜索引擎技术及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '', '', ''),
(25, '02005', '2014', '信息安全', '39', ' 信息论与编码', '  学科必修', '2', '32', '', '', '', '孙及园', '请安排在1～18周的下午，每周2节课'),
(26, '', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '', ''),
(26, '03171', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '', '王一蕾', '请尽量将我的课排在上午'),
(26, '08076', '2015', '信息安全', '50', ' 离散数学A', '  学科必修', '4.5', '72', '', '', '1-16', '陈勃', ''),
(27, '', '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(27, '12005', '2015', '信息安全', '50', ' 密码理论与技术', '  专业必修（限选）', '3', '48', '', '', '1-16', '杨旸', '请排3-4节课，谢谢！'),
(28, '', '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '', '', ''),
(28, '12005', '2015', '信息安全', '50', ' 密码学综合设计实验', '  实践环节', '1', '24', '', '', '5-16', '杨旸', '4节连上！请排一个上午或一个下午'),
(29, '', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '', '', ''),
(29, '03009', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1~12', '董晨', '如果可以，请安排在周1的3、4节和周3的7、8节'),
(29, '88064', '2015', '信息安全', '50', ' 数字电路与逻辑设计', '  学科必修', '3', '48', '', '', '1-12', '胡颖', '周一3、4节，周三7、8节'),
(30, '', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '', '', ''),
(30, '03009', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6~期末', '董晨', '董晨老师班请安排在周一下午或周五下午，与胡颖老师和郭龙坤老师不能同时，因为共用一个实验室'),
(30, '88064', '2015', '信息安全', '50', ' 数字逻辑电路设计', '  实践选修', '2', '48', '', '', '6-17', '胡颖', '周六1-8节'),
(31, '', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '', '', ''),
(31, '04059', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-14', '余春艳', ''),
(31, '06018', '2015', '信息安全', '50', ' 算法与数据结构', '  学科必修', '5', '80', '', '28', '1-13', '傅仰耿', '（傅仰耿、王晓东），不排周一周五，上机排在第一次授课之后'),
(32, '', '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '', ''),
(32, '03161', '2016', '信息安全', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '32', '', '林秋月', ''),
(33, '', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '', '', ''),
(33, '08076', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '陈勃', ''),
(33, '85118', '2016', '信息安全', '1', ' 计算机导论', '  学科必修', '1.5', '24', '', '', '3-10', '谢伙生', '与计算机图形学课排在同一个上午，教室同一间。'),
(34, '', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '', '', ''),
(34, '08076', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '10-15', '陈勃', ''),
(34, '85118', '2016', '信息安全', '1', ' 认识实习（计算机基础训练）', '  实践环节', '1', '24', '', '', '11-16', '谢伙生', ''),
(35, '', '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '', ''),
(35, '02112', '2016', '信息安全', '1', ' 信息安全概论', '  学科必修', '1.5', '24', '', '', '', '陈明志', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_issue_2014`
--

CREATE TABLE `tc_issue_2014` (
  `pid` mediumint(8) NOT NULL,
  `workNumber` varchar(10) NOT NULL COMMENT '导师工号',
  `title` varchar(30) NOT NULL COMMENT '课题标题',
  `content` mediumtext COMMENT '课题内容',
  `time` int(11) NOT NULL COMMENT '课题时间（时间戳）',
  `totalCompExper` int(11) NOT NULL COMMENT '导师所带计算机实验班学生数',
  `totalMathExper` int(11) NOT NULL COMMENT '导师所带数学实验班学生数',
  `totalNatur` int(11) NOT NULL COMMENT '导师所带自然班学生数',
  `compExperNow` int(11) NOT NULL COMMENT '当前计算机实验班学生数',
  `mathExperNow` int(11) NOT NULL COMMENT '当前数学实验班学生数',
  `naturNow` int(11) NOT NULL DEFAULT '0' COMMENT '当前自然班学生数'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tc_issue_2014`
--

INSERT INTO `tc_issue_2014` (`pid`, `workNumber`, `title`, `content`, `time`, `totalCompExper`, `totalMathExper`, `totalNatur`, `compExperNow`, `mathExperNow`, `naturNow`) VALUES
(1, '00001', '111', '111111', 1479493717, 3, 7, 0, 1, 1, 1),
(2, '00022', '111', '111111', 1479493717, 4, 5, 0, 0, 2, 0),
(3, '01004', '111', '111111', 1479493717, 5, 7, 0, 0, 2, 0),
(4, '01007', '111', '111111', 1479493717, 3, 8, 0, 2, 1, 0),
(5, '01009', '111', '111111', 1479493717, 3, 7, 0, 0, 2, 0),
(6, '01017', '111', '111111', 1479493717, 4, 4, 0, 1, 0, 0),
(7, '01029', '111', '111111', 1479493717, 5, 8, 0, 0, 0, 0),
(8, '01100', '111', '111111', 1479493717, 5, 8, 0, 1, 2, 0),
(9, '02025', '111', '111111', 1479493717, 4, 7, 0, 0, 2, 0),
(10, '02089', '111', '111111', 1479493717, 4, 7, 0, 2, 2, 0),
(11, '02103', '111', '111111', 1479493717, 3, 5, 0, 1, 1, 0),
(12, '02108', '111', '111111', 1479493717, 4, 6, 0, 2, 0, 0),
(13, '02112', '111', '111111', 1479493717, 4, 8, 0, 1, 0, 0),
(14, '02117', '111', '111111', 1479493717, 3, 8, 0, 1, 2, 0),
(15, '02124', '111', '111111', 1479493717, 3, 7, 0, 2, 2, 0),
(16, '02125', '111', '111111', 1479493717, 3, 6, 0, 2, 0, 0),
(17, '02128', '111', '111111', 1479493717, 5, 4, 0, 2, 2, 0),
(18, '03003', '111', '111111', 1479493717, 3, 6, 0, 0, 0, 0),
(19, '03009', '111', '111111', 1479493717, 4, 5, 0, 2, 2, 0),
(20, '03010', '111', '111111', 1479493717, 5, 5, 0, 1, 1, 0),
(21, '03014', '111', '111111', 1479493717, 4, 6, 0, 1, 2, 0),
(22, '03015', '111', '111111', 1479493717, 3, 8, 0, 1, 2, 0),
(23, '03016', '111', '111111', 1479493717, 3, 8, 0, 1, 2, 0),
(24, '03030', '111', '111111', 1479493717, 4, 7, 0, 2, 0, 0),
(25, '03032', '111', '111111', 1479493717, 5, 8, 0, 0, 1, 0),
(26, '03048', '111', '111111', 1479493717, 5, 7, 0, 1, 2, 0),
(27, '03052', '111', '111111', 1479493717, 4, 6, 0, 2, 2, 0),
(28, '03058', '111', '111111', 1479493717, 3, 7, 0, 0, 2, 0),
(29, '03061', '111', '111111', 1479493717, 4, 6, 0, 0, 2, 0),
(30, '03073', '111', '111111', 1479493717, 5, 4, 0, 1, 0, 0),
(31, '03074', '111', '111111', 1479493717, 3, 5, 0, 0, 1, 0),
(32, '03076', '111', '111111', 1479493717, 4, 4, 0, 0, 0, 0),
(33, '03084', '111', '111111', 1479493717, 5, 4, 0, 1, 0, 0),
(34, '03096', '111', '111111', 1479493717, 4, 5, 0, 2, 2, 0),
(35, '03111', '111', '111111', 1479493717, 4, 5, 0, 2, 2, 0),
(36, '03112', '111', '111111', 1479493717, 3, 5, 0, 1, 2, 0),
(37, '03135', '111', '111111', 1479493717, 4, 7, 0, 2, 0, 0),
(38, '03154', '111', '111111', 1479493717, 3, 8, 0, 0, 2, 0),
(39, '03161', '111', '111111', 1479493717, 3, 5, 0, 2, 0, 0),
(40, '03171', '111', '111111', 1479493717, 4, 8, 0, 2, 2, 0),
(41, '04010', '111', '111111', 1479493717, 5, 6, 0, 2, 0, 0),
(42, '04017', '111', '111111', 1479493717, 5, 4, 0, 0, 0, 0),
(43, '04018', '111', '111111', 1479493717, 3, 5, 0, 2, 0, 0),
(44, '04019', '111', '111111', 1479493717, 3, 5, 0, 0, 0, 0),
(45, '04020', '111', '111111', 1479493717, 3, 6, 0, 1, 0, 0),
(46, '04021', '111', '111111', 1479493717, 4, 4, 0, 2, 0, 0),
(47, '04022', '111', '111111', 1479493717, 5, 6, 0, 0, 0, 0),
(48, '04025', '111', '111111', 1479493717, 4, 4, 0, 2, 2, 0),
(49, '04027', '111', '111111', 1479493717, 4, 6, 0, 2, 2, 0),
(50, '05023', '111', '111111', 1479493717, 3, 6, 0, 0, 0, 0),
(51, '12005', '111', '111111', 1479493717, 5, 8, 0, 1, 0, 0),
(52, '82058', '111', '111111', 1479493717, 5, 7, 0, 0, 2, 0),
(53, '96031', '111', '111111', 1479493717, 5, 6, 0, 0, 0, 0),
(54, '96070', '111', '111111', 1479493717, 5, 6, 0, 0, 1, 0),
(55, '97144', '111', '111111', 1479493717, 4, 5, 0, 0, 2, 0);

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201601`
--

CREATE TABLE `tc_math_nor201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201601`
--

INSERT INTO `tc_math_nor201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', ''),
(4, '00022', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '1-3周', '林锦', '不要晚上派克'),
(5, '00022', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '林锦', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201602`
--

CREATE TABLE `tc_math_nor201602` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201602`
--

INSERT INTO `tc_math_nor201602` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', ''),
(48, '00022', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '232323', '林锦', '123123123'),
(49, '00022', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '123123123', '林锦', '3443534534534'),
(48, '01004', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '问问', '蒋秀凤', '为');

-- --------------------------------------------------------

--
-- 表的结构 `tc_net_pro201602`
--

CREATE TABLE `tc_net_pro201602` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `tc_net_pro201602`
--

INSERT INTO `tc_net_pro201602` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年下学期网络工程专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '网络工程', '32', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '网络工程', '32', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '网络工程', '28', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '', '2013', '网络工程', '28', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(8, '', '2013', '网络工程', '28', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '', '2013', '网络工程', '28', ' Web程序设计', '  专业必修（限选）', '2', '32', '', '8', '', '', ''),
(10, '', '2013', '网络工程', '28', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '网络工程', '28', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '网络工程', '28', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '', '2013', '网络工程', '28', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '', '2013', '网络工程', '28', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '网络工程', '28', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '网络工程', '28', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(17, '', '2013', '网络工程', '28', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '网络工程', '28', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(19, '', '2013', '网络工程', '28', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '网络工程', '28', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '网络工程', '28', ' 计算机网络管理', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(22, '', '2013', '网络工程', '28', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '网络工程', '28', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(24, '', '2013', '网络工程', '28', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '网络工程', '28', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '网络工程', '28', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '网络工程', '28', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '网络工程', '28', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '网络工程', '28', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '网络工程', '28', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '网络工程', '28', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '', '2013', '网络工程', '28', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '网络工程', '28', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2013', '网络工程', '28', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(37, '', '2013', '网络工程', '28', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '网络工程', '28', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(39, '', '2013', '网络工程', '28', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '', '2013', '网络工程', '28', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(41, '', '2013', '网络工程', '28', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '', '2013', '网络工程', '28', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(35, '00022', '2013', '网络工程', '28', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '1-6周', '林锦', '不要晚上'),
(36, '00022', '2013', '网络工程', '28', ' 网络信息安全', '  专业必修（限选）', '2', '32', '', '', '2-8周', '林锦', '不要白天');

-- --------------------------------------------------------

--
-- 表的结构 `tc_net_pro201603`
--

CREATE TABLE `tc_net_pro201603` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `tc_result_2014`
--

CREATE TABLE `tc_result_2014` (
  `rid` mediumint(8) NOT NULL,
  `sid` mediumint(8) NOT NULL COMMENT '学生编号',
  `workNumber` varchar(10) NOT NULL COMMENT '导师工号'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tc_result_2014`
--

INSERT INTO `tc_result_2014` (`rid`, `sid`, `workNumber`) VALUES
(1, 1, '02112'),
(5, 4, '02112'),
(6, 5, '00001'),
(8, 2, '00001');

-- --------------------------------------------------------

--
-- 表的结构 `tc_soft_pro201601`
--

CREATE TABLE `tc_soft_pro201601` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_soft_pro201601`
--

INSERT INTO `tc_soft_pro201601` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2016学年上学期软件学院开课通知书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2013', '软件工程', '147', ' .NET Framework应用开发', '  专业选修', '2', '32', '', '8', '', '', ''),
(5, '', '2013', '软件工程', '147', ' Web应用软件工程', '  专业选修', '2', '32', '', '', '', '', ''),
(6, '', '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '', '', ''),
(6, '13046', '2013', '软件工程', '147', ' 电子商务概论', '  专业选修', '2', '32', '', '', '', '陈星', '已上过两学期'),
(7, '', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '08074', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课', '邓新国', '早晚送、接小孩，请不排12、78节'),
(7, '88005', '2013', '软件工程', '147', ' 数据仓库与数据挖掘', '  专业选修', '2', '32', '', '8', '', '白清源', ''),
(8, '', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '', ''),
(8, '06424', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '游天童', '8个学生'),
(8, '08025', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '詹青青', ''),
(8, '08074', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '邓新国', '《8人，11月份出国访问，是否可以带由系里决定'),
(8, '08102', '2013', '软件工程', '147', ' 专业实习', '  实践环节', '10', '', '', '', '', '姚仰光', ''),
(9, '', '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '', '', ''),
(9, '06420', '2014', '软件工程', '161', ' C＃程序设计', '  专业选修', '2.5', '40', '', '8', '正常安排', '陈嘉', '上机课安排在理论课后，希望上机课4节连排'),
(10, '', '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '', '', ''),
(10, '06404', '2014', '软件工程', '161', ' linux操作系统与设计实践', '  专业选修', '2.5', '40', '', '8', '', '陈家瑞', '因接小孩，希望理论课不要排在78节'),
(11, '', '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '', '', ''),
(11, '06421', '2014', '软件工程', '161', ' Web程序设计', '  专业必修（限选）', '3', '48', '', '16', '正常安排', '陈昱', '请尽量不安排上午12节'),
(12, '', '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(12, '02125', '2014', '软件工程', '161', ' XML程序设计', '  专业选修', '2', '32', '', '8', '', '吴小竹', ''),
(13, '', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '', '', ''),
(13, '06418', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '正常安排', '江兰帆', '一周4节，请不安排12节'),
(13, '96070', '2014', '软件工程', '161', ' 操作系统', '  学科必修', '3.5', '56', '', '8', '', '刘延华', '请不要安排在1-2节和7-8节，谢谢！'),
(14, '', '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(14, '82056', '2014', '软件工程', '161', ' 多媒体程序设计', '  专业选修', '2', '32', '', '8', '1-8', '陈建华', ''),
(15, '', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '', '', ''),
(15, '001333', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '2-12', '程红举', '分成两个班，和游天童老师合上，每周一个下午4节课'),
(15, '06424', '2014', '软件工程', '161', ' 计算机网络实践', '  实践环节', '1.5', '', '', '', '', '游天童', '分两班，每班一上午或一下午'),
(16, '', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(16, '06424', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '游天童', '分两班，安排在同一上午或下午，不同时段。'),
(16, '11013', '2014', '软件工程', '161', ' 计算机专业英语', '  专业必修（限选）', '2', '32', '', '', '', '於志勇', '(游天童，於志勇)'),
(17, '', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(17, '06419', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '张舒', '实验课安排在课程最后，周五不排课'),
(17, '13046', '2014', '软件工程', '161', ' 面向对象设计方法（UML)', '  专业必修（限选）', '3', '48', '', '8', '', '陈星', '已上过两学期'),
(18, '', '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '', '', ''),
(18, '08074', '2014', '软件工程', '161', ' 人工智能导论', '  专业选修', '2', '32', '', '8', '1-6周 11月份出国访问，请集中排课', '邓新国', '早晚送、接小孩，请不排12、78节'),
(19, '', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '', ''),
(19, '07106', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '从第10周开始', '夏又生', '每周2次（每次2节）或每周1次（每次3节）'),
(19, '13066', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '陈飞', '上课时间与夏又生老师一致'),
(19, '88005', '2014', '软件工程', '161', ' 数值计算', '  学科必修', '2', '32', '', '', '', '白清源', ''),
(20, '', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '', ''),
(20, '08025', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '詹青青', ''),
(20, '08102', '2015', '软件工程', '159', ' 计算机组成原理与汇编语言', '  学科必修', '4.5', '72', '', '12', '', '姚仰光', '接送小孩不安排1，2节'),
(21, '', '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '', '', ''),
(21, '12034', '2015', '软件工程', '159', ' 离散数学', '  学科必修', '4', '64', '', '0', '1-16', '陈建利', '大班上课不分班，课程陈建利与朱文兴合上'),
(22, '', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '', ''),
(22, '06424', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '游天童', '8个学生'),
(22, '08025', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '詹青青', ''),
(22, '08074', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '邓新国', '11月份出国访问，是否可以带由系里决定'),
(22, '08102', '2015', '软件工程', '159', ' 认知实习', '  实践环节', '0.5', '', '', '', '', '姚仰光', ''),
(23, '', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '', '', ''),
(23, '03171', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '', '王一蕾', '请尽量将我的课排在上午'),
(23, '06018', '2015', '软件工程', '159', ' 算法与数据结构', '  学科必修', '4', '64', '', '16', '1-16', '傅仰耿', '不排周一上下午及周五下午'),
(24, '', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '', '', ''),
(24, '00022', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '2342423', '林锦', '234234234'),
(24, '13066', '2016', '软件工程', '1', ' 高级语言程序设计', '  学科必修', '4', '64', '', '24', '', '陈飞', '上课时间与王灿辉老师一致'),
(25, '', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '', '', ''),
(25, '00022', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '234234234', '林锦', '2342354646545645'),
(25, '001333', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '2-12', '程红举', '和陈昱分成两个班，每周3节'),
(25, '06421', '2016', '软件工程', '1', ' 计算机导论', '  学科必修', '2', '32', '', '0', '正常安排', '陈昱', '请尽量不安排上午12节');

-- --------------------------------------------------------

--
-- 表的结构 `tc_voluntaryinfosetting`
--

CREATE TABLE `tc_voluntaryinfosetting` (
  `vsid` mediumint(8) NOT NULL,
  `workNumber` varchar(10) NOT NULL COMMENT '系负责人工号',
  `department` varchar(50) NOT NULL COMMENT '系负责人所负责的系（与学生的系对应，而不是与导师的系对应）',
  `voluntaryNum` int(11) NOT NULL COMMENT '志愿数',
  `grade` char(4) NOT NULL COMMENT '进行导师选择的年级',
  `issueStart` int(11) NOT NULL COMMENT '导师报选题起始时间（时间戳）',
  `issueEnd` int(11) NOT NULL COMMENT '导师报选题截止时间（时间戳）',
  `firstStart` int(11) NOT NULL COMMENT '学生第一轮填志愿起始时间（时间戳）',
  `firstEnd` int(11) NOT NULL COMMENT '学生第一轮填志愿截止时间（时间戳）',
  `secondStart` int(11) NOT NULL COMMENT '学生第二轮填志愿起始时间（时间戳）',
  `secondEnd` int(11) NOT NULL COMMENT '学生第二轮填志愿截止时间（时间戳）',
  `confirmFirstStart` int(11) NOT NULL COMMENT '导师第一轮选择起始时间（时间戳）',
  `confirmFirstEnd` int(11) NOT NULL COMMENT '导师第一轮选择截止时间（时间戳）',
  `confirmSecondStart` int(11) NOT NULL COMMENT '导师第二轮选择起始时间（时间戳）',
  `confirmSecondEnd` int(11) NOT NULL COMMENT '导师第二轮选择截止时间（时间戳）',
  `totalMax` int(11) NOT NULL DEFAULT '8' COMMENT '导师学生数总上限（自然班+计算机实验班+数学实验班）',
  `totalMin` int(11) NOT NULL DEFAULT '0' COMMENT '导师学生数总上限（自然班+计算机实验班+数学实验班）',
  `defaultNum` int(11) NOT NULL DEFAULT '8' COMMENT '导师默认所带学生数（自然班+计算机实验班+数学实验班）',
  `experialMax` int(11) NOT NULL DEFAULT '5' COMMENT '导师实验班学生数总上限（计算机实验班+数学实验班）'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tc_voluntaryinfosetting`
--

INSERT INTO `tc_voluntaryinfosetting` (`vsid`, `workNumber`, `department`, `voluntaryNum`, `grade`, `issueStart`, `issueEnd`, `firstStart`, `firstEnd`, `secondStart`, `secondEnd`, `confirmFirstStart`, `confirmFirstEnd`, `confirmSecondStart`, `confirmSecondEnd`, `totalMax`, `totalMin`, `defaultNum`, `experialMax`) VALUES
(3, '00001', '', 5, '', 1479398400, 1479484800, 1479571200, 1479657600, 1479916800, 1480003200, 1479744000, 1479830400, 1480089600, 1480176000, 8, 0, 8, 5);

-- --------------------------------------------------------

--
-- 表的结构 `tc_voluntary_2014`
--

CREATE TABLE `tc_voluntary_2014` (
  `vid` mediumint(8) NOT NULL,
  `sid` mediumint(8) NOT NULL COMMENT '学生编号',
  `round` int(11) NOT NULL DEFAULT '1' COMMENT '轮数',
  `wishFirst` varchar(10) DEFAULT NULL COMMENT '第一志愿',
  `firstReject` tinyint(1) NOT NULL DEFAULT '0' COMMENT '第一志愿是否被拒绝（0、未被拒绝 1、被拒绝）',
  `wishSecond` varchar(10) DEFAULT NULL COMMENT '第二志愿',
  `secondReject` tinyint(1) NOT NULL DEFAULT '0' COMMENT '第二志愿是否被拒绝（0、未被拒绝 1、被拒绝）',
  `wishThird` varchar(10) DEFAULT NULL COMMENT '第三志愿',
  `thirdReject` tinyint(1) NOT NULL DEFAULT '0' COMMENT '第三志愿是否被拒绝（0、未被拒绝 1、被拒绝）',
  `wishForth` varchar(10) DEFAULT NULL COMMENT '第四志愿',
  `forthReject` tinyint(1) NOT NULL DEFAULT '0' COMMENT '第四志愿是否被拒绝（0、未被拒绝 1、被拒绝）',
  `wishFifth` varchar(10) DEFAULT NULL COMMENT '第五志愿',
  `fifthReject` tinyint(1) NOT NULL DEFAULT '0' COMMENT '第五志愿是否被拒绝（0、未被拒绝 1、被拒绝）'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tc_voluntary_2014`
--

INSERT INTO `tc_voluntary_2014` (`vid`, `sid`, `round`, `wishFirst`, `firstReject`, `wishSecond`, `secondReject`, `wishThird`, `thirdReject`, `wishForth`, `forthReject`, `wishFifth`, `fifthReject`) VALUES
(1, 1, 1, '03015', 0, '03171', 0, '04025', 0, '04020', 0, '03015', 0),
(3, 3, 1, '03111', 0, '96070', 0, '04010', 0, '96070', 0, '02025', 0),
(4, 4, 1, '97144', 0, '04018', 0, '03076', 0, '04010', 0, '04017', 0),
(5, 5, 1, '03010', 0, '04010', 0, '03171', 0, '04010', 0, '03074', 0),
(6, 6, 1, '03112', 0, '12005', 0, '05023', 0, '97144', 0, '01007', 0),
(7, 7, 1, '03171', 0, '03171', 0, '04010', 0, '02025', 0, '96031', 0),
(8, 8, 1, '02025', 0, '03015', 0, '03154', 0, '96031', 0, '03154', 0),
(9, 9, 1, '01007', 0, '04022', 0, '03074', 0, '02125', 0, '03009', 0),
(10, 10, 1, '03010', 0, '01100', 0, '03016', 0, '02128', 0, '03032', 0),
(11, 11, 1, '03058', 0, '00022', 0, '03073', 0, '04022', 0, '00022', 0),
(12, 12, 1, '03096', 0, '02089', 0, '04017', 0, '03073', 0, '01100', 0),
(13, 13, 1, '04018', 0, '04027', 0, '03015', 0, '01007', 0, '03032', 0),
(14, 14, 1, '03048', 0, '03016', 0, '03010', 0, '04019', 0, '02112', 0),
(15, 15, 1, '96031', 0, '03058', 0, '04027', 0, '03014', 0, '04025', 0),
(16, 16, 1, '03048', 0, '03003', 0, '03111', 0, '03052', 0, '03154', 0),
(17, 17, 1, '02103', 0, '02108', 0, '03112', 0, '02089', 0, '01029', 0),
(18, 18, 1, '04021', 0, '03171', 0, '03014', 0, '02089', 0, '03171', 0),
(19, 19, 1, '03061', 0, '02117', 0, '82058', 0, '03084', 0, '03030', 0),
(20, 20, 1, '02125', 0, '03073', 0, '03135', 0, '02117', 0, '03032', 0),
(21, 21, 1, '03073', 0, '03112', 0, '03009', 0, '02103', 0, '01007', 0),
(22, 22, 1, '04018', 0, '03073', 0, '03061', 0, '03135', 0, '04017', 0),
(23, 23, 1, '02108', 0, '04022', 0, '03052', 0, '04021', 0, '02089', 0),
(24, 24, 1, '02103', 0, '01007', 0, '03154', 0, '04019', 0, '97144', 0),
(25, 25, 1, '03073', 0, '03074', 0, '04027', 0, '02117', 0, '03052', 0),
(26, 26, 1, '02025', 0, '04021', 0, '03015', 0, '00001', 0, '03171', 0),
(27, 27, 1, '03032', 0, '03016', 0, '03154', 0, '82058', 0, '01009', 0),
(28, 28, 1, '04018', 0, '03096', 0, '01007', 0, '03084', 0, '03032', 0),
(29, 29, 1, '03015', 0, '04018', 0, '02128', 0, '05023', 0, '01029', 0),
(30, 30, 1, '03003', 0, '01007', 0, '01009', 0, '03015', 0, '03030', 0),
(31, 31, 1, '02112', 0, '03058', 0, '02125', 0, '02125', 0, '03111', 0),
(32, 32, 1, '01017', 0, '03016', 0, '03096', 0, '03096', 0, '03014', 0),
(33, 33, 1, '04022', 0, '03112', 0, '00022', 0, '02117', 0, '02103', 0),
(34, 34, 1, '01029', 0, '02108', 0, '02108', 0, '03074', 0, '02108', 0),
(35, 35, 1, '00001', 0, '02117', 0, '03058', 0, '03135', 0, '04018', 0),
(36, 36, 1, '04020', 0, '02025', 0, '03161', 0, '03009', 0, '04025', 0),
(37, 37, 1, '01009', 0, '00022', 0, '01004', 0, '04027', 0, '03016', 0),
(38, 38, 1, '04025', 0, '04010', 0, '04022', 0, '03161', 0, '82058', 0),
(39, 39, 1, '04018', 0, '02108', 0, '01007', 0, '03048', 0, '96070', 0),
(40, 40, 1, '96031', 0, '01009', 0, '02025', 0, '03171', 0, '03073', 0),
(41, 41, 1, '04025', 0, '02117', 0, '04020', 0, '12005', 0, '97144', 0),
(42, 42, 1, '03030', 0, '03096', 0, '03084', 0, '03074', 0, '96031', 0),
(43, 43, 1, '96070', 0, '03061', 0, '02025', 0, '03061', 0, '02112', 0),
(44, 44, 1, '01100', 0, '05023', 0, '03009', 0, '02112', 0, '03048', 0),
(45, 45, 1, '03010', 0, '01100', 0, '02128', 0, '82058', 0, '03112', 0),
(46, 46, 1, '02025', 0, '03003', 0, '03073', 0, '03009', 0, '01009', 0),
(47, 47, 1, '03084', 0, '03171', 0, '03073', 0, '02025', 0, '97144', 0),
(48, 48, 1, '03052', 0, '04022', 0, '01007', 0, '04022', 0, '02124', 0),
(49, 49, 1, '03009', 0, '01007', 0, '97144', 0, '00022', 0, '03096', 0),
(50, 50, 1, '04025', 0, '04019', 0, '02125', 0, '04018', 0, '03154', 0),
(51, 51, 1, '01009', 0, '96031', 0, '03016', 0, '02112', 0, '02108', 0),
(52, 52, 1, '03073', 0, '03096', 0, '03171', 0, '00022', 0, '97144', 0),
(53, 53, 1, '96070', 0, '04027', 0, '04022', 0, '04019', 0, '03084', 0),
(54, 54, 1, '82058', 0, '03073', 0, '05023', 0, '01007', 0, '03084', 0),
(55, 55, 1, '03030', 0, '04019', 0, '03052', 0, '01007', 0, '03015', 0),
(56, 56, 1, '03030', 0, '03030', 0, '01017', 0, '04010', 0, '02125', 0),
(57, 57, 1, '00001', 0, '05023', 0, '03003', 0, '03003', 0, '04021', 0),
(58, 58, 1, '02089', 0, '03058', 0, '00001', 0, '96031', 0, '02025', 0),
(59, 59, 1, '01017', 0, '03009', 0, '97144', 0, '03074', 0, '03048', 0),
(60, 60, 1, '04010', 0, '00022', 0, '03084', 0, '03048', 0, '02108', 0),
(61, 61, 1, '03135', 0, '96070', 0, '03016', 0, '02108', 0, '00001', 0),
(62, 62, 1, '96031', 0, '02025', 0, '03161', 0, '03111', 0, '02108', 0),
(63, 63, 1, '01004', 0, '02089', 0, '03111', 0, '97144', 0, '82058', 0),
(64, 64, 1, '03076', 0, '03096', 0, '97144', 0, '02025', 0, '03014', 0),
(65, 65, 1, '03135', 0, '03048', 0, '03074', 0, '03073', 0, '03014', 0),
(66, 66, 1, '01017', 0, '03052', 0, '03074', 0, '04021', 0, '01029', 0),
(67, 67, 1, '04017', 0, '03015', 0, '03112', 0, '02117', 0, '04017', 0),
(68, 68, 1, '03058', 0, '05023', 0, '03161', 0, '02128', 0, '04022', 0),
(69, 69, 1, '02108', 0, '02103', 0, '04010', 0, '12005', 0, '03111', 0),
(70, 70, 1, '96031', 0, '12005', 0, '03154', 0, '04018', 0, '03161', 0);

-- --------------------------------------------------------

--
-- 表的结构 `user_department_head`
--

CREATE TABLE `user_department_head` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL COMMENT '工号',
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '密码',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '姓名',
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL COMMENT '性别',
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL COMMENT '生日',
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '系别',
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL COMMENT '联系方式',
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL COMMENT '邮箱',
  `avator` varchar(200) CHARACTER SET utf8 DEFAULT NULL COMMENT '头像'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_department_head`
--

INSERT INTO `user_department_head` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`, `avator`) VALUES
('00001', '00001', '陈齐民', '男', '1996.01.10', '信息安全与网络工程系', '15659754690', '282129796@qq.com', '/uploads/departmentHead\\20161208\\d7cd01d78bdfcf5a225b3f43d81d8d39.jpg'),
('06033', '06033', '张浩', '', '', '计算机科学与技术', '13905050606', '', NULL),
('06099', '06099', '魏凤英', '', '', '', '', '', NULL),
('07106', '07106', '夏又生', '男', '195702', '', '', '', NULL),
('09070', '09070', '侯建峰', '男', '19810110', '', '', '', NULL),
('10044', '135093', '张栋', '男', '', '', '', '', NULL),
('11061', '11061', '郭龙坤', '', '', '', '', '', NULL),
('11065', '11065', '郑相涵', '', '', '', '', '', NULL),
('12095', '12095', '于元隆', '男', '', '', '', '', NULL),
('83040', '83040', '陈晓星', '女', '196312', '', '', '', NULL),
('89036', '87840441', '朱玉灿', '男', '196304', '数学系', '13950490098', 'zhuyucan@fzu.edu.cn', NULL),
('90010', '90010', ' 王灿辉', '', '', '', '', '', NULL),
('92034', '92034', '陈晓云', '女', '197002', '信息与计算科学系', '', '', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `user_student_2014`
--

CREATE TABLE `user_student_2014` (
  `sid` mediumint(8) NOT NULL,
  `serialNum` varchar(9) NOT NULL COMMENT '学号',
  `password` char(20) NOT NULL COMMENT '密码',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `gender` char(5) NOT NULL COMMENT '性别（女、男）',
  `gpa` double NOT NULL COMMENT '绩点',
  `college` varchar(30) NOT NULL DEFAULT '0' COMMENT '学院',
  `department` varchar(30) NOT NULL DEFAULT '0' COMMENT '系别（学生7个系别，与导师对应的5个系别+计算机实验班+数学实验班）',
  `field` varchar(30) NOT NULL DEFAULT '0' COMMENT '方向',
  `skill` mediumtext COMMENT '技能及经历',
  `avator` varchar(200) DEFAULT NULL COMMENT '头像url',
  `telephone` char(11) DEFAULT NULL COMMENT '电话',
  `email` varchar(30) DEFAULT NULL COMMENT '邮箱',
  `rank` varchar(10) NOT NULL COMMENT '排名',
  `chosen` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否中选（0、为中选 1、中选）',
  `grade` char(4) NOT NULL COMMENT '年级'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_student_2014`
--

INSERT INTO `user_student_2014` (`sid`, `serialNum`, `password`, `name`, `gender`, `gpa`, `college`, `department`, `field`, `skill`, `avator`, `telephone`, `email`, `rank`, `chosen`, `grade`) VALUES
(1, '031402203', '031402203', '陈齐民', '男', 3.26, '数学与计算机科学学院', '信息安全与网络工程系', '系统结构', '熟悉PHP开发，喜欢大数据挖掘方面的研究，热爱体育运动，测试会不会出错', '/uploads/student\\20161207\\474704bd6ec6947f2b73d924805f23c0.jpg', '15659754690', '282129796@qq.com', '8/32', 0, ''),
(2, '031402304', '031402304', '陈燊', '男', 3.47, '数学与计算机科学学院', '信息安全与网络工程系', '计算机科学与技术', NULL, NULL, NULL, NULL, '1/72', 1, ''),
(3, '031402209', '031402209', '黄伟炜', '男', 4.5, '数学与计算机科学学院', '信息安全与网络工程系', '计算机应用', NULL, NULL, NULL, NULL, '1/186', 0, ''),
(4, '031402202', '031402202', '陈家苇', '男', 3.4, '数学与计算机科学学院', '信息安全与网络工程系', '网络工程', NULL, NULL, NULL, NULL, '1/32', 0, ''),
(5, '031402214', '031402214', '李旭升', '男', 3.56, '数学与计算机科学学院', '信息安全与网络工程系', '计算机实验班', NULL, NULL, NULL, NULL, '2/72', 0, ''),
(6, '031402216', '031402216', '哈哈哈', '男', 3.75, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '4/32', 0, ''),
(7, '031402543', '031402543', '你好', '女', 3.88, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '3/75', 0, ''),
(8, '031402345', '031402345', '你也好', '男', 2.67, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '8/32', 0, ''),
(9, '031402222', '031402222', '改需求', '男', 4.55, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '1/22', 0, ''),
(10, '031402398', '031402398', '不改不改', '女', 2.22, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '4/55', 0, ''),
(11, '031402204', '031402204', '辣齐王', '男', 4, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '2/74', 0, ''),
(12, '031402119', '031402119', '国云林', '男', 3.55, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '16/47', 0, ''),
(13, '031402119', '031402119', '燊民辣', '男', 4.25, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '7/48', 0, ''),
(14, '031402235', '031402235', '奇杨个', '男', 4.45, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '10/59', 0, ''),
(15, '031402489', '031402489', '辣许许', '男', 3.6, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '13/40', 0, ''),
(16, '031402601', '031402601', '炜羊放', '男', 4.1, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '19/64', 0, ''),
(17, '031402229', '031402229', '奇放玲', '男', 4.17, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '29/77', 0, ''),
(18, '031402166', '031402166', '婷富颖', '男', 4.24, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '15/79', 0, ''),
(19, '031402183', '031402183', '燊鸡婷', '男', 4.32, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '20/44', 0, ''),
(20, '031402312', '031402312', '陈展涛', '男', 4.36, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '14/59', 0, ''),
(21, '031402298', '031402298', '直胡个', '男', 4.12, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '6/50', 0, ''),
(22, '031402199', '031402199', '婷陈给', '男', 3.76, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '17/60', 0, ''),
(23, '031402415', '031402415', '王直心', '男', 3.05, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '11/66', 0, ''),
(24, '031402565', '031402565', '豪直齐', '男', 3.33, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '4/64', 0, ''),
(25, '031402408', '031402408', '给颖放', '男', 4.21, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '9/75', 0, ''),
(26, '031402456', '031402456', '颖阳个', '男', 3.92, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '16/73', 0, ''),
(27, '031402278', '031402278', '羊胡去', '男', 4.24, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '2/78', 0, ''),
(28, '031402442', '031402442', '燊颖蔡', '男', 3.31, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '23/40', 0, ''),
(29, '031402184', '031402184', '林民富', '男', 3.57, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '12/57', 0, ''),
(30, '031402598', '031402598', '燊瑞昊', '男', 3.07, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '4/56', 0, ''),
(31, '031402282', '031402282', '杨蔡胡', '男', 3.39, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '14/53', 0, ''),
(32, '031402405', '031402405', '富伟鸡', '男', 3.99, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '19/73', 0, ''),
(33, '031402410', '031402410', '家鸡鸡', '男', 4.11, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '25/47', 0, ''),
(34, '031402367', '031402367', '昊王去', '男', 3.1, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '18/61', 0, ''),
(35, '031402514', '031402514', '羊昊燊', '男', 3.89, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '23/41', 0, ''),
(36, '031402445', '031402445', '个许通', '男', 4.23, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '29/52', 0, ''),
(37, '031402340', '031402340', '蔡许放', '男', 3.17, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '25/57', 0, ''),
(38, '031402141', '031402141', '才燊涛', '男', 4.4, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '5/56', 0, ''),
(39, '031402141', '031402141', '家羊齐', '男', 3.11, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '7/54', 0, ''),
(40, '031402513', '031402513', '燊放涛', '男', 4.42, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '2/67', 0, ''),
(41, '031402540', '031402540', '王许奇', '男', 4.15, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '19/54', 0, ''),
(42, '031402154', '031402154', '羊辣国', '男', 4.32, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '3/53', 0, ''),
(43, '031402219', '031402219', '林涛炜', '男', 4.44, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '5/60', 0, ''),
(44, '031402132', '031402132', '颖玲展', '男', 3.41, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '5/47', 0, ''),
(45, '031402381', '031402381', '胡昊辣', '男', 4.41, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '14/50', 0, ''),
(46, '031402221', '031402221', '林个家', '男', 3.23, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '20/60', 0, ''),
(47, '031402122', '031402122', '郑伟昊', '男', 3.73, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '23/69', 0, ''),
(48, '031402446', '031402446', '放瑞直', '男', 3.09, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '15/43', 0, ''),
(49, '031402200', '031402200', '阳许阳', '男', 4.33, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '19/55', 0, ''),
(50, '031402586', '031402586', '放通陈', '男', 3.03, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '3/48', 0, ''),
(51, '031402579', '031402579', '黄豪许', '男', 4.38, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '8/51', 0, ''),
(52, '031402153', '031402153', '黄直燊', '男', 3.86, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '10/66', 0, ''),
(53, '031402507', '031402507', '阳奇富', '男', 4.29, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '10/79', 0, ''),
(54, '031402133', '031402133', '羊阳瑞', '男', 4.1, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '19/68', 0, ''),
(55, '031402562', '031402562', '伟云展', '男', 3.74, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '30/57', 0, ''),
(56, '031402427', '031402427', '炜富家', '男', 3.05, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '27/44', 0, ''),
(57, '031402303', '031402303', '杨国辣', '男', 3.15, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '26/49', 0, ''),
(58, '031402161', '031402161', '杨陈炜', '男', 3.78, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '16/47', 0, ''),
(59, '031402544', '031402544', '瑞燊玲', '男', 3.7, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '4/56', 0, ''),
(60, '031402504', '031402504', '杨云云', '男', 4.07, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '14/69', 0, ''),
(61, '031402458', '031402458', '通燊颖', '男', 4.31, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '13/59', 0, ''),
(62, '031402474', '031402474', '黄蔡蔡', '男', 3.97, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '2/79', 0, ''),
(63, '031402257', '031402257', '心伟阳', '男', 3.13, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '28/59', 0, ''),
(64, '031402503', '031402503', '个家王', '男', 4.28, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '8/69', 0, ''),
(65, '031402310', '031402310', '民玲炜', '男', 3.61, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '9/78', 0, ''),
(66, '031402177', '031402177', '豪炜民', '男', 3.53, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '14/50', 0, ''),
(67, '031402515', '031402515', '展炜郑', '男', 3.92, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '20/76', 0, ''),
(68, '031402554', '031402554', '胡燊菜', '男', 4.05, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '17/55', 0, ''),
(69, '031402546', '031402546', '婷展杨', '男', 4.47, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '22/75', 0, ''),
(70, '031402506', '031402506', '瑞心给', '男', 4.36, '数学与计算机科学学院', '信息安全与网络工程系', '0', NULL, NULL, NULL, NULL, '29/53', 0, '');

-- --------------------------------------------------------

--
-- 表的结构 `user_teacher`
--

CREATE TABLE `user_teacher` (
  `workNumber` varchar(10) NOT NULL COMMENT '工号',
  `password` varchar(20) NOT NULL COMMENT '密码',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `sex` varchar(5) NOT NULL COMMENT '性别',
  `birthday` varchar(10) NOT NULL COMMENT '生日',
  `department` varchar(20) NOT NULL COMMENT '系别（导师5个系别）',
  `telephone` varchar(11) NOT NULL COMMENT '联系方式',
  `email` varchar(30) NOT NULL COMMENT '邮箱',
  `isExperial` tinyint(1) NOT NULL DEFAULT '0' COMMENT '导师是否可以带实验班学生（0、自然班 1、自然班+计算机实验班 2、自然班+数学实验班 3、自然班+计算机实验班+数学实验班）',
  `description` mediumtext COMMENT '个人简介',
  `avator` varchar(200) DEFAULT NULL COMMENT '头像url',
  `title` varchar(20) DEFAULT NULL COMMENT '职称'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_teacher`
--

INSERT INTO `user_teacher` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`, `isExperial`, `description`, `avator`, `title`) VALUES
('00001', '00001', '陈齐民', '男', '1996.01.10', '信息安全与网络工程系', '15659754690', '282129796@qq.com', 0, '测试', '/uploads/teacher\\20161207\\f29313fb6d36c1e9b06a262c09e1337a.jpg', '博士'),
('00022', '00022', '林锦', '女', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01004', '01004', '蒋秀凤', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01007', '01007', '曾有栋', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01009', '01009', '潘梅英', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01017', '01017', '任立英', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01029', '01029', '陈神灿', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('01100', '01100', '刘蓉', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02005', 'chenlz', '孙及园', '女', '', '信息安全与网络工程', '13328212191', 'Sunjy@fzu.edu.cn', 0, NULL, NULL, NULL),
('02025', '02025', '史正平', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02089', '02089', '陈凤德', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02103', '02103', '朱丹红', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02108', '02108', '范更华', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02112', 'fzu132778', '陈明志', '男', '', '信息安全与网络工程系', '13860664189', 'mchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('02117', '02117', '黄长洵', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('02124', '@350002', '王秀', '', '', '信息安全与网络工程系', '18960875695', 'wangx@fzu.edu.cn', 0, NULL, NULL, NULL),
('02125', 'myglobus', '吴小竹', '男', '', '信息安全与网络工程系', '13559347126', 'wxz@fzu.edu.cn', 0, NULL, NULL, NULL),
('02128', '02128', '吴文妹', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03003', '0300303', '程烨', '男', '', '信息安全与网络工程系', '13805085181', 'chengye@fzu.edu.cn', 0, NULL, NULL, NULL),
('03009', 'newstar123', '董晨', '女', '', '信息安全与网络工程系', '13960780316', 'dongchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('03010', '03010', '黄昉菀', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03014', '03014', '邹长武', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03015', '03015', '吕书龙', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03016', '03016', '刘文丽', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03030', '7893296bk', '蒋启强', '男', '', '信息安全与网络工程系', '13159429291', 'jqq@fzu.edu.cn', 0, NULL, NULL, NULL),
('03032', '750927', '孙岚', '女', '', '信息安全与网络工程系', '15605919998', 'lsun@fzu.edu.cn', 0, NULL, NULL, NULL),
('03048', '03048', '徐源', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03052', '03052', '何凤英', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03058', '03058', '尚艳艳', '女', '', '信息安全与网络工程系', '13067376996', 'yyshang@fzu.edu.cn', 0, NULL, NULL, NULL),
('03061', '03061', '柳宏珠', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03073', '03073', '周燕', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03074', '03074', '谢惠琴', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03076', '03076', '刘剑萍', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03084', '03084', '单红', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03096', '03096', '陈晓锋', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03111', '03111', '黄陈思', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03112', '900119', '赵彦敏', '女', '', '信息安全与网络工程系', '13328223393', 'zhaoyanmin@fzu.edu.cn', 0, NULL, NULL, NULL),
('03135', '03135', '颜丰', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('03154', '970717ch', '陈晖', '男', '', '信息安全与网络工程系', '13599089065', 'chenhui@fzu.edu.cn', 0, NULL, NULL, NULL),
('03161', 'lqy850621', '林秋月', '女', '', '信息安全与网络工程系', '18050280020', '18050280020@189.cn', 0, NULL, NULL, NULL),
('03171', '253180', '王一蕾', '女', '', '信息安全与网络工程系', '18059082372', 'yilei@fzu.edu.cn', 0, NULL, NULL, NULL),
('04010', '04010', '向小娟', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04017', '04017', '夏永辉', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04018', '04018', '许君雁', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04019', '61665688', '吴英杰', '男', '', '信息安全与网络工程系', '18960929231', 'yjwu@fzu.edu.cn', 0, NULL, NULL, NULL),
('04020', '04020', '钮永莉', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04021', 'share3pw', '陈欢', '男', '', '信息安全与网络工程系', '13338289771', 'hchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('04022', '04022', '邹长忠', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04025', '04025', '赵雷', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04027', '04027', '张忠获', '', '', '信息安全与网络工程系', '', '', 0, NULL, NULL, NULL),
('04029', '04029', '孙德献', '', '', '', '', '', 0, NULL, NULL, NULL),
('04034', '04034', '郭洋', '', '', '', '', '', 0, NULL, NULL, NULL),
('04047', '04047', '王鸿', '', '', '', '', '', 0, NULL, NULL, NULL),
('04048', '04048', '陈丽娟', '', '', '', '', '', 0, NULL, NULL, NULL),
('04059', 'therica1231ycy', '余春艳', '女', '', '计算机科学系', '18606999031', 'therica@fzu.edu.cn', 0, NULL, NULL, NULL),
('04060', '04060', '何统军', '', '', '', '', '', 0, NULL, NULL, NULL),
('04070', '04070', '林美丽', '', '', '', '', '', 0, NULL, NULL, NULL),
('04071', '04071', '陈锦松', '', '', '', '', '', 0, NULL, NULL, NULL),
('04073', 'WYBrongxin2068x', '吴运兵', '男', '', '计算机系', '13859028940', 'wyb5820@fzu.edu.cn', 0, NULL, NULL, NULL),
('04074', '04074', '余小燕', '', '', '', '', '', 0, NULL, NULL, NULL),
('04096', '04096', '黄慧敏', '', '', '', '', '', 0, NULL, NULL, NULL),
('04097', '04097', '林雪如', '', '', '', '', '', 0, NULL, NULL, NULL),
('04098', '04098', '熊贤祝', '', '', '', '', '', 0, NULL, NULL, NULL),
('04116', '04116', '黄寿颖', '', '', '', '', '', 0, NULL, NULL, NULL),
('04117', '04117', '孙凤刚', '', '', '', '', '', 0, NULL, NULL, NULL),
('04136', '04136', '庄颖慧', '', '', '', '', '', 0, NULL, NULL, NULL),
('04165', '04165', '王海荣', '', '', '', '', '', 0, NULL, NULL, NULL),
('04166', 'Hezhenfeng', '何振峰', '男', '', '数学与计算机学院计算机科学系', '13635249590', 'hezhenfeng@fzu.edu.cn', 0, NULL, NULL, NULL),
('04173', '04173', '刘文安', '', '', '', '', '', 0, NULL, NULL, NULL),
('04174', '04174', '聂建英', '', '', '', '', '', 0, NULL, NULL, NULL),
('04402', '04402', '杨大庆', '', '', '', '', '', 0, NULL, NULL, NULL),
('05008', '05008', '程航', '', '', '', '', '', 0, NULL, NULL, NULL),
('05009', '05009', '张艳红', '', '', '', '', '', 0, NULL, NULL, NULL),
('05010', '05010', '周勇', '', '', '', '', '', 0, NULL, NULL, NULL),
('05013', '350002', '郭昆', '男', '', '计算机科学系', '13799425421', 'gukn123@163.com', 0, NULL, NULL, NULL),
('05017', '05017', '袁裕泽', '', '', '', '', '', 0, NULL, NULL, NULL),
('05023', 'zspwait', '钟尚平', '男', '', '信息安全与网络工程系', '13860610089', 'spzhong@fzu.edu.cn', 0, NULL, NULL, NULL),
('05024', '05024', '薛美玉', '', '', '', '', '', 0, NULL, NULL, NULL),
('05042', '05042', '林华', '', '', '', '', '', 0, NULL, NULL, NULL),
('05095', '05095', '王平', '', '', '', '', '', 0, NULL, NULL, NULL),
('05096', '05096', '林丽琼', '', '', '', '', '', 0, NULL, NULL, NULL),
('05100', '05100', '黄利航', '', '', '', '', '', 0, NULL, NULL, NULL),
('05160', '05160', '施齐焉', '', '', '', '', '', 0, NULL, NULL, NULL),
('05407', '05407', '鲍学文', '', '', '', '', '', 0, NULL, NULL, NULL),
('06018', '350116', '傅仰耿', '男', '', '计算机系', '18065162651', 'ygfu@qq.com', 0, NULL, NULL, NULL),
('06033', '06033', '张浩', '男', '', '信息安全与网络工程', '13720825396', 'zhanghao@fzu.edu.cn', 0, NULL, NULL, NULL),
('06404', 'c623511', '陈家瑞', '男', '', '软件工程系', '13960767844', 'jrchen@126.com', 0, NULL, NULL, NULL),
('06412', '06412', '何秀萍', '', '', '', '', '', 0, NULL, NULL, NULL),
('06418', '1qazse4', '江兰帆', '男', '', '软件工程系', '15959089997', 'chenyu_21cn@sina.com', 0, NULL, NULL, NULL),
('06419', 'lois1982', '张舒', '女', '', '软件工程系', '15960198219', '65533967@qq.com', 0, NULL, NULL, NULL),
('06420', '809300', '陈嘉', '女', '', '软件工程', '13645002517', 'successjia@126.com', 0, NULL, NULL, NULL),
('06421', 'qwert', '陈昱', '男', '', '软件工程系', '13959198761', 'chenyu_21cn@qq.com', 0, NULL, NULL, NULL),
('06424', 'tonghuiying', '游天童', '男', '', '软件工程系', '13110875460', 'tiantong.you@fzu.edu.cn', 0, NULL, NULL, NULL),
('07026', '07026', '曾勋勋', '', '', '', '', '', 0, NULL, NULL, NULL),
('07027', '07027', '李忠', '', '', '', '', '', 0, NULL, NULL, NULL),
('07029', '07029', '宋凌', '', '', '', '', '', 0, NULL, NULL, NULL),
('07042', 'chj7524', '程红举', '男', '', '软件工程系', '13599099519', 'cscheng@fzu.edu.cn', 0, NULL, NULL, NULL),
('07068', '07068', '林然', '', '', '', '', '', 0, NULL, NULL, NULL),
('07106', 'xia6289186', '夏又生', '男', '', '软件工程系', '15880038582', 'ysxia@fzu.edu.cn', 0, NULL, NULL, NULL),
('07126', '1601984', '陈羽中', '男', '', '网络工程', '18965083597', 'yzchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('08025', '2888003', '詹青青', '女', '', '软件工程系', '13705002746', 'zqqing_0@aliyun.com', 0, NULL, NULL, NULL),
('08073', '08073', '何梦昕', '', '', '', '', '', 0, NULL, NULL, NULL),
('08074', 'dengwei', '邓新国', '男', '', '软件工程系', '15606941581', '309568144@qq.com', 0, NULL, NULL, NULL),
('08076', 'chenbo0212', '陈勃', '男', '', '数学与计算机科学学院-计算机系', '13959192812', 'bo.chen@fzu.edu.cn', 0, NULL, NULL, NULL),
('08083', '08083', '黄新通', '', '', '', '', '', 0, NULL, NULL, NULL),
('08102', 'y990441', '姚仰光', '男', '', '软件工程', '15080020794', 'yyg990441@163.com', 0, NULL, NULL, NULL),
('08112', '08112', '叶从峰', '', '', '', '', '', 0, NULL, NULL, NULL),
('08124', '08124', '龚艺源', '', '', '', '', '', 0, NULL, NULL, NULL),
('09008', '09008', '廖祥文', '', '', '', '', '', 0, NULL, NULL, NULL),
('09031', '09031', '翁谦', '', '', '', '', '', 0, NULL, NULL, NULL),
('09046', '09046', '傅明建', '', '', '', '', '', 0, NULL, NULL, NULL),
('09047', '09047', '吴伶', '', '', '', '', '', 0, NULL, NULL, NULL),
('09070', '09070', '侯建锋', '', '', '', '', '', 0, NULL, NULL, NULL),
('09082', '09082', '林启忠', '', '', '', '', '', 0, NULL, NULL, NULL),
('10011', '090803pztt', '林嘉雯', '女', '', '数学与计算机科学学院网络工程与信息安全系', '13509393165', 'ljw@fzu.edu.cn', 0, NULL, NULL, NULL),
('10012', '10012', '陈振', '', '', '', '', '', 0, NULL, NULL, NULL),
('10015', '10015', '刘月', '', '', '', '', '', 0, NULL, NULL, NULL),
('10043', '10043', '唐丽丹', '', '', '', '', '', 0, NULL, NULL, NULL),
('10044', '10044', '张栋', '男', '', '计算机科学系', '18650058766', '42273885@qq.com', 0, NULL, NULL, NULL),
('10047', '10047', '沈明', '', '', '', '', '', 0, NULL, NULL, NULL),
('10051', '10051', '陈容', '', '', '', '', '', 0, NULL, NULL, NULL),
('10057', '10057', '彭拯', '', '', '', '', '', 0, NULL, NULL, NULL),
('10080', '10080', '赖降周', '', '', '', '', '', 0, NULL, NULL, NULL),
('10096', '10096', '蔡英灵', '', '', '', '', '', 0, NULL, NULL, NULL),
('10097', '10097', '鲍星华', '', '', '', '', '', 0, NULL, NULL, NULL),
('11013', '1012@fzU', '於志勇', '男', '', '软件工程', '13696855186', 'yuzhiyong@fzu.edu.cn', 0, NULL, NULL, NULL),
('11037', '22886616', '陈开志', '男', '', '网络工程与信息安全', '13950237801', 'ckz@fzu.edu.cn', 0, NULL, NULL, NULL),
('11046', '11046', '肖祥春', '', '', '', '', '', 0, NULL, NULL, NULL),
('11048', 'xiaoke', '柯逍', '男', '', '计算机科学', '15080019117', 'kex@fzu.edu.cn', 0, NULL, NULL, NULL),
('11061', 'guolongkun@fzubk', '郭龙坤', '男', '', '计算机科学系', '13635272259', 'lkguo@fzu.edu.cn', 0, NULL, NULL, NULL),
('11065', 'owqljb4A', '郑相涵', '男', '', '网络工程与信息安全', '15080025921', 'xianghan.zheng@fzu.edu.cn', 0, NULL, NULL, NULL),
('11071', '11071', '苏延辉', '', '', '', '', '', 0, NULL, NULL, NULL),
('11098', '11098', '李娴娟', '', '', '', '', '', 0, NULL, NULL, NULL),
('11106', '11106', '林峰根', '', '', '', '', '', 0, NULL, NULL, NULL),
('12005', '39213921', '杨旸', '女', '', '信息安全与网络工程系', '18050283921', 'yang.yang.research@gmail.com', 0, NULL, NULL, NULL),
('12026', '12026', '刘若凡', '', '', '', '', '', 0, NULL, NULL, NULL),
('12034', 'chenjianli', '陈建利', '男', '', '软件工程系', '18906930649', 'jlchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('12064', '12064', '洪艳梅', '', '', '', '', '', 0, NULL, NULL, NULL),
('12065', '12065', '刘清海', '', '', '', '', '', 0, NULL, NULL, NULL),
('12085', '12085', '江飞', '', '', '', '', '', 0, NULL, NULL, NULL),
('12095', '12095', '于元隆', '', '', '', '', '', 0, NULL, NULL, NULL),
('12098', '12098', '牛玉贞', '', '', '', '', '', 0, NULL, NULL, NULL),
('123321', '123321', '李XX', '', '', '', '', '', 0, NULL, NULL, NULL),
('123456', '123456', '小李', '', '', '', '', '', 0, NULL, NULL, NULL),
('13027', '13027', '苏友峰', '', '', '', '', '', 0, NULL, NULL, NULL),
('13036', '13036', '张卉', '', '', '', '', '', 0, NULL, NULL, NULL),
('13037', '13037', '陈清花', '', '', '', '', '', 0, NULL, NULL, NULL),
('13046', '19851102', '陈星', '男', '', '软件工程', '18650349461', 'chenxing@fzu.edu.cn', 0, NULL, NULL, NULL),
('13051', '13051', '杨硕', '', '', '', '', '', 0, NULL, NULL, NULL),
('13066', '13066', '陈飞', '男', '', '软件工程系', '15060129392', 'chenfei314@fzu.edu.cn', 0, NULL, NULL, NULL),
('14029', '14029', '张文钊', '', '', '', '', '', 0, NULL, NULL, NULL),
('14035', '14035', '杨霖', '', '', '', '', '', 0, NULL, NULL, NULL),
('14048', '14048', '王伟伟', '', '', '', '', '', 0, NULL, NULL, NULL),
('14058', '14058', '王靖岳', '', '', '', '', '', 0, NULL, NULL, NULL),
('14059', '14059', '洪倩颖', '', '', '', '', '', 0, NULL, NULL, NULL),
('15005', '15005', '邹剑', '', '', '', '', '', 0, NULL, NULL, NULL),
('15018', 'sjxy0312', '陈德旺', '男', '', ' 信息安全与网络工程系', '13328265088', 'dwchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('15028', 'wenxi112', '刘文犀', '男', '', '计算机科学系', '13515018672', 'wenxi.liu@hotmail.com', 0, NULL, NULL, NULL),
('15029', '15029', '王佳', '', '', '', '', '', 0, NULL, NULL, NULL),
('15038', '15038', '刘耿耿', '', '', '', '', '', 0, NULL, NULL, NULL),
('15041', '13655963', '苏雅茹', '女', '', '计算机科学系', '18606020083', 'yarusu@fzu.edu.cn', 0, NULL, NULL, NULL),
('15079', '15079', '林敏', '', '', '', '', '', 0, NULL, NULL, NULL),
('15081', '15081', '林晶', '', '', '', '', '', 0, NULL, NULL, NULL),
('15082', '15082', '陆泽萍', '', '', '', '', '', 0, NULL, NULL, NULL),
('15095', '15095', '张春阳', '', '', '', '', '', 0, NULL, NULL, NULL),
('16005', '16005', '沈志荣', '', '', '', '', '', 0, NULL, NULL, NULL),
('16014', '16014', '谭晓兰', '', '', '', '', '', 0, NULL, NULL, NULL),
('22', '22', '22', '', '', '', '', '', 0, NULL, NULL, NULL),
('78040', '78040', '林柏钢', '', '', '', '', '', 0, NULL, NULL, NULL),
('78054', '78054', '郭朝珍', '', '', '', '', '', 0, NULL, NULL, NULL),
('78082', '78082', '陈铭枢', '', '', '', '', '', 0, NULL, NULL, NULL),
('80020', '80020', '徐荣聪', '', '', '', '', '', 0, NULL, NULL, NULL),
('80035', '80035', '孙建华', '', '', '', '', '', 0, NULL, NULL, NULL),
('80067', '80067', '颜金明', '', '', '', '', '', 0, NULL, NULL, NULL),
('80104', '80104', '林胜利', '', '', '', '', '', 0, NULL, NULL, NULL),
('81063', '81063', '陈京', '', '', '', '', '', 0, NULL, NULL, NULL),
('81072', '81072', '倪良刚', '', '', '', '', '', 0, NULL, NULL, NULL),
('81158', '81158', '陈国维', '', '', '', '', '', 0, NULL, NULL, NULL),
('82009', '82009', '何建农', '', '', '', '', '', 0, NULL, NULL, NULL),
('82010', '82010', '黄建华', '', '', '', '', '', 0, NULL, NULL, NULL),
('82020', '82020', '陈丽珍', '', '', '', '', '', 0, NULL, NULL, NULL),
('82032', '82032', '吴承强', '', '', '', '', '', 0, NULL, NULL, NULL),
('82056', '13075946079', '陈建华', '男', '', '计算机科学系', '13075946079', 'jhchen@fzu.edu.cn', 0, NULL, NULL, NULL),
('82057', '82057', '王晓东', '', '', '', '', '', 0, NULL, NULL, NULL),
('82058', '575757', '郭洪', '男', '', '信息安全与网络工程系', '13859035623', 'gh@fzu.edu.cn', 0, NULL, NULL, NULL),
('82059', '82059', '吴景东', '', '', '', '', '', 0, NULL, NULL, NULL),
('82060', '82060', '林锦贤', '', '', '', '', '', 0, NULL, NULL, NULL),
('82061', '819111', '俞建家', '男', '', '计算机系', '13859033140', 'yjj@fzu.edu.cn', 0, NULL, NULL, NULL),
('82115', '82115', '雷晋明', '', '', '', '', '', 0, NULL, NULL, NULL),
('82135', '82135', '肖赞强', '', '', '', '', '', 0, NULL, NULL, NULL),
('83040', '83040', '陈晓星', '', '', '', '', '', 0, NULL, NULL, NULL),
('83046', 'liu1988', '刘秉瀚', '女', '', '软件工程系', '13950202136', 'lbh@fzu.edu.cn', 0, NULL, NULL, NULL),
('83514', '83514', '陈文清', '', '', '', '', '', 0, NULL, NULL, NULL),
('84051', '84051', '陈德昭', '', '', '', '', '', 0, NULL, NULL, NULL),
('84069', '84069', '叶少珍', '', '', '', '', '', 0, NULL, NULL, NULL),
('85013', '85013', '王林', '', '', '', '', '', 0, NULL, NULL, NULL),
('85034', '123789', '叶东毅', '男', '', '数计学院计算机系', '13509376813', 'yiedy@fzu.edu.cn', 0, NULL, NULL, NULL),
('85040', '85040', '梁飞豹', '', '', '', '', '', 0, NULL, NULL, NULL),
('85059', '85059', '李剑敏', '', '', '', '', '', 0, NULL, NULL, NULL),
('85061', '85061', '王晶海', '', '', '', '', '', 0, NULL, NULL, NULL),
('85073', 'mjyj66589', '林世平', '男', '', '计算机科学系', '18959199939', 'splin@fzu.edu.cn', 0, NULL, NULL, NULL),
('85118', '646893_gauss', '谢伙生', '男', '', '计算机系', '18950358968', 'xiehs@qq.com', 0, NULL, NULL, NULL),
('85138', '85138', '王世俊', '', '', '', '', '', 0, NULL, NULL, NULL),
('86026', '86026', '朱敏琛', '', '', '', '', '', 0, NULL, NULL, NULL),
('86077', '86077', '黄良伟', '', '', '', '', '', 0, NULL, NULL, NULL),
('86078', '86078', '郑德榕', '', '', '', '', '', 0, NULL, NULL, NULL),
('86079', '86079', '江巧洪', '', '', '', '', '', 0, NULL, NULL, NULL),
('86502', '86502', '王红岩', '', '', '', '', '', 0, NULL, NULL, NULL),
('86568', '86568', '林劲', '', '', '', '', '', 0, NULL, NULL, NULL),
('87007', '04213', '陈昭炯', '女', '', '计算机科学系', '13960758961', 'chenzj@fzu.edu.cn', 0, NULL, NULL, NULL),
('87027', '87027', '林发兴', '', '', '', '', '', 0, NULL, NULL, NULL),
('87029', '87029', '杨培鉴', '', '', '', '', '', 0, NULL, NULL, NULL),
('88005', 'bqy1964', '白清源', '男', '', '计算机科学系', '13705942427', '1344565775@qq.com', 0, NULL, NULL, NULL),
('88032', '88032', '王宏健', '', '', '', '', '', 0, NULL, NULL, NULL),
('88064', '8305200', '胡颖', '女', '', '信息安全与网络', '13075946057', 'huying@fzu.edu.cn', 0, NULL, NULL, NULL),
('88888', '88888', '苏大大', '', '', '', '', '', 0, NULL, NULL, NULL),
('89013', '89013', '王昌福', '', '', '', '', '', 0, NULL, NULL, NULL),
('89020', '89020', '谭宜家', '', '', '', '', '', 0, NULL, NULL, NULL),
('89023', '89023', '江莹茵', '', '', '', '', '', 0, NULL, NULL, NULL),
('89034', '89034', '余建辉', '', '', '', '', '', 0, NULL, NULL, NULL),
('89036', '87840441', '朱玉灿', '男', '', '数学系', '13950490098', 'zhuyucan@fzu.edu.cn', 0, NULL, NULL, NULL),
('89043', '89043', '张革', '', '', '', '', '', 0, NULL, NULL, NULL),
('89062', '89062', '张碧霞', '', '', '', '', '', 0, NULL, NULL, NULL),
('89085', '584600', '郭红', '女', '', '软件工程系', '13305015846', 'guohongfz@163.com', 0, NULL, NULL, NULL),
('89086', '89086', '张莹', '', '', '', '', '', 0, NULL, NULL, NULL),
('89087', '89087', '林晓东', '', '', '', '', '', 0, NULL, NULL, NULL),
('90002', '90002', '王美清', '女', '', '数学系', '13599409566', 'mqwang@fzu.edu.cn', 0, NULL, NULL, NULL),
('90007', '90007', '吴其平', '', '', '', '', '', 0, NULL, NULL, NULL),
('90009', '90009', '林桂伍', '', '', '', '', '', 0, NULL, NULL, NULL),
('90010', '90010', '王灿辉', '男', '', '软件工程系', '13906909734', 'wangcanhui@fzu.edu.cn', 0, NULL, NULL, NULL),
('90042', '90042', '游华', '', '', '', '', '', 0, NULL, NULL, NULL),
('91100', '91100', '邵志强', '', '', '', '', '', 0, NULL, NULL, NULL),
('91111', '91111', '江辉有', '', '', '', '', '', 0, NULL, NULL, NULL),
('92022', '92022', '阮一文', '', '', '', '', '', 0, NULL, NULL, NULL),
('92034', '92034', '陈晓云', '', '', '', '18060853153', '', 0, NULL, NULL, NULL),
('92061', '92061', '黄建军', '', '', '', '', '', 0, NULL, NULL, NULL),
('92092', '92092', '林丽平', '', '', '', '', '', 0, NULL, NULL, NULL),
('92146', '92146', '黄志华', '', '', '', '', '', 0, NULL, NULL, NULL),
('94080', '94080', '张华娣', '', '', '', '', '', 0, NULL, NULL, NULL),
('94104', '94104', '胡彦', '', '', '', '', '', 0, NULL, NULL, NULL),
('94138', '94138', '史丹双', '', '', '', '', '', 0, NULL, NULL, NULL),
('94174', '94174', '叶福玲', '', '', '', '', '', 0, NULL, NULL, NULL),
('94176', '831777', '汪璟玢', '', '', '软件工程', '18959160809', 'wjbcc@263.net', 0, NULL, NULL, NULL),
('94178', '94178', '韩晓芸', '', '', '', '', '', 0, NULL, NULL, NULL),
('94707', '94707', '郑净', '', '', '', '', '', 0, NULL, NULL, NULL),
('95013', '95013', '郑爱明', '', '', '', '', '', 0, NULL, NULL, NULL),
('95015', 'lilysu135791', '苏力', '女', '', '网络与信息安全', '13809556177', 'suli@fzu.edu.cn', 0, NULL, NULL, NULL),
('95018', '95018', '钟春芳', '', '', '', '', '', 0, NULL, NULL, NULL),
('95057', 'dsj605', '丁善镜', '男', '', '软件工程', '18060475815', 'dingfzu@163.com', 0, NULL, NULL, NULL),
('95098', '!)!#^@(ling', '何萧玲', '女', '', '网络工程与信息安全系', '18950304593', 'hxl@fzu.edu.cn', 0, NULL, NULL, NULL),
('96007', '96007', '谢丽聪', '', '', '', '', '', 0, NULL, NULL, NULL),
('96009', '96009', '李应', '', '', '', '', '', 0, NULL, NULL, NULL),
('96031', '147971', '林常俊', '男', '', '信息安全与网络工程系', '13015750564', 'prospect2004lin@163.com', 0, NULL, NULL, NULL),
('96066', '96066', '于志敏', '', '', '', '', '', 0, NULL, NULL, NULL),
('96070', '721020', '刘延华', '男', '', '信息安全与网络工程系', '18950477882', 'lyhwa@fzu.edu.cn', 0, NULL, NULL, NULL),
('96071', '96071', '范红', '', '', '', '', '', 0, NULL, NULL, NULL),
('96180', '96180', '朱兴文', '', '', '', '', '', 0, NULL, NULL, NULL),
('96182', '96182', '蒋雪芳', '', '', '', '', '', 0, NULL, NULL, NULL),
('96200', '96200', '张惠英', '', '', '', '', '', 0, NULL, NULL, NULL),
('97075', '97075', '周向东', '', '', '', '', '', 0, NULL, NULL, NULL),
('97144', 'allgreat', '刘漳辉', '男', '', '信息安全与网络工程系', '13809504625', '492339385@qq.com', 0, NULL, NULL, NULL),
('98003', '98003', '舒志彪', '', '', '', '', '', 0, NULL, NULL, NULL),
('98004', 'nyt2016', '倪一涛', '男', '', '网络工程与信息安全', '13960821056', 'yitao_ni@fzu.edu.cn', 0, NULL, NULL, NULL),
('98006', '98006', '常安', '', '', '', '', '', 0, NULL, NULL, NULL),
('98041', '98041', '叶菁', '', '', '', '', '', 0, NULL, NULL, NULL),
('98076', '98076', '翁爱治', '', '', '', '', '', 0, NULL, NULL, NULL),
('99004', '99004', '江良平', '', '', '', '', '', 0, NULL, NULL, NULL),
('99006', '99006', '刘传才', '', '', '', '', '', 0, NULL, NULL, NULL),
('99007', '99007', '刘宁燕', '', '', '', '', '', 0, NULL, NULL, NULL),
('99009', '99009', '章红梅', '', '', '', '', '', 0, NULL, NULL, NULL),
('99035', '99035', '余根坚', '', '', '', '', '', 0, NULL, NULL, NULL),
('99064', '99064', '方秀端', '', '', '', '', '', 0, NULL, NULL, NULL),
('sj073', 'sj073', '张晴', '女', '', '教学办', '18649717168', '471767305@qq.com', 0, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- 表的结构 `user_teaching_office`
--

CREATE TABLE `user_teaching_office` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL COMMENT '工号',
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '密码',
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '姓名',
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL COMMENT '联系方式',
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL COMMENT '邮箱',
  `avator` varchar(200) CHARACTER SET utf8 DEFAULT NULL COMMENT '头像'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teaching_office`
--

INSERT INTO `user_teaching_office` (`workNumber`, `password`, `name`, `telephone`, `email`, `avator`) VALUES
('00001', '00001', '陈齐民', '15659754690', '282129796@qq.com', '/uploads/teachingOfficer\\20161208\\ff7059b4dfb8899a26b8ceddc3d34357.jpg'),
('90002', '90002', '王美清', '', '', NULL),
('sj073', 'sj073', '张晴', '', '', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tc_departheadright`
--
ALTER TABLE `tc_departheadright`
  ADD PRIMARY KEY (`drid`);

--
-- Indexes for table `tc_grade`
--
ALTER TABLE `tc_grade`
  ADD PRIMARY KEY (`gid`);

--
-- Indexes for table `tc_issue_2014`
--
ALTER TABLE `tc_issue_2014`
  ADD PRIMARY KEY (`pid`);

--
-- Indexes for table `tc_result_2014`
--
ALTER TABLE `tc_result_2014`
  ADD PRIMARY KEY (`rid`);

--
-- Indexes for table `tc_voluntaryinfosetting`
--
ALTER TABLE `tc_voluntaryinfosetting`
  ADD PRIMARY KEY (`vsid`);

--
-- Indexes for table `tc_voluntary_2014`
--
ALTER TABLE `tc_voluntary_2014`
  ADD PRIMARY KEY (`vid`);

--
-- Indexes for table `user_department_head`
--
ALTER TABLE `user_department_head`
  ADD PRIMARY KEY (`workNumber`);

--
-- Indexes for table `user_student_2014`
--
ALTER TABLE `user_student_2014`
  ADD PRIMARY KEY (`sid`);

--
-- Indexes for table `user_teacher`
--
ALTER TABLE `user_teacher`
  ADD PRIMARY KEY (`workNumber`);

--
-- Indexes for table `user_teaching_office`
--
ALTER TABLE `user_teaching_office`
  ADD PRIMARY KEY (`workNumber`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `tc_departheadright`
--
ALTER TABLE `tc_departheadright`
  MODIFY `drid` mediumint(8) NOT NULL AUTO_INCREMENT COMMENT '权限编号';
--
-- 使用表AUTO_INCREMENT `tc_grade`
--
ALTER TABLE `tc_grade`
  MODIFY `gid` mediumint(8) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '年级记录编号', AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `tc_issue_2014`
--
ALTER TABLE `tc_issue_2014`
  MODIFY `pid` mediumint(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;
--
-- 使用表AUTO_INCREMENT `tc_result_2014`
--
ALTER TABLE `tc_result_2014`
  MODIFY `rid` mediumint(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- 使用表AUTO_INCREMENT `tc_voluntaryinfosetting`
--
ALTER TABLE `tc_voluntaryinfosetting`
  MODIFY `vsid` mediumint(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `tc_voluntary_2014`
--
ALTER TABLE `tc_voluntary_2014`
  MODIFY `vid` mediumint(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=71;
--
-- 使用表AUTO_INCREMENT `user_student_2014`
--
ALTER TABLE `user_student_2014`
  MODIFY `sid` mediumint(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=71;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
